{
    "messages": [
        {
            "message_text": "OpenSay APP  1:44 PM Anonymous broadcast hey, not sure if this question would be suited to this channel but here goes. So I've worked in agencies and in house for about 5 years now and have decided to do it myself now, thing is getting clients isn't my strong point, I'm trying lots of methods but Im not sure what to stick to. Could anyone share some tips on how you got new clients? I know it's a very basic question, apologies for that @OpenSay free plan limits are nearing - please ask management to upgrade Reply Anonymously Created with /anon OpenSay Pricing | OpenSay Easy setup. Unlimited members. Get started for free! (168 kB) https://opensay.co/pricing/?team_id=T05JAV4R9K2 7 replies Last reply 3 months ago",
            "replies": [
                "Adam Humphreys   3 months ago lol, those appointment getting people harass me with 8-10 messages a day. Many people say linkedin works for them and others say speaking. Ive been a referral based business for two decades. Speaking definitely does work and in any capacity sharing knowledge.",
                "Jameson Treseler   3 months ago We do LinkedIn. Its ok so far. Not a fan of the appointment setters. The only one that worked for me was Leadium. But no sales came of it. But we got a bunch of appointments.",
                "Adam Humphreys   3 months ago The more targeted the outreach likely the better. I am curious about this rocketreach which had my contact details and what the best is since huntr.io allegedly is no longer doing it.",
                "Jameson Treseler   3 months ago Never heard of them! We use Apollo.io for contact targeting. Ive heard good things about seamless.ai",
                "Adam Humphreys   3 months ago https://hunter.io/ Hunter Find email addresses in seconds  Hunter (Email Hunter) Hunter is the leading solution to find and verify professional email addresses. Start using Hunter and connect with the people that matter for your business. (77 kB) https://hunter.io/",
                "Rik Snuiverink   3 months ago I have used hunter.io before I wasnt impressed at all. Lots of it not the right mailadresses and or people to contact. If you do outreach and target particular websites I think you should ensure that your data is manually collected . Along with a relevant message. Probably the best way to generate results. And asking in here for the golden egg is probably not going to be your best option. For many of us it takes years to build up a brand, the way you generate your leads. You said you worked in a agency before how did they do it then ? (edited) ",
                "Adam Humphreys   3 months ago Most agencies will not share how they are doing lead generation with staff."
            ]
        },
        {
            "message_text": "Emily Brady   10:19 AM Hi all! I hope this is the right place for this. I have a friend at SaaS startup (finance vertical, to my understanding) who is looking for an agency to help w/ SEO strategy. Based on my convo w/ them, they're looking for both technical SEO and content consulting from an agency that is pretty hands on. Any recs are much appreciated! +3 12 replies Last reply 3 months ago",
            "replies": [
                "Tory Gray   3 months ago Ill do the cheeky thing and raise my own hand! Heres us: https://thegray.company/ (edited)  1",
                "Kyle   3 months ago Great post for #jobs channel 1",
                "Emily Brady   3 months ago Thank you, Tory! (Cheeky answers more than welcome! I will pass it along!) I'll drop this in the Hiring channel as well 1 1",
                "Adam Humphreys   3 months ago Technical SEO is very much my wheelhouse. 1",
                "Rhea Drysdale   3 months ago I'll also say hello. Feel free to send them our name - https://outspokenmedia.com/ and rhea@outspokenmedia.com if they'd like to talk further. Happy you've got them in a good group regardless of fit. 1",
                "Rhea Drysdale   3 months ago I wonder if there should be a referral channel? Connections for aligned leads, contractors, etc. Maybe a little diff than hiring? cc @Noah 1",
                "Adam Humphreys   3 months ago That would be a good idea. I work with different agencies and its worked well.",
                "Kyle   3 months ago Does SEO slack get a 10% cut for the referral fee? 2 2",
                "Noah   3 months ago spitting out drink (881 kB) https://media2.giphy.com/media/hvq8ONQhQ1XLq/giphy.gif?cid=6104955e8p2a4fxfz752v8p7oifj57fhu6np0qz7o6czmppn&ep=v1_gifs_translate&rid=giphy.gif&ct=g Posted using /giphy",
                "Adam Humphreys   3 months ago I would say a cookie but Chrome says no",
                "Joshua Poole   3 months ago Hi @Emily Brady - we have great experience in the SaaS space. Have worked with a range of products and achieved great results. Happy to chat. https://studiohawk.com.au/ (edited)  StudioHawk StudioHawk | Best Global SEO Agency Winner We're a Specialist SEO Agency focused on one thing, building SEO campaigns that give you a tangible ROI. Stop hanging with turkeys & soar with the hawks! Est. reading time 1 minute 1",
                "Jon Clark   3 months ago Hey @Emily Brady new to the Slack community so a little late to respond to this ;) But we do a lot of work with startups (Public, Roman, Unest to name a few) and our specialty is regulated industries (finance / healthcare). Would love an introduction to see if were a good fit jon@movingtrafficmedia.com. 1"
            ]
        },
        {
            "message_text": "Alex Wilson   8:33 AM Anyone have a recommendation for sales pipeline software? Looking to get my sales processes out of clickup, which is where I manage everything right now, and into a proper system. bonus points if it has document signing built in 1 +3 9 replies Last reply 2 months ago",
            "replies": [
                "Chase Freezman   3 months ago Pipedrive has been really useful as well as Hubspot 1",
                "Kyle   3 months ago I used bonsai - mixed feelings but was happy with doc management",
                "Jameson Treseler   3 months ago Hubspot free is great. Too expensive tho for the paid product. At least for us ",
                "Corey Northcutt   3 months ago it depends but Copper has been my choice for an agency on Google Workspace with a few reps, minor complexities, heavy automation. 1",
                "Benjamn Conde   3 months ago Zoho CRM or Bigin, depending of which features you want. Two of the best CRMs in the market and far cheaper than others (edited) ",
                "Joshua Poole   3 months ago hubspot - 100% 1",
                "Joshua Poole   3 months ago marketing tool + sales tool",
                "Iquo Inyang   2 months ago I just fell in love with Go High Level. Agency game changer. Let me know if youd like a link for a free trial.",
                "Adam Humphreys   2 months ago Ive really been looking at Pipedrive. Why Hubspot and Pipedrive?"
            ]
        },
        {
            "message_text": "Kelly G.   9:39 AM What is everyones favorite rank tracking software? (edited)  9+ 19 replies Last reply 13 days ago",
            "replies": [
                "Kyle   3 months ago Nozzle (cc @Derek Perkins ) Or custom using API (valueserp, dataforSEO, etc) 6 2 1",
                "Jordan Choo   3 months ago Whitespark! 1",
                "Kelly G.   3 months ago Thank you!",
                "Shawn   3 months ago GetStat - super customizable, great data/insights, scaleable (edited)  3 3",
                "Derek Perkins   3 months ago thanks @Kyle !",
                "Tory Gray   3 months ago Im exploring iPullRanks ExactScience tracker - pretty dang cool: https://www.exactscience.io/ ExactScience ExactScience - Rank Tracking at Scale - ExactScience ExactScience is a tool that tracks real SERPs at scale. Discover how your domains actually show up in search engine result pages organically. Est. reading time 17 minutes https://www.exactscience.io/ 1 1",
                "Duncan Sze   2 months ago Appreciate the shout out @Shawn .  Thank you.",
                "Andrew Shotland   2 months ago We use https://trajectdata.com/. Think its on par with GetStat. https://www.serpwow.com/ is there data portal. Traject Data Traject Data | SERP APIs & eCommerce APIs Traject Data delivers high-volume search and eCommerce data  at scale. Our SERP APIs and eCommerce APIs integrate with your existing data ecosystem so you get a customized view of your data. Written by Anthony Skelton Time to read 1 minute Mar 31st SerpWow SerpWow - SERP API - Search Engine Results API SerpWow is a real-time SERP API for Google, Bing, Yahoo, Baidu, Yandex & Naver Search Results. Get clean structured JSON SERP results.",
                "Jason Wilson   2 months ago Accuranker is good but it's expensive as hell and hard to cancel. RankTank extension for sheets is good and pretty reasonable on price if you want to do single pulls. DemandSphere is awesome and the team there is really cool. I haven't used it but I did a demo and really liked the functionality. Also pretty expensive but could be a good alternative to Conductor or BrightEdge if you are doing Enterprise. 2",
                "Jason Wilson   2 months ago A lot of Enterprise and in-house teams use Stat and tap into their API 4 1 1",
                "Ben Fisher   2 months ago Whitespark, Placesscout 2",
                "Garrett Sussman   2 months ago Thanks for checking it out, @Tory Gray ! 1",
                "Tory Gray   2 months ago Anytime, @Garrett Sussman :D 1",
                "Justin Briggs   2 months ago GetStat for large-scale tracking. SEMRush projects for quick ad-hoc checks (research, biz cases, etc.). 2 1",
                "Alex Harford   2 months ago Search Console. It'd be great if Bing had similar. Paid-wise, Stat was my favourite, but SEOmonitor is now used at the agency I work for. It seems good but has occasional blips with data. (edited)  1",
                "Cherie Dickey   2 months ago We use Agency Analytics for our reporting. It has a built in rank tracker that we have to use for client reporting since there's no integration for another method available. It will integrate with other platforms such as GSC, but not for rank tracking. It works well enough though. 2",
                "Jason Wilson   2 months ago @Cherie Dickey good call! AA is really nice for custom reports and its a lot easier to use than Looker Studio. 1",
                "Boyd Norwood   13 days ago I use Nozzle. Learn more here: nozzle.io/videos I also work at said company, fyi."
            ]
        },
        {
            "message_text": "Jameson Treseler   10:55 AM Was able to replace a really crappy client with one that weve had really cool experiences with.   18",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Charbel Raffoul   8:25 PM Hey guys, just wondering for the peeps that work in agency roles. What are you doing to store your client's historical UA data ? Are you using bigquery? Third party providers to make it easier to manage? Would be interested in seeing what other agencies are doing in this space. Thanks! 13 replies Last reply 2 months ago",
            "replies": [
                "Andrew Shotland   2 months ago Big query",
                "Charbel Raffoul   2 months ago Thanks @Andrew Shotland . Are you using Big Query with Google Sheets to show the data to clients? Or something else? Like Whatagraph ?",
                "Dana DiTomaso   2 months ago https://analyticscanvas.com/google-analytics-ua-backup-service/",
                "Dana DiTomaso   2 months ago And BigQuery via Looker Studio",
                "Andrew Shotland   2 months ago Looker",
                "Andrew Shotland   2 months ago But tbh most clients don't really care",
                "Dana DiTomaso   2 months ago Nope. They just want pretty reports with lines that go up and to the right and don't take forever to load. 1 1",
                "Charbel Raffoul   2 months ago Haha pretty much @Dana DiTomaso . Are you currently using analyticscanvas? I've come across it in the past",
                "Dana DiTomaso   2 months ago We're not -- I have tried it but it just wasn't a good fit for me. I know that lots of people really like it, though.",
                "Dana DiTomaso   2 months ago We do use their UA export service, though.",
                "Noah   2 months ago Great thread.",
                "Chris Johnson   2 months ago @Dana DiTomaso Any issues with their UA export to BigQuery?",
                "Dana DiTomaso   2 months ago @Chris Johnson None so far -- we've just been asking clients to do it so that it's their BQ workspace etc."
            ]
        },
        {
            "message_text": "Anthony Barone   7:11 AM How many people have been locked out of Semrush and had their accounts disabled recently? +1 7 replies Last reply 2 months ago",
            "replies": [
                "Michael Ferrari   2 months ago You probably checked this already, but that happened to me once when I turned off auto pay and forgot to update my subscription. It also happens when someone else is using my account. 3",
                "Shawn   2 months ago Mine is, but we didnt do auto renew so waiting on my boss to pay again 2",
                "James Wirth   2 months ago It has happened to me because of multiple logins - I had to contact them and they unlocked it",
                "Chris Johnson   2 months ago Happens to us a lot with people logging in from home.",
                "Adam Humphreys   2 months ago Id honestly recommend looking at some alternatives to SEMRush. Ahrefs, Inlinks, Clearscope etc have a lot more sophistication.",
                "Anthony Barone   2 months ago Yeah been getting killed on the account disabling, i don't own as many devices in the company as they say are logging in to the account, so keep battling them",
                "Chris Johnson   2 months ago We have big issues with their pricing unfortunately. You get more for your money buying multiple Guru accounts than having Business accounts. We're constantly locked out and have to go through their sales dept. who are convinced they can do us a \"deal\" and their offer is always worse than just keep buying more Guru accounts. 2"
            ]
        },
        {
            "message_text": "This message was deleted. 2 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago Hey @Shayan Nabi ! Please post this in #jobs-looking or #shameless-plug; thanks!",
                "Shayan Nabi   2 months ago Thanks Klye :)"
            ]
        },
        {
            "message_text": "Alex Wilson   10:51 AM Ok agency owners out there. Trying to get my internal systems up to snuff here. Wanted to see what applications everyone us using for their business management and if I am missing anything. Right now I am using: Google Workspace for email, file management, docs, etc ClickUp for project management and time tracking Wave accounting (soon moving to QuickBooks online) Slack for communication SEMRush for SEO stuff I feel like I need: CRM / Pipeline Management - free or cheap Proposal and Contract Management - hopefully connecting to CRM and ClickUp Document Signing - hopefully connecting to contract and proposal management? Credit Card Processor - Do you guys take cards? Checks only? Anything I am missing? Are you guys doing anything like that 1 7 replies Last reply 2 months ago",
            "replies": [
                "Mark Howser   2 months ago Here's my ideal tool stack: Elementor (for my website) Sitebulb (tech SEO) Screaming Frog (tech SEO) SEOmonitor (SEO forecasting for sales pitches to show the overall potential of our work) Ahrefs Pitchbox (link building) Keyword Insights (keyword clustering) ChatGPT Premium (automation) GPT for Work (automation) Quickbooks (expenses + revenue + taxes + invoice management) DocuSign (contract management) Gusto (if I hire employees one day) Dreamhost + Google Business Lili (the free version is sufficient for banking) Upwork (for freelancers) Calendly (meeting scheduling, but could be handled for free with Google) SalesQL (email + phone number finder for cold outreach) OctopusCRM (automate LI connection requests) Yesware (cold email outreach management) LinkedIn Sales Navigator (finding potential clients) (edited)",
                "Tess Voecks   2 months ago You can totally use clickup as a CRM and also as a documentation tool too!",
                "Alex Wilson   2 months ago Currently using clickup as CRM, and will probably keep all my SOPs and such in there. Just not sold on using it for CRM long term. 1",
                "Jono Alderson   2 months ago Notion is better as a CRM than Clickup IMO. Hard to break away from clickup's task-centricity. Google Calendar's scheduling thing is a pretty good (and free) replacement for calendly  (edited) ",
                "Mark Howser   2 months ago I second Notion. It has a little bit of a learning curve, but I really like it.",
                "Alex Wilson   2 months ago How do you guys manage contracts? Like when they are expected to end, etc"
            ]
        },
        {
            "message_text": "Adam Humphreys   4:12 PM Do you folks publish your prices on your site? I feel like for enterprise it can hurt you and for smaller business the same. Theres so many conditionals that it makes it difficult to say from X because they dont know what all goes into the work from one agency to the next. +4 41 replies Last reply 2 months ago",
            "replies": [
                "Jameson Treseler   2 months ago I don't, because it's so situational.",
                "Adam Humphreys   2 months ago I might start doing it for local SEO because there are some fundamental addons that arent too bad and pretty much the same across all clients.",
                "Dana DiTomaso   2 months ago I find that clients who care about prices up front are bad clients. 5",
                "Stephanie Briggs   2 months ago If I think I might be out of budget for them, in my first email, Ill usually add that I need an $X,XXX per month for 3 months minimum commitment and the typical price for a site like theirs is [range], does that seem feasible?- which I have found to be helpful. If its a bigger brand who I know has budget, I dont anchor them and just set up a sales call.  (edited)  4",
                "Jason Wilson   2 months ago I thought about putting pricing on my site to get rid of tire kickers and time wasters. I havent tried it yet and my prices freak some people out. But I dont want to talk to those people, they arent serious. Will let you know if I try it. 1",
                "Alex Wilson   2 months ago depends on your target market. a lot of smaller businesses want to see those numbers to see if its even worth talking. 1",
                "Alex Wilson   2 months ago I used to have them listed at like starting at prices.",
                "Griffin Roer   2 months ago @Jason Wilson We publish our \"Starting\" prices for that very reason. We know our minimums and don't want to waste our time or anyone else's who are booking a call only to find our pricing is out of their budget. Ultimately our pricing is pretty flexible and situational but publicly sharing our floor has been helpful (edited)  2",
                "Mark Howser   2 months ago I think the more important question is how many potential clients come from demand gen vs referral or other sources. If most are coming through demand gen, then it might make sense to include it. If that's the case, I think it's a good idea to post a range or starting price. You could do an initial 2 month short-term contract to do tech / content / link audits at a fixed price (which is usually an easy sell because people don't like to overly commit at first), and then provide them with a few different roadmaps at the end of the audits where the increase in investment means that you'll complete the roadmap quicker. You can steer them to one time table or the other based on what you think the best fit for them is. You can then communicate this on your pricing page, and explain how it's influenced, which is mostly time. The more money, the more time they get. I think SEOs tend to be a little too apprehensive about communication around time. You can still have retainers yet be transparent about time estimates. I think it saves us from a lot of scope creep down the road. (edited)  1",
                "Jameson Treseler   2 months ago We do something kinda like that. We have set pricing tiers, and let them know what they get with each. If they ask for something out of scope, then we'll do it the first time (usually, unless it's insane), but if they ask again, we tell them the need to upgrade. 1",
                "Adam Humphreys   2 months ago @Dana DiTomaso   this is so very true. The businesses that focus on this too much arent going to likely make it beyond a year in my experience.",
                "Alex Wilson   2 months ago @Adam Humphreys I disagree. I know many agencies that have really specific scopes are very specific price points and do very well. It is higher volume, specific deliverables. For example, if I had to set up a consult because I wanted 5 social media designs per month, thats crazy.",
                "Adam Humphreys   2 months ago @Alex Wilson the businesses that are only about price will always look for quick wins in any way possible and to the cheapest vendors. Theyre a waste of time.",
                "Alex Wilson   2 months ago They may be a waste of time for your business model. Every early stage company from local services to ecommerce companies to small town retailers are very concerned about budget. And there was over 5 million new business registrations last year alone. If you can get a productized offering that you can nail efficiently for a reasonable price, why not do it?",
                "Adam Humphreys   2 months ago For the local space its doable but something for a lawyer is not the same as a baker if that makes sense sweat equity wise.",
                "Ben Fisher   2 months ago We do for transparency sake..",
                "Adam Humphreys   2 months ago Weird, I dont see it on your site.",
                "Jameson Treseler   2 months ago @Adam Humphreys building and optimizing a site for a lawyer right now. Definitely different than a baker",
                "Adam Humphreys   2 months ago I would not want to be in the ads space for lawyers. They get so many negative SEO campaigns.",
                "Jameson Treseler   2 months ago Do tell",
                "Adam Humphreys   2 months ago California seems to get a lot of people in competitive areas like plumbing and legal with people clicking on phone extension ads to burn out competitor spend for the day fast. Its highly unethical and very common. Google does not care about this at all. Im personally only in organic for that reason LSA aside.",
                "Jameson Treseler   2 months ago Yeah that sounds brutal. Click Cease might help with that, I know they do something similar for larger brands.",
                "Adam Humphreys   2 months ago Its not overly effective",
                "Mark Howser   2 months ago Ryan Stewart built a micro-site specifically to sell SEO services to lawyers. Seems he's figured out a good formula. I'd check out his YouTube. It can be highly profitable; lawyers tend to have money to spend, much like SaaS. 1",
                "Jameson Treseler   2 months ago Eh - most lawyers cry poor. I work with a lot of them, can't tell you how many complain about $3k/mo being ridiculously expensive",
                "Jameson Treseler   2 months ago I'd say they're more like hospitality clients, if you've ever had to deal with them.",
                "Adam Humphreys   2 months ago I really enjoy working with the medical space.",
                "Adam Humphreys   2 months ago I enjoy the challenges of legal though.",
                "Mark Howser   2 months ago The main reason I don't like SaaS is it'd be difficult to build a scalable process around. I feel like eComm is much more straightforward for me to build processes and potentially automate a lot of the work.",
                "Adam Humphreys   2 months ago Ecommerce is fun. I havent seen too much of that over the years. Ive made clients so much money in ecommerce that they would pull budget because it was taking away attention from their high ticket items in the marine space lol.",
                "Jameson Treseler   2 months ago SaaS isn't that bad.",
                "Mark Howser   2 months ago Yeah I worked on an enterprise team that had https://defender.com/en_us/ as a client back in the day and eComm SEO was INSANE for them Defender Marine and Boat Supplies - Marine Outfitters Of Choice | Defender Defender Marine offers boat supplies, inflatable boats and outboard motors from top manufacturers. All your boat supplies and boating needs, including marine electronics, sailing hardware, plumbing, ventilation, epoxies, boat paints. Knowledgeable staff and fast shipping. 1",
                "Mark Howser   2 months ago You're right, SaaS isn't that bad. But my current company has required a lot of custom work. I think if you're careful about which companies you work with, you can filter out a lot of custom work.",
                "Mark Howser   2 months ago Like we've had to completely redo page templates, clean up the IA, find a lot of unobvious keywords to build content around, etc. It's been A LOT of work, but it's certainly paid off for them.",
                "Mark Howser   2 months ago I also like having clean attribution in GA, and it's been a nightmare getting that setup. eComm is much more straighforward when it comes to attribution.",
                "Adam Humphreys   2 months ago The content strategy is something I super enjoy building out. Then giving it to the copywriter to work on. Theres something fun about finding opportunities from talking to customers. Theyre so appreciative when you listen to them and focus on what moves the meter for them. 2",
                "Mark Howser   2 months ago Do you build outlines for them?",
                "Mark Howser   2 months ago I've found SurferSEO is a great / easy tool to streamline that work.",
                "Adam Humphreys   2 months ago I do content triage sheets. Factors of consideration: rank, keyword query (potential volume on improved placement, especially if its a small local business), average traffic over the past year, check for plagiarism, and check for ease of improvement. I do this by quarter and line up 3 months to a year of approval. I also factor in the gap analysis for similar top sites in their industry and compare it to sites across top cities with the highest competition. I build out keyword clusters after client approval and the headings of focus because I find when thats not done copywriters can sometimes go off on tangents that lose focus. 1 React",
                "Jason Wilson   2 months ago Fire process, I like that. I dont use Surfer, but I built a process for using On-Page.ai, Thruuu, and Scalenut to generate killer content briefs will type it out and share sometime but I have some deadlines on a Friday?!"
            ]
        },
        {
            "message_text": "Jordan Silton   9:16 AM A close colleague and friend just asked me for a list of the top handful of SEO agency's I'd recommend. That's like asking for the best type of bourbon or wine. How can you pick just one, or even a few? There are so many options and people/firms that are best-in-class for different flavors of SEO. For example, we all know (or should know) that @Andrew Shotland is at the forefront of local SEO for multi-location brands. Who are your go-to agencies for which specialities? +4 22 replies Last reply 2 months ago",
            "replies": [
                "Kavi Kardos   2 months ago Hey Jordan, we specialize in SaaS and ecommerce brands at Uproer. I think the decision for me comes down to aligning the brand with not only the agencys specialty vertical(s) but also their proven success working with brands who have similar structures/challenges/opportunities to your own. If theyre looking for SEO, it also helps to focus on agencies that are either highly search-focused or at least have robust search departments.",
                "Jason Wilson   2 months ago Too many to list",
                "Jason Wilson   2 months ago All based on niche and SEO specialties but if you narrow it down that helps!",
                "Jason Wilson   2 months ago Also agency vs consultant. Big difference. 2 1",
                "Tyler Brown   2 months ago I think it also depends on whether or not you want the agency to execute on tasks, or advise and consult. I've always been a little...skeptical on agencies when it comes to the former. 1",
                "Jameson Treseler   2 months ago @Tyler Brown i'm skeptical of agencies that lead with that. We're lucky in that most of our clients are fintech brands who don't want us touching their code for compliance reasons, and have their own dev team.",
                "Jared McKiernan   2 months ago For B2B SaaS, John-Henry Scherck's Growth Plays is the best choice. I'm not sure why you'd pick an agency over a consultant if you just want them to advise! (personal bias: i'm a solo consultant)",
                "Andrew Shotland   2 months ago @Jordan Silton Appreciate the hype! In an effort to not appear like the shameless self-promoter I am, Id echo @Jared McKiernan s recommendation for John-Henry. To be fair, I have never actually worked with JHS, but I have hired people who have and I have had some great conversations with him over the years that lead me to believe he does great work. That said, if a solo consultant is your jam, you likely can do no better than @Jared McKiernan 3",
                "Jordan Silton   2 months ago I think Id offend a bunch of great SEOs at agencies if I said that consultants are better for strategy than agencies. There are great SEOs all over the place, and I agree consultants are a good option too 2",
                "Andrew Shotland   2 months ago Heres how Id look at it: Do you just need strategic & technical consulting? If so, either an agency or a consultant should be able to help (depending on the agency/consultant, of course). For example, we could provide this as a project or ongoing service (shameless plug), but I know several agencies I would never trust with this kind of thing, and there are likely a ton of consultants who have never worked on anything seriously complex, so YMMV.  Do you need arms & legs? This is where an agency will often be a better choice. Of course, plenty of consultants (and agencies) subcontract out stuff, so you could be hiring an agency, and actually you are hiring an army of consultants. I am guessing this stuff is pretty obvious, but I am trying not to use Xitter and LinkedIN to post obvious self-promotional stuff, so here we are 2",
                "Jordan Silton   2 months ago This is right",
                "Jordan Silton   2 months ago So, feel free to let this thread die if it's not interesting or helpful to anyone else, but ... For #1 on the strategy and technical side (whether agency or individual), who is the best at individual subsets of SEO? Let's throw in another example Bartosz and Onely are great at Technical SEO. Yes, they can do anything, but technical audits and investigations are their jam. One more would be Cindy Krum and Mobile Moxie. Back before everything was mobile, they were the go-to experts on mobile SEO. If you want to talk about international SEO, Aleyda Solis is top-notch as are Bill and Motoko Hunt. Who are the other agencies or consultants you would turn to, and where do they thrive?",
                "Andrew Shotland   2 months ago Let's keep it going -it's Friday - Devil's Advocate: You are only naming people who are \"known\" for being the best, regardless of whether or not they actually are. For example, LSG may be the best at multi-location. Then again, how can you tell? We do a lot of work there and we talk about it a lot, but we could also royally suck at it. I am sure Cindy is great at mobile and Bartosz at tech, but LSG has done only about a thousand mobile and tech SEO projects, so I am going to go out on a limb and say we're just as good at those as we are at multi-location (shameless plug). Oh I don't even know what point I am trying to make here, other than there are a ton of great seos. Just because someone plays an expert on one thing or another on SEO Twitter may not be a great reason to recommend them. 1 1 2",
                "Jordan Silton   2 months ago I can vouch for first hand experience with Onely and Bartosz. The rest are assumptions, correct! I want to know peoples real experiences",
                "Jared McKiernan   2 months ago Lots of great SEOs, way more terrible SEOs.",
                "Rhea Drysdale   2 months ago Shameless plug from a reluctant marketer, but I've heard through the grapevine we're one of those good quality consultancies -- Outspoken Media. And, I'd second everyone Jordan mentioned. We work with Bill Hunt on a global ecomm and back in the day I had the honor of working with Cindy for a bit. Best of the best in their areas. I'd also throw Re:Signal into the mix for Europe as well as SALT and Locomotive for technical. (edited) ",
                "Jonas Sickler   2 months ago Several thoughts come to mind here when choosing an SEO partner. Id recommend asking these questions to narrow down the list: Do you need short-term or project-based support? Do you want consulting to help you stand up an in-house team? Do you need niche expertise in a YMYL space? Do you want a full-service partner that delivers ready-to-publish content? Do you need a long-term partner that elevates SEO into a broader marketing initiative, informs business strategy, strengthens customer connections, and creates brand equity? Other considerations: Look for an SEO partner that exclusively works with companies of your size. It takes a very different methodology to deliver value to a small business or SME vs a Fortune 500 organization. SEO definitely isnt one size fits all, so find a partner that specializes in your industry and works with companies like yours. Logos are misleading. Although we all love to see recognizable logos of former clients brazened across a homepage, they rarely mean anything. Those logos could have been one-off PPC or email campaign partners not long-term SEO partners. And the presence of a logo doesnt mean value was delivered. In most cases, very large brands dont like their logos being used publicly as a form of testimonial. So you may need to ask for a list of customers privately In some cases, brands may be looking for SEO initially, but based on their needs, they may find what they actually need is Owned Asset Optimization (OAO) - which is a more integrated version of SEO that uses search data to inform and optimize assets, which can then be leveraged across multiple digital marketing channels. (edited)  1",
                "Rhea Drysdale   2 months ago @Katerina Rieckel tagging you 1 1",
                "Rhea Drysdale   2 months ago @Andrew Shotland your point above left an impression and I wanted to note how easy it is to get pigeon-holed. I'm more of a generalist. Over the years folks wanted me to only speak on a or b. It was frustrating to the point that I stopped speaking to fit someone else's agenda and shrunk my visibility. I don't think that benefited my career. Specialists do climb a bit higher, so just a note that you're absolutely right and this is where first hand experience and referrals are so powerful in our space.",
                "Rhea Drysdale   2 months ago Tagged my strategist colleague in because we enjoy the consultant vs industry, generalist vs specialist debate.",
                "Andrew Shotland   2 months ago @Rhea Drysdale (the burrito is a sign of high praise at LSG). For the record, a billion years ago we were hired by Coupons.com and @Rhea Drysdale was consulting for them. They showed me her recommendations and I think my first response was why did you hire us? These seems spot on.",
                "Rhea Drysdale   2 months ago Ha, thanks for the burrito! I had to pull out the microfiche to locate those exchanges. Early days of Outspoken and I def remember enjoying the work and crossing paths. Still very new to client management then, so I always look at those projects as good strategy with an inexperienced/unwilling leader."
            ]
        },
        {
            "message_text": "Jameson Treseler   9:24 AM Shameless plug, but we handle highly regulated markets like a champ. But for large brands, Seer Interactive hands down. @Niki Mosier is an amazing SEO and I know shes done stuff individually on the side. Youd be lucky to nab her time.  @Noah s agency is another great data focused SEO group. If theres a bunch of disparate data sources, Noahs team will connect them and get some cool insights. Ecommerce I dont know as well but happy to help network 2 3 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Emily Brady   10:02 AM Agency friends: what are you using for aggregate client reporting dashboards? (Dashboard that show ranking and traffic trends etc across all of your clients). +4 12 replies Last reply 2 months ago",
            "replies": [
                "Rick   2 months ago We have a proprietary tool called Supernova. This tool aggregates paid and organic insights, and allows us to look at data client-by-client, and across our entire book of business. https://info.seerinteractive.com/integrated-seo-ppc-strategies 1",
                "Dana DiTomaso   2 months ago If you need to show multiple clients at the same time, BigQuery. If not, data source selectors in Looker Studio. 2",
                "Andrew Shotland   2 months ago What @Dana DiTomaso said 1",
                "Alex Wilson   2 months ago Unless they are in the same niche, not sure how relevant it would be.",
                "Emily Brady   2 months ago Lol why would I ask if it wasnt relevant 2",
                "Noah   2 months ago @Emily Brady how many clients (ballpark)? And do you want to share a live data dashboard or pdf?  If live, how important is speed of dashboards? Do you want them to be interactive? If a dashboard with speed important and interactive important then get data i to bigQuery. Else, use native Looker Studio dashboards. More clients, with larger retainers = build an agency data warehouse solution. 1",
                "Emily Brady   2 months ago Hypothetically, around 200 websites / clients and speed isnt too important. A dashboard would be ideal but a pdf could do in a pinch. Im thinking a data warehouse solution is gonna be the right bet but could make do with something less sophisticated in the short term.",
                "Rhea Drysdale   2 months ago @Emily Brady we've also had to start using Looker (vs Looker Studio) and we're thoroughly enjoying the experience. Looker Studio is still the default for most reporting, but for one of our big clients with a lot of governance considerations and different teams accessing the data in different ways, we're really enjoy pulling reports together with Looker from a UI perspective.",
                "Noah   2 months ago @Rhea Drysdale are you or the client responsible for the Looker relationship / bill?  I ask because I am curious about cost exposure",
                "Rhea Drysdale   2 months ago @Noah not me Easier to recommend, but less info for you unfortunately.",
                "Kobi Gamliel   2 months ago Im using looker with supermetrics integrations, it can build a nice marketing overview dashboard that include - web traffic, audience insights and ppc 1",
                "Jordana Abitbol   2 months ago I use looker as well with the semrush API integration - been using this for a while now and no issues so far :)"
            ]
        },
        {
            "message_text": "Kobi Gamliel   11:40 PM Hi, best way to engage with a new community is to share content and get feedback: Im exploring in the last few months how the future agency will look like, how multi professionals work together and their creation process. I wrote a short piece and Ill be happy to get your insights and vision https://www.linkedin.com/feed/update/urn:li:activity:7100363952852713472/ linkedin.com Kobi Gamliel on LinkedIn: ***The future of agency canvas***  In the ever-evolving landscape of the ***The future of agency canvas*** In the ever-evolving landscape of the modern business world, the agency model is undergoing a transformative shift (35 kB) https://www.linkedin.com/feed/update/urn:li:activity:7100363952852713472/ 1 reply 2 months ago",
            "replies": [
                "Kyle   2 months ago Thanks for sharing @Kobi Gamliel ! Best place for these types of posts would be the #shameless-plug channel. 2"
            ]
        },
        {
            "message_text": "Andrew Prince   12:50 PM Is there a good replacement for Google Custom Search where a custom search engine could be built with specific domains? I know when I worked in agencies it was super convenient to search across client sites at once 4 replies Last reply 2 months ago",
            "replies": [
                "Daniel Zuccon   2 months ago Elasticsearch or Algolia 1",
                "Daniel Zuccon   2 months ago Google replaced CSE with PSE I believe but I haven't used it before: https://programmablesearchengine.google.com/about/ programmablesearchengine.google.com Programmable Search Engine by Google Help people find what they need on your website. Add a customizable search box to your web pages and show fast, relevant results powered by Google. (46 kB) https://programmablesearchengine.google.com/about/ 1 2",
                "Andrew Shotland   2 months ago PSE is one of the best SEO tricks out there.",
                "Ash Nallawalla   2 months ago My soon-to-be-former employer uses PSE and it does the job if the search term is close to the words on the page. We will move to an OpenAI based search soon. The prototype is great and allows complex questions as well. I expect such engines to be available commercially."
            ]
        },
        {
            "message_text": "Jono Alderson   1:03 PM Algolia; low-level usage is super-cheap, and it's easy to build custom indexes. 3",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Abel Johnson   7:36 AM Hi friends! Do any of you price your services based on value delivered, rather than by the hour? If so, what challenges or friction points have you encountered with clients or even internally within your team? +1 9 replies Last reply 1 month ago",
            "replies": [
                "JL Faverio   2 months ago I do a combo of both I guess, as it depends (like everything else in the space ) but I def recommend selling the value/solution to client problems. it's easier to sell, less stress/pressure thinking you have to have 2 more hours worth of work for the month, etc. I had tons of push back on changing our sales models from hourly to value-based when I worked for a local marketing agency. very old-school and traditional marketing there unfortunately.",
                "Abel Johnson   2 months ago Thinking about how clients respond to that, especially clients that are used to \"hours\" and then trying to sell that for $XXXX you get this, this and that rather than a bank of hours, how do they typically respond.. The biggest issue i am finding is that sooner or later the value reverts back to hours do you end up tracking the hours internally? do you have a sheet of estimated hours for each line item that moves and breathes with the client or project? if not trackign hours how are you making sure youre not overdelivering and killing your utilization/resources",
                "Jameson Treseler   2 months ago Piggy backing off the conversation - we had to make this shift at my pervious agency and at my current one. Ultimately value based communication is best in sales, customer support, and operations. Sales - it's easier to sell something based on value not hours. \"I'll work 20 hours a month for you\" is not as appealing as \"Our goal is to double your revenue in 6 months, here's our plan to get there.\" Operations - When you get more efficient at something, you're not losing money, which is the biggest thing. So operationally you get more time back, and you have better margins over time. Customer Service - again, \"we improved revenue by x% over 3 months by implementing 1, 2, and 3\" is waaaaaaaaay more productive than \"we did 1, 2, and 3. look at all the work we did.\" At the end of the day the customer won't care if it's not producing value for them So how do we get rid of the hourly tracking? You can and you can't. If you pay your employees hourly, there's always going to be an element of how much you work vs. get paid. The goal is to be able to guesstimate how much effort a client takes you, and knowing there will be higher margin clients than others. (For example, we estimate usually 10-15 hours/mo per client for SEO work. Sometimes its more, sometimes it's less). 3",
                "Jameson Treseler   2 months ago Then it's just a matter of figuring out which value based model you prefer: Revenue focused? Pro - real $, con - can't control a terrible sales team Lead focused? Pro - real value, con - client can complain about quality and not pay you. Traffic focused? Pro - easiest to do, con - client doesn't really wanna go for it. Then you have to make sure to get direct access tot their data so they don't BS you. Can you get equity? That's the biggest game changer, and one I'm still figuring out. Instead of dealing with all that complexity, we usually give our client an out. If we're not hitting our goal, you can cancel the retainer. If you don't like what we're doing, you can cancel. If you like it, let's keep it up.",
                "Charbel Raffoul   2 months ago @Joshua Poole @Lawrence Hitches",
                "Charbel Raffoul   2 months ago @Hendrick Lai 1",
                "Joshua Poole   2 months ago Jumping in here - what do clients say, after transitioning to value, regarding hours. E.g. if Im speaking to a lead - and I pitch them x , and they ask, how many hours is that per month, what is the recommended answer to this?",
                "Adam Humphreys   1 month ago I focus on leads and tracking where it came from. This is the number one way to gain buy-in and earn trust. Every SEO should put emphasis on this. Most dont track leads properly from what Ive seen, and focus too much on rankings. (edited)  1",
                "Jameson Treseler   1 month ago @Joshua Poole I usually say on my end, as many as needed to get the job done. I havent had any pushback on that. One thing I will note - when you remove hours from pricing, it becomes easy to become underpaid for the extra crap a client will want you to do. So put in pricing tiers. That way if its a one off ask, you can go ahead and go the extra mile. But if it happened multiple times, they need to upgrade to keep that level of support. Eg: weekly meetings vs monthly, 3 day turn around time be 7 days, etc."
            ]
        },
        {
            "message_text": "Jordan Choo   8:17 AM Had a nice reminder today that when asking for meetings or quick chats with team members to always provide context to help reduce any anxiety 5 1 1 reply 2 months ago",
            "replies": [
                "Jameson Treseler   2 months ago Yeah. It's definitely helpful. They don't think they're in trouble, and you stay focused. 1"
            ]
        },
        {
            "message_text": "Monty   9:28 PM If a prospect(agency owner) asked for a 3-month SEO strategy as a part of the interview process. Then how do you go about it? In terms of rates etc. For more context here's what they proposed: Ive been stung a few times with SEO Experts, so Id propose we start with a project first, see how we match?  I have two websites Id like you to run an audit on, give me your thoughts about what we need to expand it, potential hours that needs to go into it etc.  I am more than happy to pay you to start that, how does that sound Monty? Let me know how much you think it would be to run an audit on 2 websites. I dont just want a technical audit, theres simple. I want a 3 month strategy taking into account strengthening keywords, competitor analytics, content plan.  Let me know your thoughts. 9 replies Last reply 1 month ago",
            "replies": [
                "Jameson Treseler   2 months ago This is actually a solid way to go about it. And I think a 3 month strategy makes sense, it means you're thinking proactively about their business. I normally put together a 3 month sample plan in every pitch I do for clients, so if you want some help with that let me know. Generally, I front load highest impact tasks, tasks that will take longer to finish, and fastest results first. Then fill in the rest. In terms of pricing, I generally look at the websites in question, how complex they are, and guess how many hours it normally takes and multiple that by $150 to get my audit price. If you wanna chat more in depth about it, feel free to DM me. 3",
                "Jonas Sickler   2 months ago I would probably show them an SEO strategy you created for previous client with redactions to prevent them from identifying the client. That would illustrate your ability to analyze a website and develop an actionable strategy  without giving them free work if they were to cut and run 1",
                "Mika Lepist   2 months ago @Jonas Sickler I have a very hard time redacting things and making them still comprehensible, because mine contain a lot of very specific information so without blacking out a ton of stuff that makes it look like a \"declassified\" government document, or just made up stuff. If I were to look at mine from a hiring position, I'd be very skeptical about them. Any tips? 1",
                "Jonas Sickler   2 months ago Thats a good point. Maybe if you could get the prospect to sign a simple NDA you could show the strategy or case study as is? 1",
                "Jameson Treseler   2 months ago @Jonas Sickler @Mika Lepist you'll probably want to get consent from the customer who's data is in the case study before divulging too just in case. 1",
                "Monty   2 months ago Hello, thank you all for your input. I ended up agreeing to their proposal. But they will pay me for it(hourly rate). They alloted 20 hours( upto 10 hours for each site). @Jameson Treseler   can you please share any templates you use for 3 months sample plan? (edited)  3",
                "Jonas Sickler   2 months ago Good. As long as you are fairly compensated thats what matters 1",
                "Mika Lepist   2 months ago @Jameson Treseler im typically NDAd both directions, which is another challenge in sharing details that don't look nebulous. The paid approach achieved here is my choice if possible and seems fair if expectations are set appropriately. 1",
                "Jameson Treseler   1 month ago @Monty sure dude! Happy to! 1"
            ]
        },
        {
            "message_text": "Laura Yacoubian   6:58 AM Hello all! Im curious, if you regularly share updates on your KPIs to your clients when reporting (whatever cadence that might be), what are your go-to ways to visualize how those KPIs are tracking? Im most interested in visualizing keyword-specific/qualitative KPIs, like long-tail keyword growth, keyword positioning, overall keyword growth, etc. In the past Ive used a combination of Semrush visuals and Search Console screenshots but Im looking for more specific inspiration if you have some 2 replies Last reply 1 month ago",
            "replies": [
                "Jared McKiernan   1 month ago if you're tracking rankings (in any exhaustive/interesting enough way to be worthwhile), I like charts for # of keywords in each ranking position or group of positions, weighted average ranking by volume, and number of pages driving traffic (at any level of \"traffic\" you define) i'm NOT in favor of using the \"# of keywords\" metric provided in Semrush, for example, because that doesn't actually show you anything beyond what their index is tracking. lots of ways to be \"ranking\" in the top 20 or top 100 without it ever mattering for the site 1",
                "Jared McKiernan   1 month ago oh, and another one I really like is traffic for each keyword segment 1"
            ]
        },
        {
            "message_text": "Kobi Gamliel   7:27 AM sharing with you another content which really interest me, all of us want to grow their agency but the question is should we stay on our niche or expand - our services, offering, expertise etc. Will be happy to get your thoughts https://www.linkedin.com/feed/update/urn:li:activity:7104740472207650817/ linkedin.com Kobi Gamliel on LinkedIn: During the last couple of months I met dozens of agencies, web design During the last couple of months I met dozens of agencies, web design agencies, marketing agencies, full stack agencies and some super development house (69 kB) https://www.linkedin.com/feed/update/urn:li:activity:7104740472207650817/ 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jon Holt-Thomas   10:20 AM Has anyone used agency analytics for client reporting? Looking at switching from looker studio. Ideally somewhere that has more user authentication to access/view different reports, but nothing overly complex in the reports themselves. 11 replies Last reply 28 days ago",
            "replies": [
                "George Murphy   1 month ago Used it at one of the agencies I worked at in the past, thought it def had some upside in terms of automation and how the reports are presented. They had a lot of integrations, really good for tracking calls for businesses w multiple locations via GBP/callrail reports. Hope that helps (edited)  1",
                "Jon Holt-Thomas   1 month ago Thanks @George Murphy . It does look pretty decent. Do you have any particular other recommendations for similar reporting?",
                "George Murphy   1 month ago @Jon Holt-Thomas check this thread out (gbp reporting) some alternatives were mentioned, mainly Looker https://theseocommunity.slack.com/archives/C05JB2KD9DE/p1693328606434519  (edited)  1",
                "Gary Magnone   1 month ago Ive used Agency Analytics for the past 4 years. Really strong product, very active development and responsive customer feedback and support teams, tons of integrations, great white labeling and client management features. Highly recommend. Only issue I have with them as a solution is just in the fact that as an API partner, they are subject to the same GA4 quota limitations that everyone else is (including Looker Studio). They did mention that they were going to building a data warehousing product (a la Big Query) but that it was a ways out and as you can imagine should impact cost quite a bit. I am currently looking at a potential move to Databox. (edited) ",
                "Jon Holt-Thomas   1 month ago Thanks!",
                "Jon Holt-Thomas   1 month ago Ah @Gary Magnone that was one of my concerns, good to know form a user because a quick search didn't turn up much. Thought they'd maybe rolled it into cost already.",
                "Jon Holt-Thomas   1 month ago @Gary Magnone anything in particular make you choose databox?",
                "Gary Magnone   1 month ago Havent chosen them yet, but I really like their looped dashboards + reporting functionality plus the Benchmark Groups feature that theyre currently rolling out is really compelling from a lead gen perspective. The UI seems to lean more advanced than Agency Analytics, which aligns a little better with our ICP moving upmarket. (edited) ",
                "Jon Holt-Thomas   1 month ago Great to know, thanks a lot. I'll take a closer look!",
                "Katie McDonald   1 month ago Yeah Ive used it pretty decent lots of functionality if you dig deep",
                "Kristen McCabe   28 days ago Late to the game here but my company also uses agency analytics! I like that in one dashboard I can see metrics from different platforms. The frustration is when there are metrics I want to pull in and can't. For example, from ahrefs, we can pull in DR, referring domains, and backlinks, but we can't pull in the number of organic keywords ranking for. Overall it seems to work well for centralizing reporting. For local SEO it's also nice having the automated reports every month."
            ]
        },
        {
            "message_text": "George Murphy   9:46 AM Happy Friday IMG_7298  18 6 1 1 2 replies Last reply 1 month ago",
            "replies": [
                "Jameson Treseler   1 month ago My bladder really appreciates the four minutes. ",
                "Peter Rota   1 month ago Even better when they don't show up to the meeting"
            ]
        },
        {
            "message_text": "Kavi Kardos   6:03 PM Has anyone heard of (or used) Breef? Extremely unfortunate name for a company, if you ask me, but they look to match agency-seekers with agencies. Just wondering if it's any good. 3 replies Last reply 1 month ago",
            "replies": [
                "Kyle   1 month ago Its like a marriage between the business idea of getcredo.com and the design aesthetic of poolsuite.net   (edited)  poolsuite.net Poolsuite The ultra-summer internet radio station, playing an infinity pool of summer sounds 24/7. Swimwear optional. Formerly Poolside FM. (440 kB) http://poolsuite.net/ 1 1",
                "Kyle   1 month ago Thats all to say: Im here for it",
                "Boyd Norwood   1 month ago Hmmm. I have never heard of them before but it does seem like an interesting concept. They appear to have some capital behind them for what thats worth. https://techcrunch.com/2023/02/06/breef-raises-16m-to-match-brands-with-marketing-agencies/ TechCrunch Breef raises $16M to match brands with marketing agencies | TechCrunch Breef, a startup developing a marketplace for matching brands with marketing agencies, has raised $16 million in a venture round. Written by Kyle Wiggers Est. reading time 4 minutes Feb 6th https://techcrunch.com/2023/02/06/breef-raises-16m-to-match-brands-with-marketing-agencies/ 1"
            ]
        },
        {
            "message_text": "Nam Le   10:55 AM Looking to bring on an agency or consultant who has knowledge or experience with international SEO trends/market, especially with SaaS websites. We are based in the US but looking to expand our UK, Canada, Ireland, Australia so track records of success with one or more of these countries would be a huge plus. Main scope of work would include some international SEO technical recommendations, but more importantly, content roadmap that drive quality traffic that convert. If this sounds like something you or someone you know would be interested in, please let me know! 2 2 replies Last reply 28 days ago",
            "replies": [
                "Jason Wilson   1 month ago @Nam Le I'm going to DM you to chat more about this.",
                "Adam Humphreys   28 days ago ^ knowledgeable 1"
            ]
        },
        {
            "message_text": "Marie   10:50 PM Anyone willing to share per DM for instance the template they use for their content roadmap and for defining the scope of an SEO project? Pleaseeeee 1 reply 20 days ago",
            "replies": [
                "RP   20 days ago I cannot help sadly but I would also be interested in learning how a roadmap is put together and presented. Let me know if you find anything please!"
            ]
        },
        {
            "message_text": "Simon   3:12 AM Hello all, I'm looking for someone to partner with to start an agency that offers SEO services for jewelry stores. I have worked with jewelry stores for a few years now and I  noticed that they are underserved when it comes to specialized agencies catering to the SEO needs of jewelers. I can do the heavy lifting, that is audits, seo strategies and implementing but I need someone who can handle the sales pitches. Please see the attached case study for a previous jeweler i worked with. If interested, please DM me and we take it from there. Thanks PDF  SEO Case Study.pdf PDF 7 replies Last reply 18 days ago",
            "replies": [
                "Peter Rota   20 days ago Have you done any sales pitches yourself?",
                "RP   20 days ago Great results Simon! 1",
                "Simon   19 days ago @Peter Rota yes, I have but i'm not very good at it. That's why i'm looking for someone to partner with.",
                "Paul Baterina   19 days ago @Simon I am close to closing a deal with a new Australian jewelry brand (e-commerce). If you want, we can partner up on this. They want me to work with them because of the industry I'm in (revolve.com). I'm super busy with other projects + jewelry is a new niche for me. So we can discuss further if you want! I just need to close this deal, and figure out pricing options for them. 3",
                "Peter Rota   19 days ago @Simon Got it yeah same. You just need to practice really. I feel half is just in the presentation alone. 1",
                "Fred Newtz   19 days ago @Simon Feel free to ping me.  Would love to discuss this further with you. Have several ways I could help you out.",
                "Simon   18 days ago @Paul Baterina sounds good. I'll DM you and we can take it from there."
            ]
        },
        {
            "message_text": "Jon Holt-Thomas   1:13 PM Hey all. I run an agency but feel like we don't do a great job of communicating our value to clients - mostly because we're so focused on executing/the day job rather than results we get. Anyone have any tips/advice on how to better demonstrate our value on a regular or ad-hoc basis? 8 replies Last reply 11 days ago",
            "replies": [
                "Jameson Treseler   16 days ago We've artificially split our conversations with our clients in 2. 1) project progress updates, and 2) performance, what we learned, what we want to adjust. 3",
                "Jonas Sickler   16 days ago Hey Jon. There was a great discussion in this thread about it. Heres a link to a longer comment. I was speaking more broadly about applying SEO skills to marketing, but I think the soul of the comment applies here too. As SEOs, we often undersell our value. The work we do can be extended across the entire marketing dept to drive more value https://theseocommunity.slack.com/archives/C05HM8HCM34/p1695173825300719?thread_ts=1695172186.187049&cid=C05HM8HCM34 (edited)  Jonas Sickler I think you should expand your SEO skills into marketing. Not because SEO is going anywhere, but because it helps you use your SEO knowledge to drive value across multiple marketing function areas. How can you leverage the content assets you created for SEO through paid search? - Google Dynamic Search Ads How can you help the social media team connect with a broader audience? - atomize blog content for organic social and run paid retargeting ads Show more (edited)  From a thread in general | Sep 19th | View reply 2",
                "Dana DiTomaso   16 days ago Connecting what you do to your client's business goals is really critical. This is a 9 year old talk at this point but something we still do all the time: https://www.youtube.com/watch?v=IN6K371Mc8E YouTube | Moz MozCon 2014 - 26 - Dana DiTomaso - Prove Your Value 2",
                "Jon Holt-Thomas   15 days ago @Jameson Treseler this makes sense as a great framework - do you think it's helped clients understand your value?",
                "Jon Holt-Thomas   15 days ago @Jonas Sickler this is great, thanks for pointing me to it. I agree, that SEO skills expand into other areas. Personally I'm pretty much a jack of all trades, but definitely focus more on SEO these days. Thanks for the insights! 2",
                "Jon Holt-Thomas   15 days ago @Dana DiTomaso I must watch this! Thanks very much for the share! 1",
                "Jameson Treseler   15 days ago @Jon Holt-Thomas yeah. Its done three things:  Our points of contact can easily explain whats going on, making them look like heroes. Executives understand whats up, and can make the right decisions/give us more priority Devs arent combative. Cuz they know what were doing, why its important, and context, with a specific suggestion on a fox, they can work with that to find a better solution than what we propose, which often works way better",
                "Charbel Raffoul   11 days ago @Lawrence Hitches @Joshua Poole"
            ]
        },
        {
            "message_text": "Iquo Inyang   5:15 PM Ugg, I just a team member slack me asking about a project because she decided to contract with them for fulfillment. I've never had anyone violent my non compete. Initially I was speechless. Of coarse, now I'm pissed. This team member is a friend and has been a respected mentor. Back story, she referred the client to me before she was a team member for SEO fulfillment. This client is still in her membership group for marketing, but she's been our client for almost a year. The client is fussy and second guesses everything we do and gets a second opinion, so she would be actually probably doing me a favor by taking the client off my hands. But it's the principle. She has contracted with them without even having a conversation if I was okay with it. Any advice? 4 replies Last reply 9 days ago",
            "replies": [
                "Mika Lepist   10 days ago What is your desired outcome?",
                "Tory Gray   9 days ago I would mostly talk to the friend re: your perspective and be clear that thats not an okay action, generally speaking. Depending on your goal, per Mikas note, but assuming you want to salvage the friendship and are open to still working with them, being transparent, vulnerable, and open about the tough spot they put you in could go a long way. If they cant see if from your side, and if they dont care about fixing it (for this situation or just going forward) thatll be generally clear (eg do they listen and see your side? or are they defensive and will do what they wanna do regardless?) and you can make a call about how YOU wanna proceed from there. <I say as someone who this has happened too, and this is how I handled it, and that person did see our perspective and we go it cleaned up and moved forward in a healthy way> 1",
                "Iquo Inyang   9 days ago I would like to have no drama, and for her to understand my side. At the end of the day Id like to preserve the friendship. Ideally to have trust restored and be able to continue to support each others businesses. I feel pretty disrespected, Im hoping I feel heard and can move on.",
                "Mika Lepist   9 days ago Here's how I would approach it. Similar to what Tory said. And if you're fine with not getting the client back you could play that into it as well: Give it a little bit of time. Time = better control of your emotions. Start off with not trying to get her to understand. That often puts people on defense. I'd start with how the relationship you have is important and you appreciate having her as a friend. But not in a way that will be perceived \"why is this being said now.\" Then bring up that you wish she would have asked you about that client. Let her know that you were hurt by it (vs upset) because you thought you had open relationship. And ask her, if she a different perspective because she'd referred the client. Try to understand her position even if you don't agree. If you truly don't care if she keeps the client, I'd bring that up too, and just say I really wished you'd have spoken to me about it and share your feelings of hurt and that it's impacting your relationship with her, but ultimately you're having this conversation with her because your objective is nothing more than wanting to get past this and keep her as a friend and build better understanding of each other. I wouldn't bring up anything about wanting the client back, or her keeping the client because that is the point of contention. Focus on keeping her as a friend. If she truly is a friend, she'll want to understand why that hurt you and your side. If you bring up trust issues directly, then you introduce trust issues. You can bring them up in a  different way than saying \"I want to rebuild our trust\" or \"I feel I can't trust you\" or whatever. That trust means it gone and some people can take don't want to put in the effort to start all over with that if they think it is completely gone. And I think it's not. Like you still probably trust her to not run over you with her car. So there is some trust, just this one transgression. I think that being implied is enough. And if she doesn't care, doesn't want to hear why you're hurt, then you'll find that out too. Anything that sounds like blame or negative about her is going to put her on defensive and make it harder to get to your goal. You're already hurt. If she snubs you, you'll still be hurt. Perhaps more, but hurt none the less. Anger is often a manifestation of hurt, but from a perspective of protection (attacking) and will only clouds your judgement. That's my thought, off the cuff. And always easier to say than to do. I hope it works out for the best! (edited)  3"
            ]
        },
        {
            "message_text": "Nick LeRoy   11:52 AM I'm looking to expand upon my SEO referral partners for 2024 leads I can't fulfill myself. If you are open to warm leads, consider filling out my Google form. Thanks! https://forms.gle/8rPuLVVkN4xNgqKeA Google Docs Nick LeRoy SEO Referral Partners As an independent SEO consultant I'm often unable to take more than a handful of select clients at any point in time. With that said, I'm often asked for referrals to agencies and freelancers that I trust to deliver SEO results. Also, as the owner of SEOJobs.com I sometimes get asked about SEO partners as the company aren't yet ready to invest in a 100% dedicated internal resource yet. If you want to be considered for future SEO referrals, please fill out the form below. Thank you! Nick LeRoy https://forms.gle/8rPuLVVkN4xNgqKeA 14 1 1 3 replies Last reply 4 days ago",
            "replies": [
                "Jameson Treseler   7 days ago Aaaaaaaaaaand filled!",
                "Joshua Poole   5 days ago Hi @Nick LeRoy - happy to discuss this further.",
                "Jason William Fisher   4 days ago Filled out the form and connected with you on Linked. See you're connected to some of our peeps. Thanks Nick."
            ]
        }
    ]
}