{
    "messages": [
        {
            "message_text": "Noah   8:56 PM joined #bullhorn. Also, Chris Johnson and 5 others joined.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Pinned by Cheryl Noah   9:12 PM To thread or not to thread, that is the question. We definitely thread and heres why. Conversations can be difficult to follow when messages are just added into the channel.  When we thread all replies it makes it easy to segment conversations into discrete threads that allow a user to see at a high level if they want to engage or not in the thread. But the channels seem pretty clean so far right? They might, but as we grow it will quickly get out of control and we want to start good habits early. Okay, sigh, I guess I can thread How do I do it? ON DESKTOP - Hover over a message and youll see a popup appear over the message and youll click the little text bubble (like in the attached screenshot) and then reply in the new pane that will appear. ON MOBILE - tap a message and when the new screen appears, type into the Add a reply text input at the bottom of screen (like in the screenshot below). Thanks for being here and Happy Threading!!! 2 files  4 4 1 2 6 replies Last reply 3 months ago",
            "replies": [
                "Jordan Choo   3 months ago you read my mind (2 MB) https://media2.giphy.com/media/26BRCiSRp6d8j86rK/giphy.gif?cid=6104955e8g6jy0yw6bhj00575s99tb13apf6zjbu2tebi97j&ep=v1_gifs_translate&rid=giphy.gif&ct=g Posted using /giphy | GIF by Outlander",
                "Jordan Choo   3 months ago Me right now",
                "Noah   3 months ago you complete me. (501 kB) https://media0.giphy.com/media/kjfHMdG6Y3LP2/giphy.gif?cid=6104955ejvpo419pujb7fl3y5ya4a86zyd0f73kiajj8lcul&ep=v1_gifs_translate&rid=giphy.gif&ct=g Posted using /giphy 1",
                "Noah   3 months ago bahahahaha 1",
                "Jess Joyce   3 months ago YESS THREADS!",
                "Shawn   3 months ago thread (2 MB) https://media2.giphy.com/media/ySNW1RhG7mxSrzlEmG/giphy-downsized.gif?cid=6104955ehs0mexwieesgjxlmhley1bud4eqow8mhiae0vr88&ep=v1_gifs_translate&rid=giphy-downsized.gif&ct=g Posted using /giphy | GIF by ABC Network"
            ]
        },
        {
            "message_text": "Pinned by Cheryl Noah   9:13 PM A quick housekeeping post about self-promotion to make sure were all on the same page: The first rule of our guidelines is that pitching/self-promotion belongs in the #shameless-plug channel. My goal for this community is to build a community of peers. One where we support each other as we grow our skills, solve problems, and build friendships along the way. We have an opportunity to build something both amazing and unique together. Other venues are either mean, unwelcoming or are vehicles for selling. Anyone else dread their DMs in LinkedIn / Twitter?  This isnt one of those venues. We sell all day long in our work lives. This is a place where we can be a bunch of friends sitting around a campfire, helping each other, laughing and getting smarter along the way. Some FAQs How do I know if Im being self promotional? If you post about your product or service in any channel other than #shameless-plug youre being self-promotional. If you reply to a post where someone asks how to solve a problem and you respond with marketing speak, ie define the pain and then explain how your product or service is the painkiller, youre being self promotional. If you ask yourself, Am I crossing the line? you probably are. If youre still unsure, feel free to ask a mod of the channel youre posting in and theyll be stoked to help. If the channel doesnt have a mod then feel free to DM me for feedback.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Lots of new faces, so  I wanted to welcome yall (Woot-woot) and remind folks where to find the community rules so we can have a place we all like to call home! The Community Rules are here: https://theseocommunity.slack.com/canvas/C05HM8HCM34 Finding Channels is much easier in the desktop view of Slack (Boo). In the top left corner of page click More >   All Channels. Slack can be an amazing asynchronous way to stay connected.  Manage your notifications so it doesnt disturb you all day by clicking SEO in top left of screen > preferences > notifications. This community has a lot of members whove agreed to moderate different channels.  If youre interested in helping out, please DM me (dont comment here) so we can discuss. Once again, welcome all and lets rock. Canvas  general Canvas Community Rules To help everyone enjoy our community, we ask that when you post, you keep in mind the following: We have a zero tolerance policy, which extends off our platform, towards: Defamatory, indecent, offensive, profane, discriminatory, misleading, unlawful or threatening comments. Personal attacks, name-calling, trolling, subtweeting, and abuse.  Policy 1A extends off our platform If you experience that behavior please forward screenshots immediately to @Noah .  2 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Kyle   9:14 PM joined #bullhorn. Also, Jamar Ramos and 4 others joined.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   9:54 PM I just created #freelance as a LOT of us work that way.  I think this channel will get busy quickly. 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Karen Hopper   9:55 PM joined #bullhorn. Also, Eloise West and Carla Wagar-Janzen joined.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   10:58 PM @Nick LeRoy has graciously accepted my invitation to moderate the #freelance channel.  Woo-hoo! 4 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Matt McGee   10:59 PM joined #bullhorn. Also, Nick LeRoy and 2 others joined.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Cheryl   8:09 AM set the channel description: Weclome to the #bullhorn as in or as in announcements Channel.  This is where Noah and other Mods will: - Announce community news. - Channel creation, deletion and name changes.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Cheryl   8:09 AM set the channel description: Welcome to the #bullhorn as in or as in announcements Channel.  This is where Noah and other Mods will: - Announce community news. - Channel creation, deletion and name changes.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   8:22 PM Hey All!  I made a few more channels that just made sense: #operations - this is where we can talk about how to efficiently run our businesses - @Tess Voecks , will be moderate this channel for us and I couldnt be happier!!! #data - for talking about working with Marketing data.  Ill moderate it. #reading-list - This channel is where we can share books / articles we really find meaningful.  NOT for self promotion. #web-development - This channel is where we can discuss web development.  Wordpress, other CMS questions etc. (edited) 1 2 4 replies Last reply 3 months ago",
            "replies": [
                "Jess Joyce   3 months ago Is @Tess Voecks here - shed be perfect for #operations 2 1",
                "Iman   3 months ago I can help mod #web-development and #reading-list I wanted one for WordPress but this is perfect and I already share articles and things that help with seo. Have some on DNS etc that I want to share.",
                "Iman   3 months ago Of course non of it is my own just to be clear. 1",
                "Peter Ebbinghaus   3 months ago Just stumbled upon these, great! Might be important to establish a place where people can always find non-default channels. Feel free to delete if it already exists."
            ]
        },
        {
            "message_text": "Noah   12:54 AM #jobs-looking is for individual people to say that that are looking for work, not for agencies to advertise their services Okay, but where Can I post that?  You guessed it: #shameless-plug 3 1 3 replies Last reply 3 months ago",
            "replies": [
                "Jon Holt-Thomas   3 months ago Oops, sorry man",
                "Noah   3 months ago all good.  Were all learning together. 1",
                "Jon Holt-Thomas   3 months ago I appreciate it, I moved the post"
            ]
        },
        {
            "message_text": "Noah   2:06 AM Hey All!  As were closing in on 500 members I wanted to send out a quick reminder. Were on a journey to build a happy safe community for SEOs.  Weve created our Community Guidelines to make this place special. Being here is a privilege so please read the rules and obey them! This channel is where we share news about the community. If you want to see all the channels that are available, click on the All channels link in the top left of the screen on a desktop.  There are a lot of topics so jump in, ask questions, and share answers that will help others in their journey. Canvas  general Canvas Community Rules To help everyone enjoy our community, we ask that when you post, you keep in mind the following: We have a zero tolerance policy, which extends off our platform, towards: Defamatory, indecent, offensive, profane, discriminatory, misleading, unlawful or threatening comments. Personal attacks, name-calling, trolling, subtweeting, and abuse.  Policy 1A extends off our platform If you experience that behavior please forward screenshots immediately to @Noah .  2 2 3 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   3:25 AM yeahhh! We hit 500.  so fun. 13 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   10:15 AM We found and shut down a slack connect channel that was connected to a backlink exchange group.  We have also taken the following actions to secure the group: We shut down Slack connect. We shut down the ability to create private channels Only moderators can create public channels. If you joined the group to do backlink exchanges, youre in the wrong place. (edited)  12 6 1 reply 3 months ago",
            "replies": [
                "Shawn   3 months ago backlinks.jpeg  "
            ]
        },
        {
            "message_text": "Noah   11:39 PM Based on a 13-0 vote I feel really stoked to present the new #career channel.  Id like to be one of the moderators of the channel and would love help.  Whos in? 2 2 3 replies Last reply 3 months ago",
            "replies": [
                "abh   3 months ago What are you envisioning?",
                "Noah   3 months ago career advice?  setting career goals?  @Abby Leigh Curtis thoughts?",
                "Abby Leigh Curtis   3 months ago definitely setting goals! and maybe advice for folks looking to either pivot or expand"
            ]
        },
        {
            "message_text": "Noah   9:44 AM Hey All!  Most other communities and Twitter are negative and mean and have ended up pushing many in our community away from sharing their questions or contributing answers. We are trying to build something new, positive, and safe in the SEO space. Think of it as a big bunch of friends sitting around a campfire. Its not just any campfire either.  Your access to some of the smartest people in marketing that were lucky to have here is priceless. Snark, complaining and negativity bring the whole community down. Please ask yourself the following question before responding to a post, Will my response provide value to the person who posted the question and the community in general? If the answer is no, then consider deleting your response. If you are tearing people down, scoring points, subtweeting, shitting on SEO tool companies, and competition, rather than helping build others up, there are plenty of other venues for that. Thats not what were building here. Well be implementing a few changes to how membership works because membership is a privilege: Well implement a 3 strikes and youre out policy.  The first infraction youll get a gentle warning to please rephrase the post to not attack and be more inquisitive than negative. Second time is a final warning Third occurrence and youll be banned. Moderators are volunteering time to help make the community awesome and because of this, banning can be advanced if you react to moderators in an inflammatory, negative, or hurtful way when we reach out to you.. (edited)  30 7 4 9 5 5 3 5 1 1 reply 2 months ago",
            "replies": [
                "Donna Donahue   2 months ago Bravo @Noah we've got enough places where people can tear us down and feel stupid for not knowing something for clout points. Thank you"
            ]
        },
        {
            "message_text": "Noah   9:49 AM #pawsandclaws channel is live.  Post cute pet pics here. 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Kyle   8:48 PM @here we have two new channels live:  #resources (sharing resources, SOPs, processes, etc) #schema (schema/structured data - regardless of application, if the topic is about schema, this is where you should go) @Dave Ojeda was gracious enough to take the helm of moderating the schema channel (rightly so). Thanks, Dave! 5 1 1 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   5:45 PM Noah MozCon recap virtual chat Thursday 10am MST. Ill host via Zoom link: https://us02web.zoom.us/j/7207731776?pwd=WUNBejBCZjF6MVJPUUxOM1l6TUpBZz09 Posted in virtual-chat | Aug 10th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   8:45 PM In 15 minutes Ill host a virtual chat. What the heck is a virtual chat?  Its a chance for us to gather with each other on Zoom to chat in an organic way.  Moving forward Id LOVE to get these rolling out on a schedule thats convenient for the most members possible. (edited)  8 3 replies Last reply 2 months ago",
            "replies": [
                "Crystal Ortiz   2 months ago Would love to join one!",
                "Eri Hickey   2 months ago I'm interested!",
                "Michael Ferrari   2 months ago Definitely interested, especially if it becomes a regular thing!"
            ]
        },
        {
            "message_text": "Noah   5:44 PM Hey all, Ive just updated our Group guidelines to add more clarity: https://theseocommunity.slack.com/canvas/C05HM8HCM34 Canvas  general Canvas Community Rules To help everyone enjoy our community, we ask that when you post, you keep in mind the following: We have a zero tolerance policy, which extends off our platform, towards: Defamatory, indecent, offensive, profane, discriminatory, misleading, unlawful or threatening comments. Personal attacks, name-calling, trolling, subtweeting, and abuse.  Policy 1A extends off our platform If you experience that behavior please forward screenshots immediately to @Noah .  6",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   5:52 PM I want to highlight the big change which was consolidating Rule 2A and extending that this policy extends off platform. We are fostering a safe supportive place and have no airspace here for folks who want to attack others personally.: We have a zero tolerance policy towards:  defamatory, indecent, offensive, profane, discriminatory, misleading, unlawful or threatening comments. Personal attacks, name-calling, trolling and abuse . if you experience that behavior please forward screenshots immediately to @Noah . ***This policy extends off our platform*** This change was made after I made the decision to ban a member due to that behavior.  We have no Zero tolerance for that behavior. Period. 6 6",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   8:18 PM Lots of new faces here. Im so stoked you joined in!  This is a special place and were working hard to keep it that way. Ill take a quick moment to remind folks where to find the community rules so we can have a place we all like to call home! The Community Rules are here: https://theseocommunity.slack.com/canvas/C05HM8HCM34 Finding Channels is much easier in the desktop view of Slack (Boo). In the top left corner of page click All Channels. Slack can be an amazing asynchronous way to stay connected.  Manage your notifications so it doesnt disturb you all day by clicking SEO in top left of screen > preferences > notifications. This community has a lot of members whove agreed to moderate different channels.  If youre interested in helping out, please DM me (dont comment here) so we can discuss. Once again, welcome all and lets rock. (edited)  Canvas  general Canvas Community Rules To help everyone enjoy our community, we ask that when you post, you keep in mind the following: We have a zero tolerance policy, which extends off our platform, towards: Defamatory, indecent, offensive, profane, discriminatory, misleading, unlawful or threatening comments. Personal attacks, name-calling, trolling, subtweeting, and abuse.  Policy 1A extends off our platform If you experience that behavior please forward screenshots immediately to @Noah .  2 4",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   1:45 AM If you want a job / role etc, please post in #jobs-looking if you are hiring, please post in #jobs",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   8:53 PM Happy Sunday!  Im reaching out with some news, housekeeping items and the two Rs (ramblings + a request for feedback). News ===== It was quite a week for us here in the community.  We grew ~ 200 members this week which reinforces for me how we all yearn for community. As we grow Im focused on the following two areas: Keeping the community a happy, safe space for all. We are actively moderating channels and collaborating behind the scenes in a way that makes me really proud. Keeping the signal to noise ratio as high as possible.  This was the first week I saw a LOT of cross posting (posting the same thing in multiple channels) and posting in the wrong channels. PLEASE PLEASE PLEASE dont do either for two key reasons: 1. It makes the experience worse for all and 2. It makes unnecessary work for our moderators who are all volunteering their time. I was lucky enough to attend and speak at MozCon this week and I left feeling like SEO is still going to be relevant and evolving in the years to come.   If you havent been, its my favorite conference and I couldnt recommend it more highly. I got to meet a lot of you in person and that was the real highlight of the conference. Housekeeping =========== I updated our community guidelines to both make them more clear and to add guidance around jobs/hiring. I changed some channel names to make them easier to understand: hiring -> #jobs and opentowork -> #jobs-looking The #search-console channel has two moderators: @Anurag Singhal (the founder of quattr.com) and @Noah (yours truly) I added greet-bot as an app to the community to help folks get started. Ramblings + Request for feedback ========================== Lastly I want to start engaging the community in a dialogue about the communitys future roadmap. I love what were building and have been blown away by the quality of the threads.  I saw one in #technical-seo that was had > 55 replies!!! We are on a free Slack plan which means that post history is only stored for 90 days.  That is a super bummer and I want to maintain the functionality of a paid slack group for our community as I think it will make it easier for us to manage in the long run. I also want to keep the community free for users. Heres where I need your help! How can we solve these two problems? Im leaning towards looking for sponsors to cover the $8.45/user/month cost (currently ~$7K / month). If you are part of an organization that would like to discuss this further, my DMs are open at @Noah . (edited)  Canvas  general Canvas Community Rules To help everyone enjoy our community, we ask that when you post, you keep in mind the following: We have a zero tolerance policy, which extends off our platform, towards: Defamatory, indecent, offensive, profane, discriminatory, misleading, unlawful or threatening comments. Personal attacks, name-calling, trolling, subtweeting, and abuse.  Policy 1A extends off our platform If you experience that behavior please forward screenshots immediately to @Noah .  2 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   9:32 PM Reminder that unsolicited DMs for self promotional purposes, including sending people resumes and asking for work, will lead to you being banned from the community. If you are looking for a job, post in the #jobs-looking channel. And yes this message was in response to someone doing just and then getting banned. (edited)  5 4",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   7:37 PM Hey all, I thought you might dig seeing how much weve grown in our first month hanging out together! image.png  13 2 1 1 2 2 2 replies Last reply 2 months ago",
            "replies": [
                "Eric Wu   2 months ago Ahh the good ole days of private channels  I remember those days  feels like it was just yesterday",
                "Noah   2 months ago hahahahaa.  We still have a moderators channel which is pretty active. 1"
            ]
        },
        {
            "message_text": "Noah   11:23 PM Channel name feedback request: We have #events and #seo-irl which kind of mean the same thing.  I had originally created #events for us to talk about / see who wanted to meet up etc for things like MozCon, but folks also asked for #seo-irl for meeting up in real life. How can we simplify / add more clarity? 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   11:25 PM ----------------------------------------------------------------------------------------------------------------------------- And as a follow up, would we want to have channels for cities where we live to get real life meetups going? I could see channels named after a pattern like #irl-denver or #city-denver or the like. Thoughts? (edited)  5 replies Last reply 2 months ago",
            "replies": [
                "Areej   2 months ago In WTS slack, we have #events and #meet-ups Events is for general posting about upcoming events and webinars Meet-ups is for any IRL meetups, so for example, someone might say \"I'm in Berlin next week, anyone want to meet up?\" and so on My advice is to not build out location-focused channels for now, because that list will be LONG. Wait and see what's active in the main meetup channel and take it from there Also eventhough lots of members are US based, it might make more sense to build country location focused channels, as opposed to city channels (but again, probably down the line) Hope this helps",
                "Cherie Dickey   2 months ago +1 to this idea... I'm pretty rural and probably wouldn't be able to make it to more casual meetups. I would love to stay up to date on larger events that might be worth the travel time and cost. (edited) ",
                "Noah   2 months ago Thanks @Areej amd @Cherie Dickey for that feedback.",
                "Donna Donahue   2 months ago in OG they had #local_city",
                "Donna Donahue   2 months ago though as a caviat those channels are dead 1"
            ]
        },
        {
            "message_text": "Noah   3:39 AM Our first Month recap is about to drop.  Get Pumped! 3",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Carrie Hill   9:09 AM The SEO Community NEWSLETTER - Volume 1 - August 2023 Welcome to the first month of The SEO Community Newsletter.  The following articles are shared & curated by the channel moderators and shared via newsletter to ensure that interesting facts and information reach all members, not just those subscribed to specific channels. Thanks so much for making this community the amazing place it is!  As a reminder, we encourage you to review the community rules, always thread comments & responses, and always ask yourself - does this comment or post help or hurt? We want to help our community grow and thrive!  Thanks for being a part of that! We continue to grow - as of this newsletter - were at 800+ members and everyone has had a hand in that growth - thank you so much for sharing & getting the word out! #local-seo Moderated by Colan Nielsen How Often Do You Run Into The Local Filter These Days? Colan invites all to chime in with your thoughts on this one! Using The Google Maps Product Forum For Maps Help Reminding us all why the Google Maps forum is so helpful when a location, address, pin is misrepresented on Google Maps #in-house Moderated by Kyle Faber How Many In-House Folks are a Team of One? Or a Team of Many-ish? Lots of great discussion here. #seo-for-beginners Moderated by Kyle Faber Conversation on Content Pruning A good thread of pros, cons, how-to, and how-NOT-to #technical-seo Moderated by Kyle Faber The recent HowTo and FAQ schema announcements from Google SAAS/Website Builder Puzzle & Discussion Advice & discussion on some no follow directives on internal links Huge drop in indexed pages after mobile-first indexing implemented Conversation on what GSC picks up and reports on - even if a Tech SEO & Dev cannot find it... #analytics Moderated by Nico Brooks New Bug Found in GA4 - Audience Duration Reset to 30 Days If you have GA4 Connected to your old UA profile - Disconnect it NOW! Discussion about form tracking and abandonment unfolded over several threads. A highlight was a really great article that Karen Hopper shared that challenges the assumption that shorter is better. #content Moderated by Carrie Hill Conversation about managing authors & content posting moderation in WordPress #operations Moderated by Tess Voecks Great Conversation & Sharing Regarding how different companies run remote all-hands meetings & frequency #bullhorn Moderated by Noah Noahs call for feedback on the future of the community PLEASE weigh in and be sure to join this channel to be involved in its growth & direction - were better when we hear many voices & viewpoints! We have A LOT of channels, so make sure youre subscribed to the ones that interest you!  Browse a list of all 41 public channels and join your favorites! (edited)  18 7 5 replies Last reply 2 months ago",
            "replies": [
                "Noah   2 months ago Great work @Carrie Hill ! 2",
                "Natasha Post   2 months ago This is amazing @Carrie Hill Thank you! 3",
                "Nico Brooks   2 months ago Thanks so much for doing this! 1",
                "Matt McGee   2 months ago This is awesome, thanks Carrie! 1",
                "Mark Barrus   2 months ago Thank you @Carrie Hill this will help so much. I don't want to miss a thing 1"
            ]
        },
        {
            "message_text": "Noah   10:39 PM rocket launch (513 kB) https://media2.giphy.com/media/DnMMGxEvniha7CvASq/giphy.gif?cid=6104955ech5qewmduyycb5nbv5xxwyi0wmeietxd3vje2x47&ep=v1_gifs_translate&rid=giphy.gif&ct=g Posted using /giphy | GIF by Partiful",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "900 Members are here! 8 22 9",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   11:00 PM hey Yall and Happy Monday. We have a few new Channels to join (and we can use help moderating them too): #collaboration - for working together on research / projects.  NOT for guest-post opportunities #enterprise-seo #saas-seo 4",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   8:20 PM End of Pro Slack Update. As youve probably noticed, weve been placed back on the free Slack plan.  This means that weve got a 90 day message history.  While its a bummer to lose history, if we move to a paid plan at some point, well get the old history back. Ill update yall if I have any news on this front. 7 5 +1 15 replies Last reply 2 months ago",
            "replies": [
                "Jeffrey Kustron   2 months ago Thank you!",
                "Jon Henshaw   2 months ago I mean, it's probably good that our messages disappear after 90 day for some of us 1",
                "Donna Donahue   2 months ago I would pay $10.00 a month, but others might not",
                "Donna Donahue   2 months ago but honestly? If something is going to be that important and you didn't cut and paste it into a note, or take action right away on advice, you can always apologize for asking again.  Personally I'm not going to go digging through 90 days of msgs to find something. That kind of time would be a luxury",
                "Vukasin Ilic   2 months ago @Donna Donahue True, but I find great value in treating Slack communities as sort of a library of knowledge. Whenever I am stuck with a specific problem, searching through Slack communities with just one key word tends to give me a ton of potential solutions/ideas etc. The older the community is, the more value it has due to an extensive number of questions and answers previously posted. Asking things again may not always give you that as the same members may not be there to answer it, and the answer is not readily available. 1",
                "Donna Donahue   2 months ago @Vukasin Ilic in that respect you're probably right. I've been a mod on the OG slack group for like 7 years, the chances of getting anyone to pay to belong to that community is slim to none. On the flip side of that coin though is that when someone has money invested into something they are going to want quality as well as contribute quality. So it could be a good gate keeper to discourage DM spam. Either way like I said, I find value in this group and I thing $10.00 a month is a reasonable ask for my continued education and collective mind hive but not everyone thinks like me either (edited) ",
                "Vukasin Ilic   2 months ago @Donna Donahue I think you are actually right on point regarding charging for access, and not only due to being able to keep the old messages. I think running a free community is hardly sustainable in the long-term and I can count on one hand the number of free communities I find worthy of time. Free communities can be accessed by everyone, therefore signal to noise ratio trends downwards, more moderation is needed, and it's harder to get ROI on the invested time in community when the community is crowded.",
                "Jon Henshaw   2 months ago The biggest issue with a Slack workspace is that it's designed for companies rather than individual paid memberships. That puts the onus on the workspace owner to cover the bill for all users on a paid plan, which means they also have to keep up with collecting money from each paying member. No thank you. That's why I assume @Noah initially tried to find a sponsor/company to cover the bill. To make it work here, there would need to be a membership service that could automatically manage accounts and payments and create and delete users in Slack based on the membership status. Otherwise, it would be untenable to manage. The better solution for paid membership would be to use something like Memberful and connect it with forum software like Discourse (something I've done before and worked well), but the trade-off is you lose the convenience of Slack, which is already open for most of us that work at a company that uses Slack.",
                "Noah   2 months ago details details",
                "Donna Donahue   2 months ago Or you could legit set up a 501c3 and get a huge discounted rate. An educational community would qualify for a 501c3, then a subscription model where the gate keeper takes a slight percentage of each subscription and pays the bill",
                "Jon Henshaw   2 months ago As someone who has run a 501(c)(3) before, I promise the legal and accounting upkeep won't be worth the discount. My position is not that it's not worth paying for; it's that it's not feasible or reasonable for the workspace owner to manually manage individual payments. And depending on a sponsor doesn't seem like a good long-term sustainable strategy either. That involves a lot of work and convincing in itself. And free or pay, the success of a community depends on who is here, what people contribute, and how well it's moderated (which is already a lot to do). It's really not much different from how most social networks function with groups, especially if they're kept invite only. That said, how did TTT work? I was never a member, but didn't they have a Slack workspace? Was their workspace free or did they pay for each user from their membership fee? I'm assuming that if it is the latter, they automated it, which brings me back to using some sort of membership service that can connect to Slack either directly or via a Zapier-like intermediary.",
                "Donna Donahue   2 months ago Well let me ask you this Jon, if it was pay or leave which would you choose? I don't mean that in a bitchy way, I'm just wonder where people would draw the line. I would pay. There are too many very great minds in this group to not pay",
                "Jon Henshaw   2 months ago Same, as far as my tone I would likely pay, but making it pay-only may change the dynamic of what has been created here thus far. There will be good people who won't want to pay and those who can't pay for one reason or another that would be great contributors. I'm just not sure it's worth fixing something that, as a whole, isn't really broken and making things much more complex for @Noah to manage solely to keep conversations searchable and accessible after 90 days. So, I continue to lean more towards keeping it as is because it seems to be working well. 1",
                "Donna Donahue   2 months ago Well we don't want to make things more difficult for Noah that's for sure 1",
                "Derek Perkins   2 months ago I don't have experience with this library specifically, but there's an option to publish to the web https://github.com/felixrieseberg/slack-archive (edited)  GitHub GitHub - felixrieseberg/slack-archive: Generate static HTML archives of Slack workspaces Generate static HTML archives of Slack workspaces. Contribute to felixrieseberg/slack-archive development by creating an account on GitHub. (134 kB) https://github.com/felixrieseberg/slack-archive"
            ]
        },
        {
            "message_text": "Noah   9:46 AM 36, 21, and 5. Those were the numbers of replies to 3 of 5 posts in last two days in the #local-seo channel!  Woot-woot! Im loving all the great conversations all over our community. It makes me feel so blessed to be on the journey together!!!   (edited)  9 5",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   9:19 AM Hey all!!! Please say hi to @Stefanie Maio !!! Shes not only a great pal of mine, shes also the 1,000th member of our community. So great!!! (edited)  18 5 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   11:39 PM Happy Sunday Yall! Since we just got another 100 users, it seems like a fine time to welcome our new friends and to remind everyone about our community guidelines found here: https://theseocommunity.slack.com/canvas/C05HM8HCM34. Canvas  general Canvas Community Rules To help everyone enjoy our community, we ask that when you post, you keep in mind the following: We have a zero tolerance policy, which extends off our platform, towards: Defamatory, indecent, offensive, profane, discriminatory, misleading, unlawful or threatening comments. Personal attacks, name-calling, trolling, subtweeting, and abuse.  Policy 1A extends off our platform If you experience that behavior please forward screenshots immediately to @Noah .  4 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   7:28 PM Hey All, I need your VOTE!  Were hard at work behind the scenes looking at the Roadmap for the community and were weighing what the future looks like.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "OpenSay APP  7:29 PM Anonymous poll Would you be open to moving over to Discord for this community? Poll results (6 kB) https://cfw-input.anonymitybot.com/image.png?input=eyJ0ZW1wbGF0ZSI6InBvbGxCYXIiLCJkYXRhIjp7InRvcGljIjoiV291bGQgeW91IGJlIG9wZW4gdG8gbW92aW5nIG92ZXIgdG8gRGlzY29yZCBmb3IgdGhpcyBjb21tdW5pdHk_IiwibGFiZWxzIjpbIlllcyIsIk5vIl0sImRhdGEiOlsxMSwzM119fQ&sig=sAwmAj9aMJCEcFh9xe-z-ojd_DoDu10d-WabJtamq60 Vote Anonymously  Karma: 8  |   6   2   4   4   1 Created with /anon 4 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago i voted no for two main, personal, reasons: the replies in discord are a sad replacement for threads, which makes it incredibly tough to follow conversations, digest previous conversations, etc. i was part of an RV discord and it was unusable with how much people talked in channels - if i missed a day, good luck going back to see what happened. it's a separate app/browser tab that i have to have open and engage with. i use slack and this fits into my current workflow; having more programs running and trying to track similar tasks (conversations) across apps is a huge friction point for me, and generally results in lower engagement because i just end up disengaging. if it weren't for those things, i'd likely be a \"yes\"",
                "Richard Gargan   2 months ago I voted no for the same reason, I find Discord's UI difficult to use compared to Slack. When conversations break into threads on Discord it's difficult to keep up with everything 4",
                "Alex Harford   2 months ago Good to see I'm not the only one who struggles with Discord. I find forum software like Proboards to be the most user friendly. I also ran and moderated a forum many years ago, and it was straightforward from what I remember.",
                "Donna Donahue   2 months ago I broke down and finally tried it out, it's not great"
            ]
        },
        {
            "message_text": "Noah   7:30 PM Please share your reasons (especially if you vote NO). +4 13 replies Last reply 2 months ago",
            "replies": [
                "Mark Howser   2 months ago I voted Yes, but I think the main argument for No would be engagement might fall if we switch to Discord. I have this community on my work account (as I'd imagine a lot of us do) and since a lot of us use Slack for work, it's easy to pop over here once or twice a day and check in. But having it on Discord, I feel like we may check in less often. 3",
                "Noah   2 months ago for me its a features vs cost VS engagement VS feature breakdown. (edited) ",
                "Mark Howser   2 months ago Yeah when you factor all of those things in, it seems like it's worth the switch. I don't think anyone here expects you to spend an arm and a leg to fund this thing.",
                "Mark Howser   2 months ago I actually think the Discord video / audit chatrooms could be an interesting feature. It could be a place where people could run tutorials / presentations. (edited) ",
                "Valentin Pletzer   2 months ago I agree with Mark (but I have not voted yet), while I surely wouldnt want to loose this community and therefor dont want to vote No, I dont really use Discord and Slack is open all the time anyways",
                "James   2 months ago 65% drop off of dau, though hope to be proven wrong",
                "JL Faverio   2 months ago what if we all (or those that wish to) pitch in $1/mo? I have no idea what the cost is for this btw just an idear.",
                "Noah   2 months ago costs will be $8.45 / user / month for Slack. Discord will have monthly Boosting costs where the server will have more features based on the Boosts people pay. (edited)  1",
                "Noah   2 months ago I dont know how to estimate the boosting costs, but would certainly be < 20% of slack costs.",
                "Kane Jamison   2 months ago Every Discord I've been on has been a visual mess and impossible to follow along with. I understand the desire to save all history in a community, but, sometimes disappearing conversation history is a feature, too. 1",
                "Eric Wu   2 months ago You need 30 server boosts to max your Discord server which can range from $100-$150/month total. It depends on whether the booster has paid for Nitro or not.",
                "Geoff   2 months ago Im on slack every day for work. Im realistically not going to use an additional app. Im willing to pay for an account here (not sure how TTT is setup), but not willing to join another platform.",
                "Charbel Raffoul   2 months ago im on slack every day for work. So easier to engage and ccheck (edited) "
            ]
        },
        {
            "message_text": "Noah   7:32 PM Discord is being considered as a much lower cost / feature rich alternative to a paid plan here on Slack. (edited) ",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   7:42 PM AAAND we could move all the history over to Discord as part of the process too.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jordan Silton   7:53 PM Communities are all about momentum, and this one has amazing positive momentum and growth. The tradeoffs between cost vs. momentum could be massive with a migration/switch. It's less about moving over history of discussion, it's about forming connection. 3 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Alex Harford   7:57 PM I'm not a fan of Discord. It's difficult to follow conversations or get any consistency, but maybe that's because people don't use threads in the groups I'm in. How about an old school forum like Proboards? The only possible downside to that I can think of is it's public? Though sub forums can be made private.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Mark Howser   7:58 PM Reddit is the best forum tool I can think of. You can have moderators, make the community private, etc. And you could apply tags instead of having channels.  But with that said, I personally would prefer Discord. I think it's easier to have a conversation and explore an idea that way. (edited) ",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Stephanie Briggs   8:18 PM I am pro-Discord, as I use it for other communities outside of SEO. Really appreciate threaded channels as a feature. With good mods, it's been great, even for huge groups. And it's much easier, cost-wise, to maintain. 1 reply 2 months ago",
            "replies": [
                "Kyle   2 months ago maybe that's been what was missing in the groups i was in - no threaded channels"
            ]
        },
        {
            "message_text": "Tory Gray   8:21 PM Pro-Discord (and Slack, etc.) and specifically anti-Reddit here. Too many people wont be able to join/participate based on Reddits vetting process. People wont jump through those hoops if its not already done! (edited) ",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   8:23 PM Keep Voting Yall (Im not seeing the Poll numbers change). 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Stephanie Briggs   8:24 PM @Noah poll looks kind of wonky to me and isn't clear what we're voting on. That may be why. IMG_2034  ",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   8:26 PM Someone downvoted the poll. 2 replies Last reply 2 months ago",
            "replies": [
                "Kane Jamison   2 months ago Turning off polls for Karma is such a weird product choice... I threw a +2 on there for you (edited) ",
                "Kane Jamison   2 months ago Like, people are likely thinking the 'down finger' on karma is probably answering 'no' to the survey."
            ]
        },
        {
            "message_text": "Noah   8:38 PM alright the poll is annoying Lets this in a simpler manner.  Please Vote whether youd be open to moving to discord if the community considered moving there with a or a   reply to this post. The context behind a potential move is: We want to build a community where we can scale efficiently have controlled costs (Slack is $8.45 / user on paid plans and this would mean $8500 / mo currently) have conversation history Group video events. threaded conversations If we stay here AND if we care as a community about Slacks Paid features (convo history, group huddles) then we have to come up with the money. It would be easier to support this effort financially on a different platform. I have also reached out to Slack (and am meeting with their team tomorrow) to see if we can have a free community here. (edited)  30 48 1 reply 2 months ago",
            "replies": [
                "Derek Perkins   2 months ago threaded conversations are already included in free Slack Slack video is pretty terrible IMO, and I'd prefer Google Meet / Zoom anyways history is the only real win, and we could look into something like https://github.com/felixrieseberg/slack-archive to keep it, though it's obviously not as nice as keeping it in the platform"
            ]
        },
        {
            "message_text": "Mika Lepist   6:33 AM Might I suggest adding to the question: How many would pay to be a part of this vs switching? It's all fine to vote when you have no skin in the game but voting with your wallet makes things very different for many than voting with emojis. 1 2 1 4 replies Last reply 2 months ago",
            "replies": [
                "Anurag Singhal   2 months ago I like this perspective. FWIW, I voted no and Id pay. Perhaps also ask for a refundable deposit to vote (not refunded if we go to paid plans) - easier to say Id pay than to actually pay",
                "JL Faverio   2 months ago I'd be happy to pay $9/mo for this awesome community",
                "Jon Henshaw   2 months ago A lot of similar questions and statements that were discussed in this thread https://theseocommunity.slack.com/archives/C05JVB1F207/p1692804019021589 Noah End of Pro Slack Update. As youve probably noticed, weve been placed back on the free Slack plan.  This means that weve got a 90 day message history.  While its a bummer to lose history, if we move to a paid plan at some point, well get the old history back. Ill update yall if I have any news on this front. Thread in bullhorn | Aug 23rd | View message 1",
                "Dana DiTomaso   2 months ago The measure slack has a Patreon which we support, to pay for Slack."
            ]
        },
        {
            "message_text": "Mika Lepist   8:39 PM Adding to the questions/discussion about a potential discord move:  if payment for slack is annual per person that basically drops it $18/yr to $7.25/mo (buy I realize there is organizer overhead so I do think it's fair to be compensated for that, often thankless , work) how much do people really care about history? I hate to say it because it irritates me no end in places like FB where the same question comes up over and over. But I'm hoping a more analytical minded group isn't going to bring up the same basic stuff. Or maybe just in a beginners area. If history is valuable, I generally only find it valuable if it's organized. That's a PITA to manage. This is why forums are dead/dying. Lots of good content but most is buried pages into a thread and many low value comments in between. Reddit has fixed that to some extent, but they still have far to go for if they cared about organizing into topics. - so the question behind the question is why would that history be valuable enough to pay for? Not that there isn't enough potential value from the group alone, but history or other features specifically if those are driving factors. 1 2 replies Last reply 2 months ago React Reply",
            "replies": [
                "Jared McKiernan   2 months ago Yeah, I'm not sure that history is valuable to me. Others may be in here for different reasons, but I'm mostly here for networking/chatting SEO. If the questions begin to be of a lower level, or it gets to be mostly people asking questions and not doing the research (traffic think tank is kinda like this, honestly), this loses value in a hurry for me, at least. And paying for slack is certainly not a big deal but the previously raised questions about managing this makes it a tougher issue. 1 2",
                "Jon Henshaw   2 months ago I'm here: because I'm already using Slack for work, so it's open, and it's convenient. Switching to Discord means I'm gone because I don't use it and don't want to. However, I would consider a forum like Discourse, but my presence there may not last because it's not top of mind. because it's casual and it gives me a break from my day because it connects me with people in our industry, and I can learn about new things people are up to or challenges they're facing I can easily DM those people I'm not here: for mining conversations that were had more than 90 days ago. If I need to remember, I'll bookmark it (in my bookmarking app) or put it in my notes for later reference. 7 3 1"
            ]
        },
        {
            "message_text": "Noah   9:39 PM Hey all, I met with Slack today.  No real news, but I will know more by the middle of next week.  I dont think a free community with Pro features is in the cards, but well see. 7 2 4 replies Last reply 2 months ago",
            "replies": [
                "Fred Newtz   2 months ago Losing all of the extra retention time on some really good content is hard thing to lose.  But maybe there could be other ways we could store the chat history and make it searchable as an archive?  I mean there are so many IRC bots that only serve to ingest chat history and make it available.  I wouldn't mind helping to build something similar for Slack honestly.",
                "Ian Cappelletti   2 months ago tell them they got 4xx and 5xx URLs in their english xml sitemap and that we'll hook them up",
                "Ian Cappelletti   2 months ago actually, it's kinda embarrassing... image.png  ",
                "James   2 months ago @Fred Newtz there can be commands to take threads and push into a gpt to store into a notes archive stored elsewhere among other similar mechanisms"
            ]
        },
        {
            "message_text": "Noah   12:58 AM New Poll to discuss roadmap: Would you pay $20 / month to stay in this community if it gave us the ability to: pro Slack features (history, group huddles, automations, lots of apps) build courses host webinars pay moderator team give guides free access to the community so they can continue to help out with advice / counsel. deliver a newsletter launch + host a public website with articles, past webinars, courses, and member pages (where they can link to their own site). hopefully support IRL events Please vote with a or a   reply to this post. (edited)  28 40 5 replies Last reply 1 month ago",
            "replies": [
                "Dana DiTomaso   2 months ago Tell me more about \"build courses\".",
                "Noah   2 months ago My vision is us using a platform like circle.  Wed fund the subscription.  Course creators would build the content And keep the revenue from each course.  My vision is that courses are available for members at low prices: $10-50 / course.",
                "Matt McGee   2 months ago I'd pay $10/month for access to history and to support the mod team. But the courses, webinars, guides, etc. isn't of much interest to me. There are already plenty of those available elsewhere. I also agree with what @Jon Henshaw said in the thread a few posts above. If we stick with free Slack and no history, I'll just make an effort to save what I think I need before it disappears. 15",
                "Dana DiTomaso   2 months ago Yeah agreed with everything Matt said here! 1",
                "Donna Donahue   1 month ago I'm with @Matt McGee on that as well. I can always C&P important things"
            ]
        },
        {
            "message_text": "Noah   7:51 PM Hey all, I added 2 new channels that I hope jump into: #speaking-and-speaking-opps for chatting about speaking and upcoming opportunities. #builders for talking about innovation and the applications / solutions were working on / struggling with. 3 2 2 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   3:08 AM Today Im excited to remind yall to use threads in conversations, and heres why: https://theseocommunity.slack.com/archives/C05JVB1F207/p1690560726658229 You might notice a placed under a reply that youve created.  That is how we moderators try and send you a reminder to use threads. Please please please use threads! Noah To thread or not to thread, that is the question. We definitely thread and heres why. Conversations can be difficult to follow when messages are just added into the channel.  When we thread all replies it makes it easy to segment conversations into discrete threads that allow a user to see at a high level if they want to engage or not in the thread. But the channels seem pretty clean so far right? They might, but as we grow it will quickly get out of control and we want to start good habits early. Show more 2 files  Thread in bullhorn | Jul 28th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   3:51 AM All. I hope youre doing great.  Im posting to let yall know that weve updated the community guidelines to add more clarity around what is acceptable for how we talk about other companies in the community. You can read them all here: https://theseocommunity.slack.com/canvas/C05HM8HCM34 If you read the guidelines, you might come away thinking that there are way too many rules, but I found in running communities over the past few years that they were critically important to the long term success of communities. They exist because we want to keep this community fun and safe for the long term. There is a lack of specifics around how warnings / bans are executed, and thats to give the moderation team the needed flexibility, but please know that the moderation team is here to help keep this place fun.  None of us are here to kick people out of the community. (edited)  2 files  image.png PNG general Canvas 8 2 9 2 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   3:48 AM Please vote on this question. Noah Vote time!  Should we combine the #jobs and #jobs-looking channels? Please vote with a or a  (edited)  Posted in general | Sep 20th | View message 26 7 2 replies Last reply 29 days ago",
            "replies": [
                "Andrew Prince   29 days ago @Noah flagging that people seem to be voting in both places with them having a different outcome as of now",
                "Noah   29 days ago I know.  Annoying."
            ]
        },
        {
            "message_text": "Noah   9:51 PM Hey all, I compiled the vote totals for the above Jobs Question and combining the two was a clear preference of the group.  The new channel name is #jobs I archived the # jobs-looking channel and forwarded posts from Augusts 20 to now to the jobs channel. 5",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   12:36 AM We just hit 1100 members!  Woo-hoo! 36 24 7 3 3 3 3 2 3 replies Last reply 23 days ago",
            "replies": [
                "Tory Gray   23 days ago Congrats!!",
                "Zain Husain   23 days ago 1100 member dalmatians! (Thats the name of the movie right? ummm nvm)",
                "Noah   23 days ago nice."
            ]
        },
        {
            "message_text": "Noah   8:37 PM Hey all I just made a new channel called #for-the-greater-good.  Please join it if you want to post / get notified about opportunities to collaborate for good causes / raise money for charities and non-profits. It will be really interesting to see if we can do something special together. 9 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   7:13 PM I just added a new section to the guidelines for clarity for our friends who work for SEO tool companies: If a post is about tool A, employees from tool B shouldnt be jumping into a thread to say how tool B works / is better. If folks ask you a question about your tool, then have at it. (edited)  12 2 1 1 reply 3 days ago",
            "replies": [
                "Eric Wu   3 days ago ye-swift.webp  1"
            ]
        }
    ]
}