{
    "messages": [
        {
            "message_text": "Carrie Hill   1:26 AM set the channel description: Moderated by @Carrie - DM me if you need assistance!!",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Carrie Hill   1:29 AM set the channel description: Moderated by @Carrie Hill - DM me if you need assistance!!",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Cillian BC   3:45 PM Wordpress users, how do you manage publishing new articles? We currently use an app called storychief that auto publishes to Wordpress, it's a really good tool as we can allows us to keep writers out of Wordpress. However just like a google doc it comes with it's own funky html & css that can cause issues from time to time. Does anyone have a good solution to the age old copy paste into the editor issues? 1 +2 16 replies Last reply 2 months ago",
            "replies": [
                "Carrie Hill   3 months ago In the past I have used a plug-in that allows content writers to login and post - but all content goes into review for admins or editors to actually put live.  It doesnt keep people out of WordPress but it does lock it way down so they cant really hurt it.  Then you can make the content writer responsible/assist with posting content in without formatting or clearing formatting before they submit it for review .  Ill see if I can find that plug-in name. ",
                "Carrie Hill   3 months ago I just found this plugin -which might be useful - they can submit their article, but you don't have to give them access...  You could create some guidelines about how the content is submitted via this form (ie plain text with coded links - or written natively in the form, maybe? 5. WPForms The WPForms plugin may work for publishers who are looking for a streamlined way to allow users to submit posts on their websites. With the Pro version of this plugin, publishers gain access to the post submissions add-on. Front-end post submission forms can then be added to allow users to submit blog posts without logging into the admin area. Once a user submits a post or articles using the form, WPForms automatically creates a blog post in the back-end of WordPress and marks it as pending. Publishers can then review the article or post for editing and clarification before it goes live. For publishers who are looking for a way to allow non-registered users to submit content without creating an account or accessing the full admin area, this plugin could be the ideal solution.",
                "Carrie Hill   3 months ago I think this is the plugin i used previously: https://wordpress.org/documentation/article/roles-and-capabilities/ WordPress.org Documentation Roles and Capabilities WordPress uses a concept of Roles, designed to give the site owner the ability to control what users can and cannot do within the site. A site owner can manage the user access to such tasks as writing and editing posts, creating Pages, creating categories, moderating comments, managing plugins, managing themes, and managing other users, [] Dec 1st, 2018",
                "Cillian BC   3 months ago Thanks @Carrie Hill I'll look into these 1",
                "Derek Perkins   3 months ago is there a specific reason you want to keep your writers out of WP?",
                "Adam Humphreys   3 months ago All my sites are bespoke and on Bricks  for Wordpress which allows for specific permissions for each user type. I can decide what to give them access to and this has worked out well. 1",
                "Matt Tutt   3 months ago Have you tried https://wordable.io/ before? I've not used it but heard good things about it - also Ahrefs use it, think that's how I'd found out about it. Wordable Wordable: Publish Google Docs to your blog in 1-click. Instantly export your content to any website. In seconds, in bulk, and with whatever formatting you want. Est. reading time 5 minutes https://wordable.io/ 2",
                "Cillian BC   3 months ago @Derek Perkins It's mainly because we use a lot of different outsource providers and our site is hosted by Strattic, which is a static site generator, so we have to give outsiders access to Wordpress but also our hosting, which is not ideal",
                "Cillian BC   3 months ago @Adam Humphreys What type of sites are you building with bricks? Have been looking for a more performant alternative to Elementor",
                "Crystal Ortiz   3 months ago I use storychief too so I know exactly what you mean with the setup on my consulting site everything is custom   Eventually Ill find a better system for it but if you figure anything out in the meantime please let me know. I love storychief though. Its awesome   1",
                "Adam Humphreys   3 months ago Bricks is the fastest thing on the market other than native Gutenberg. Watch the Kevin Geary series surrounding it and you will get what I mean. I started really pushing page speed in 2012 and its basically evolved down to less is more. I build mainly for clients on retainers and have come a long way since I first started with it which was really rough. It took relearning all the elements and CSS which is forever evolving. BEM, clamp etc and all relevant concepts are now part of my vocabulary. This allows you to build fast loading sites with proper content types where you can set easily altered brand controls that will change all pertinent elements from a dashboard in automatic css. I noticed the next release of Wordpress on the 8th will have page speed optimizations and a globalCSS option. 2 1",
                "Julia Scavicchio   2 months ago Download the Google Doc as a Word Doc and then copy/paste into WordPress. Hope this is helpful. We draft in Word and share docs with clients by uploading to Drive after the draft is finalized to work around this issue. 1",
                "Cillian BC   2 months ago Just to follow up, i tried wordable.com but received no response at all from their support over a 2 week period so could not proceed",
                "Cillian BC   2 months ago @Julia Scavicchio That worked perfectly! thanks 1",
                "Cillian BC   2 months ago Thanks @Adam Humphreys . I had a close look at bricks, looks great but it doesn't currently support WPML so we are stuck with Elementor for now",
                "Adam Humphreys   2 months ago People use WPML with it and they are also working on direct integration with it. Keep an eye out."
            ]
        },
        {
            "message_text": "Carrie Hill   12:18 AM Hey Wordsmiths! Whats your favorite way to creat content for clients?  A questionnaire? A telephone/video interview?  Winging it?  What has the highest approval/fewest edit requests in your experience? +1 9 replies Last reply 2 months ago",
            "replies": [
                "Eri Hickey   2 months ago Hi @Carrie Hill what industry are you writing for and what format? Might get better answers with some more specific information",
                "Carrie Hill   2 months ago I posted this as a conversation starter - I tend to do a combination of tactics for local smbs - but im curious if others have strategies that work well that i could incorporate or emulate",
                "Adam Humphreys   2 months ago Kickstart a call to understand needs and goals. Do a content gap analysis, and then a content triage based on where they are concurrent with opportunities. I submit to the client for approval and see if anything is missing. They approve budget for 3 months to a year of content. Scan for plagiarism with copyscape and ask if they have been using AI. Map out sitemap/taxonomy if lacking but ideally dont change urls/site structure unless starting from scratch. Redirect any revised links. (edited) ",
                "Carrie Hill   2 months ago And as you produce a piece of content - do you tend to send it to client for approval before posting, or post them show client and refine with their feedback? Always looking for more efficient ways to get content approved, posted, & going to work for us.",
                "Adam Humphreys   2 months ago The client generally approves it, but there are several iterations from my copywriter to any edits I might have. I review it and then Ill submit it to the client for their review. The client pays for content upfront. 1",
                "Adam Humphreys   2 months ago I use Clickup for content tracking and projects to map out everything. This ensures that we dont overwhelm ourselves and are accountable to deadlines.",
                "Brenna Miles   2 months ago For individual pieces of content: It depends! In most cases, a call with pointed questions for the client to answer works great. In other cases, especially for pieces that require the input of multiple SMEs, a shared questionnaire where everyone can add their thoughts is best. Its also useful to schedule a content deep dive where you discuss tone, voice, key messages, target audience, and other details at the start of any client engagement. This is especially useful if they dont have brand/writing guidelines.",
                "Matt Pyke   2 months ago Most of the time it is on calls. We always send to clients content review and try to do it in batches. And have learned over the years to strongly push leaving annotations on the original piece of content on Google Docs.",
                "Abby Leigh Curtis   2 months ago When I was working at an agency, we moved to sending over topic ideas for approval before digging into briefs/content development. That went well with most clients."
            ]
        },
        {
            "message_text": "Katie McDonald   10:49 PM Good examples of what to optimize your meta data to to encourage more clicks. All ideas welcome! Client has historically just had campervan hire in (location) - Brand name for all her localized pages  which is most the site. Currently looking for quick wins. Do I swap the brand name for something? Ive tried new deals every day didnt seem to massively work. Any suggestions? 9 replies Last reply 2 months ago",
            "replies": [
                "Patrick   2 months ago @Katie McDonald Three questions: Where is your client physically ranking in mobile/desktop SERPs for these keywords? Are these pages ranking near the top for each city, or are they buried under a map pack and a bunch of other pages and SERP features? Does your client only do campervans rentals, or do they also do RVs and/or motorhomes? If your client does RVs/motorhomes, do these keywords have their own localized pages? Or are all of these vehicles being showcased on the same landing page?",
                "Katie McDonald   2 months ago their destination (country) pages rank either page 1 - page 2, her website tends to be compiled of destination pages - you can hire a camper van through her and go to a specific country. If I understand your question. they do campers, RVs, and motorhomes but we tend to target the meta for the term it ranks best for / the term with the most SV. she has country pages (some continent and then cities) eg /Italy which we target campervan hire Italy for, and that page has images of the campers/vehicles they can get with an availability search form. @Patrick  (edited)  1 1",
                "Patrick   2 months ago Ah, okay - my bad - I assumed city pages instead of country pages. My instinct would be to use the extra title tag real estate on secondary keywords, but keep the best performing term front-loaded, e.g. \"Campervan Hire in [location] | Motorhome & RV Rentals\" -- my assumption would be that some users will be looking/thinking specifically for those terms, and seeing them in the title tag would encourage more clicks + potentially a rankings boost on those terms It sounds like you might have already played around with that option before, so if it's something that hasn't performed well in the past, hopefully someone else has a better idea (edited) ",
                "Katie McDonald   2 months ago No I havent actually! Wed have either or not both. We have 40+ country / continent / city pages but mostly countries - if we did campervan hire location | Motorhomes & RV rentals on all, does it not matter that the latter half of the meta isnt optimized for the location name?",
                "Patrick   2 months ago so long as the location is present within the title, you should be okay - this is a pretty common tactic that works well in local SEO for city pages - so long as the location is in the title with the first keyword mention, that's enough for Google to understand the context of the latter half",
                "Katie McDonald   2 months ago Interesting! The same principle for country pages? 1. Would you only change to include RV rental etc if you knew there was sv for that? 2. Would you not use the ranking competitors for inspo and try to piggyback?",
                "Patrick   2 months ago can't say 100% sure for country pages -- I don't see any reason it wouldn't hold true for country pages as well -- Google should be able to understand how [location] relates to the other keywords in the title tag -- but I have a lot more experience with city geotargets, so I don't want to say that's definitely true and find out I'm wrong competitor pages seem to either group all the keywords together (\"Campervan, RV & Motorhome Rentals in [Location]\") or repeat the location if they've split up the secondary keywords (\"Campervan Rentals [Location] | RV Rentals in [Location]\") I suspect those duplicate [Location]s aren't actually helping, but it looks like they aren't hurting, so maybe that's the right format to test?",
                "Nam Le   2 months ago \"Best campervan hire in etc.\" \"Reliable campervan hire in etc.\" \"Campervan rental deals in etc.\" \"Cheap campervan rental in etc.\""
            ]
        },
        {
            "message_text": "Melissa De Oa   9:31 PM Hey guys! QQ, healthcare client has a ton of content that was written a long time ago but has been medically reviewed by experts. We dont know who wrote it (cant add a written by) but we do know who reviewed it. Any thoughts / ideas on a way around the not knowing who wrote it to add in an author? +1 20 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago set the brand as author, keep the medical reviewer for the reviewedby designation. 5 2",
                "Katherine Watier Ong   2 months ago I would be curious to see if AI can help you figure this out if you don't mind sending me a copy of one of the posts I could see if it works?",
                "Edwin Romero   2 months ago I was performing a strategic audit for a cyber security client and in my research found that Forbes uses a \"Review By\" element that references an individual. I believe there is still value in referencing the reviewer for the sake of EEAT.",
                "neil   2 months ago Hiiii Everybody! IMG_4607  ",
                "Carrie Hill   2 months ago I agree with @Kyle - we have a lawyer client who does this (edited) ",
                "Melissa De Oa   2 months ago Yeah that was my first thought, thank you guys!",
                "Melissa De Oa   2 months ago @Katherine Watier Ong sorry I missed your reply, what do you mean by see if AI can help figure it out?",
                "Melissa De Oa   2 months ago Also, do you guys think it matters if the written by and medically reviewed by is at the bottom of the article?",
                "Kyle   2 months ago The byline or a more descriptive bio?",
                "Melissa De Oa   2 months ago The byline and when the content was updated",
                "Kyle   2 months ago i'd put it at the top, personally",
                "Melissa De Oa   2 months ago yeah i think that for medical articles that makes sense, what any thoughts on that for medical webpage?",
                "Kyle   2 months ago what's the difference between med articles and webpage for this site?",
                "Melissa De Oa   2 months ago for example this would be the medical webpage https://my.clevelandclinic.org/health/diseases/3986-breast-cancer the medical article would be like a blog post in which you expect to see an author, but the medical webpage would be maybe the conditions the clinic treats, for example Cleveland Clinic Breast Cancer Overview: Causes, Symptoms, Signs, Stages & Types Breast cancer happens when cells in your breast grow and divide in an uncontrolled way. Breast cancer is the most common cancer in women, after skin cancer.",
                "Kyle   2 months ago i'd still put it at the top, especially if the site isn't a \"known brand\" on the topic, such as CC is for that URL example. i think sites like that example, which are used as trusted sources for that type of YMYL info, can get away with doing things in a different manor.",
                "Melissa De Oa   2 months ago gotcha, thank you!! 2",
                "Katherine Watier Ong   2 months ago @Melissa De Oa at the Word Museum here in DC, they talk about how AI can spot the fingerprint of an author from a corpus regardless of whether they write under a pen name. Google has a few patents that make you questions where they have figured that out too. I was wondering if one of the LLM could figure it out if you feed it enough content.",
                "Katherine Watier Ong   2 months ago I could not quickly figure it out with chat. It's this kind of thing that was inspiring me: https://towardsdatascience.com/a-machine-learning-approach-to-author-identification-of-horror-novels-from-text-snippets-3f1ef5dba634 Medium A Machine Learning Approach to Author Identification of Horror Novels from Text Snippets Lets Get Started Reading time 7 min read Jan 11th, 2022 (16 kB) https://towardsdatascience.com/a-machine-learning-approach-to-author-identification-of-horror-novels-from-text-snippets-3f1ef5dba634 1",
                "Melissa De Oa   2 months ago Oh right, Ive heard about that @Katherine Watier Ong !! Im testing Bard for this, it says it could do it: Screen Shot 2023-08-24 at 3.40.44 PM.png  ",
                "Katherine Watier Ong   2 months ago Ohh! Keep me posted if it works. I'm totally curious. I talked about my take on Google understanding who wrote stuff here: https://withcandour.co.uk/blog/voice-search-site-migrations-and-the-future-of-seo-with-katherine-watier-ong Candour Voice search, site migrations & the future of SEO with Katherine Watier Ong // Candour In this week's episode of the podcast, Jack Chambers-Ward is joined by Katherine Watier Ong of WO Strategies and the DM Victories podcast. They discuss: - SEO for voice search - Site migrations with millions of URLs and hundreds of millions of backlinks - The future of search technology https://withcandour.co.uk/blog/voice-search-site-migrations-and-the-future-of-seo-with-katherine-watier-ong"
            ]
        },
        {
            "message_text": "Katie McDonald   3:56 PM replied to a thread: Good examples of what to optimize your meta data to to encourage more clicks. All ideas welcome! Just want to say a big thank you to @Alejandro Crdenas Chapelln for your help on this! Youre invaluable 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Dave Snyder   11:13 PM this is pry the right place to post this. I am collecting data on author schema for a newsletter series I am working on and need a lot more data than I currently have .. basic poll and I appreciate your help https://www.linkedin.com/posts/davesnydercp_activity-7101952939874758656-aJ-i?utm_source=share&utm_medium=member_desktop linkedin.com David Snyder posted on LinkedIn David Snyder posted on LinkedIn (35 kB) https://www.linkedin.com/posts/davesnydercp_activity-7101952939874758656-aJ-i?utm_source=share&utm_medium=member_desktop 3 2 replies Last reply 2 months ago",
            "replies": [
                "Dave Ojeda   2 months ago Voted, feel free to reach out if you want to talk Schema! 1",
                "Jon Henshaw   2 months ago I'm just gonna slip in this article from two years ago about Google recommending the URL with the Schema author type. https://www.coywolf.news/seo/google-recommends-adding-a-link-to-the-author-page-in-article-structured-data/ Coywolf News Google recommends author page URL be added to 'Article' Schema structured data Google updated its Schema-based structured data recommendations to include linking to an authors bio page to help it disambiguate the correct author for an article. Written by Jon Henshaw Est. reading time 2 minutes Aug 9th, 2021 https://www.coywolf.news/seo/google-recommends-adding-a-link-to-the-author-page-in-article-structured-data/ 3 2"
            ]
        },
        {
            "message_text": "Zach Hall   9:04 PM What is the best practice for articles written by an SME who left the company? +5 20 replies Last reply 1 month ago",
            "replies": [
                "Kyle   2 months ago are you referring to articles published on the company site? if yes, then: leave as is (no sense removing really) if you need to remove for some reason, then switch to company as the author (would need to set this up if you don't have it set already) 1 2",
                "Kane Jamison   2 months ago Most of the time I prefer to see authorship stay the same, and byline updated to reflect that the author is an alumni or something to that affect. \"Jane was previously Head of Marketing for XYZ. {{rest of blurb}\" If it's evergreen content and then gets republished with substantial changes, I like to leave them as a secondary author and add the new person as the primary author, if that feature is available. If not, and author switch is desirable, we sometimes add footnotes to bottom of article in italics like this: \"This article is updated from the original version published in 2017 and authored by Jane Jetson.\" (edited)  2 3",
                "Abby Leigh Curtis   2 months ago At my previous agency, we would say \"Former Director of...whatever\" 1",
                "Zach Hall   2 months ago @Kane Jamison What if I am unable to add text to the byline? Should I switch the main author to our company and then write in a secondary byline before the text starts in italics?  (edited) ",
                "Kane Jamison   2 months ago If there are no bylines then... you might just want to leave the author as-is? Most people won't care whether the author is with the company, or freelance, or owns the place.",
                "Mika Lepist   2 months ago Consider reduction in EEAT value of changing it, if applicable. is there a legal or other relevant reason to change?  More context around why you want to change it, the vertical and topic would help.",
                "Dan Rice   2 months ago In my experience agencies change the author and it as soon as the former employee notices it really annoys them 9 times out of 10. So if there is no real driving need to, I'd just leave it as the existing author.",
                "Donnie Strompf   2 months ago After many years working with attorneys and medical industries. I recommend removing the page entirely. When people search the brand online you don't want the former employe info showing up, removing the page will ensure that former employee will not be associated with the brand moving forward. If you keep the page and users see the employee listed as \"a current employee\" it's misleading. If you list them as \"previously employed\" user might question if the employee left on good or bad terms. IMO job break ups are not usually happy occasions.",
                "Abby Leigh Curtis   2 months ago I'm not sure I agree, @Donnie Strompf  removing a high-quality piece of content is never the move, especially if it was written by a SME. My departure from my agency was an amicable one; progressing in one's career sometimes means moving on to a different organization 2",
                "Abby Leigh Curtis   2 months ago Also, as a writer, I'd be pretty upset if I included that piece in my portfolio and it directed to a 404. 2",
                "Donnie Strompf   2 months ago I see.. If you are leaving on good terms. Maybe include that on the page and turn what may come off as negative to a positive",
                "Donnie Strompf   2 months ago Are there lots of external links pointing to the page?  If not, you can likely 404 without Jeopardizing value of other pages (edited) ",
                "Abby Leigh Curtis   2 months ago I'm talking about including something I'd written on my portfolio website directing to a 404 (edited) ",
                "Donnie Strompf   2 months ago In this case it is case by case",
                "Abby Leigh Curtis   2 months ago I'd also be pretty pissed if something I'd written was changed to \"written by the company\"",
                "Donnie Strompf   2 months ago Yeah that makes total sense, most of the profiles we remove are not tied to web content",
                "Dan Rice   2 months ago I had a bit on my portfolio and they changed the author. I'm still more annoyed about that than I often admit haha. But I've seen people get very angry when they've written stuff and then their name has been removed or changed so that's why I now tell people not to do it unless they have a really compelling reason. 2",
                "Craig Harkins   2 months ago We leave the author the same. If the article is significantly rewritten then we update to the new author.",
                "Alex Juel   2 months ago We have always left the original author and have added (alumni) to their name. I think that implies that the employee left on good terms. If someone left on bad terms, Id probably remove their posts entirely, but thats never happened to us. I think theres a lot of value in keeping the original authors name; it respects the author keeps the relationship in good standing has EEAT the original author can continue to reference/link back to their work the reader will trust it more than a generic written by BRAND NAME",
                "Donna Donahue   1 month ago This isn't my wheelhouse but I feel that once a piece of content is published for a company, that content becomes intellectual property of the company. This doesn't negate the validity of the original author, if they were were a SME they're still a SME creating content elsewhere. I feel its better to leave as is. Especially if its high quality evergreen content."
            ]
        },
        {
            "message_text": "Sam Knight   1:19 AM Anyone know of a WP plugin that can add an author bio, but also has \"medically reviewed by:\" ? (edited)  1 +1 12 replies Last reply 1 month ago",
            "replies": [
                "Kyle   2 months ago ACF field group in an ACF block would be great for this ( @Joseph Farruggio - any suggestions?) 1",
                "Mika Lepist   2 months ago Multiple authors in pro version maybe? https://wpauthorbox.com/ 1",
                "Mika Lepist   2 months ago If they are always by the same reviewer you might look at possibly coding in the theme or just change the author name to include that part. Could be a simple hack and one less plugin to slow things down. Haven't tried it, just an idea.  (edited) ",
                "Sam Knight   2 months ago I did consider a similar plugin with multiple authors, couldn't find one specifically for medically reviewed",
                "Sam Knight   2 months ago ACF might be the move",
                "Jono Alderson   2 months ago ACF x 100% 1",
                "Katie McDonald   2 months ago Whats ACF?",
                "Jono Alderson   2 months ago Advanced Custom Fields. Plugin for adding, structuring and managing custom fields/meta/content/properties.",
                "Katie McDonald   2 months ago Example? Benefit ?",
                "Jono Alderson   2 months ago https://www.advancedcustomfields.com/ ACF ACF | Advanced Custom Fields Plugin for WordPress Customise WordPress with powerful, professional and intuitive fields (114 kB) https://www.advancedcustomfields.com/",
                "Jono Alderson   2 months ago Add fields. Use fields. 1",
                "Noah   1 month ago Cackle cackle @Jono Alderson"
            ]
        },
        {
            "message_text": "Katie McDonald   11:15 AM Hey so I posted a similar Q recently but looking for fresh eyes / perspective please re ranking issues. We cant seem to get into the top 3/5    (edited)  11 replies Last reply 1 month ago",
            "replies": [
                "Katie McDonald   1 month ago What would you do if youve got a load of pages that are trying to rank for camper van hire location eg camper van hire Spainso you have loads of country pages.. weve just added all the country and some city pages to the nav as they werent there. Some improvements but not in the top 5 yet. The URLs are http://domain.com/country/ Im wondering if we need to create sub pages to target RV and motorhomes instead of just one page targeting Rv motor home ANd campers. Were going to remove the brand name in the meta title and add variants of motorhome / rv in. Im thinking about creating child pages eg /Spain/Spanish-city to help /Spain and the new child page rank. But client is concerned the main country page doesnt rank and is apprehensive about building new pages yet. I have more ideas but curious what you guys would do as a first port of call?",
                "Jono Alderson   1 month ago Look at the serp layout and content above you for the types of topics you're trying to compete on, and work out how to be a better resource for those searchers And nail your tech SEO  (edited) ",
                "Kyle   1 month ago @Katie McDonald if you want to DM the domain I could take a look and post back here with feedback. Also, this might be a good one for #technical-seo or #enterprise-seo depending on the current scale/size of the site. 1",
                "Mika Lepist   1 month ago \"We've just added\" - how long is that? Takes time. Especially if you start to dilute the value of links going out from your more powerful pages. What is your internal linking like to these new pages? How strong is the competition and how does your domain compare? Many more questions.... if you want some eyes on it, DM the site and a couple search queries along with location you're targeting searches from. I'm suspecting UK primarily?",
                "Katie McDonald   1 month ago Last 2 weeks we added the nav Change. Weve already seen some improvements so Im thinking thats due to that change. Yeah UK BASED. Amazing thank you. @Mika Lepist",
                "Mika Lepist   1 month ago Don't forget that we're still getting rolled out on a core update too.",
                "Kyle   1 month ago i agree with @Mika Lepist that 2 weeks is a short time frame to see expected results, depending on the competitiveness of your query space, in addition to the core update being in play. beyond that, here are a few thoughts: i think the query specification needs some work. in the US at least, no one will be searching for \"campervan hire US\" i think the idea of region (state in the US) and city-level pages is something you need to lean in on not only should you consider rental pages by geo/market, but also destination pages (broken down by type) - RV'ing (which i personally did for a year with my family) is all about where you're going (think national parks, tourist destinations, etc.); i'd recommend taking a look at the content strategy behind rvshare.com as an example for this setup your navigation structure to go down the geo-levels by type of content: rentals: country -> region -> city destinations: country -> region -> city etc. there's likely more we could dive into with this, but these are my top level thoughts",
                "Katie McDonald   1 month ago @Kyle 2. Agreed - do them as supporting sub child pages to the main country one? (We found states didnt have much SV tho for the US) 3. Will look at rvshare.com rankings. So would you have pages for camper hire in national parks? 4. What would be c and d?",
                "Kyle   1 month ago 2. they could likely be hierarchical as the city pages couldn't co-exist in multiple regions, nor regions in multiple countries (this can be applied globally) 3. not rentals/hire in national parks, but creating pages around those destinations and tying that into and out of your rental/hire pages 4. c & d would be whatever other types of content you might be able to segment into (roadtrips (e.g. https://rvshare.com/road-trips/enterprise-to-el-paso), etc)",
                "Mika Lepist   1 month ago To join in on Kyle's input: 2. Not much SV can mean more opportunity. Also, SV is not always accurate. I've had sites that have done very well with long tail terms just because they are less targeted. 3. You might consider some less transactional content that allows you to be more giving with outbound links. Ex: article about the best places to stay with a campervan in a location. Build a little mini guide, highlight and link out to official sites for attractions, popular activities, things like that. Don't let it cannibalize your existing rankings so don't zoom in on those terms too close. Use those pages for internal linking as well. ex: https://rvshare.com/dumpstations/washington (and this is just a page about tank dumping, but essential for people on the road in an RV that don't always stay in parks with hook-ups so very relevant.",
                "Kyle   1 month ago On the point of low SV; much of the marketplace potential comes from the aggregate sum of traffic. So, while overall SV on a per page basis may seem low, in aggregate, it adds up to a lot"
            ]
        },
        {
            "message_text": "Jon Holt-Thomas   11:34 PM I saw a great infographic/anatomy style graphic of an ideal blog page template which includes EATT elements etc recently, possibly here, but can't for the life of me track it down. I can't remember much more than that does anyone know any good ones they'd point to? 4 replies Last reply 1 month ago",
            "replies": [
                "Eloise West   1 month ago Was it this beauty from @Jess Joyce , perhaps? https://twitter.com/jessjoyce/status/1692234152395804827/photo/1 X (formerly Twitter) Jess Joyce on X Copy my secret framework to turn any blog into a REVENUE-MAKING machine: (This is the exact structure I've used to grow an edu SaaS from 100k to 260k users within a year) Bookmark this to refer back to it later. (184 kB) https://twitter.com/jessjoyce/status/1692234152395804827/photo/1 1 1",
                "Jon Holt-Thomas   1 month ago @Eloise West you're a legend, thanks so much, that's the one. @Jess Joyce all credit to you too!",
                "Eloise West   1 month ago @Jon Holt-Thomas I know right? I shared it with my boss, who immediately passed it on to the team doing our website design to make sure we're hitting all of these with the new blog pages",
                "Jon Holt-Thomas   1 month ago @Eloise West so good, needed this in my life! Thanks a million again"
            ]
        },
        {
            "message_text": "Katie McDonald   8:59 PM Internal linking question 28 replies Last reply 1 month ago",
            "replies": [
                "Katie McDonald   1 month ago If you have a site whereby all the pages dont relate to each other like theyre not similar products say theyre landing pages about different locations, how do you internally link between them other than having them on the nav logically? Other than having other locations somewhere and then linking",
                "Kyle   1 month ago hey @Katie McDonald ! is this related to the camper hire site from yesterday?",
                "Katie McDonald   1 month ago Yeah 1",
                "Kyle   1 month ago so if we're looking at geo, some ideas could include: country page: link to regions + top cities + specific sub-types or related types region page: link to country + other regions + top cities of that region + specific sub-types or related types within the region city page: link to parent region + other cities nearby + top cities in region + other cities in country similar to the city + sub-types or related types within city 3",
                "Katie McDonald   1 month ago Okay yeah I dont think we have enough city pages! Client doesnt seem to want to produce city pages because she wants to get the country pages ranking first but I think the city pages will help them rank?",
                "Kyle   1 month ago from what you were saying yesterday, the country pages do rank, just not in the top positions desired by the client, correct? topically speaking, creating these subpages will help built relevancy, as well as drive incremental results through more targeted queries related to those subpages. through internal linking, you can then start passing equity and relevancy down, up and across your structure, which should have a net positive effect on rankings and traffic.",
                "Katie McDonald   1 month ago Yeah some of them rank 7 and lower and page 2. With the city pages would you start by biggest search volume or position of the country page?",
                "Kyle   1 month ago i'd look at potential traffic/search volume + available inventory (if applicable)",
                "Katie McDonald   1 month ago If the client was apprehensive to create new pages, Im thinking to see if shell get on board with 3 new City pages for one of the countries thats been a priority for her, and then hopefully they perform, and shes happy to do a whole load more? What would you do to convince her",
                "Kyle   1 month ago give her an estimated view of performance impact (e.g. by creating these pages, we expect N results in incremental traffic and revenue) give her some examples of how these pages could look (by showing other sites that do a similar thing or by mocking up some examples yourself) give her some ideas about the angle / USP you'll target that will help you perform well with these pages give her an idea of what would be needed from her to create these pages, and what may be the budgetary impact she should expect show her how you will start connecting the dots between the pages create some level of expectation around these may not be what's fully needed to be successful at a large scale, and that this is the start of an experiment also, for some of the copy side of things, you could look at building these out using more of a programmatic service like copy.ai, etc. if needed (reduce investment, speed up implementation and hopefully realize results more quickly). (edited) ",
                "Kyle   1 month ago others may have additional or alternative input on how to convince her than what i've provided too, so don't take my feedback here as canonical or exhaustive",
                "Katie McDonald   1 month ago Awesome. Yeah we will use AI she was impressed at that. We can definitely do that. Re expected traffic, I would normally do an if we rank 3rd based on x SV and your ave 3rd CTR and then the same for ranking 5th. Is that what youd do? For the first day 5 new city pages and related country page. And then once the results come, we can do it country by country?",
                "Kyle   1 month ago yeah, you could use that methodology for traffic; seomonitor.com (not affiliated) also works nicely for plugging in some of the keywords that you'd expect to rank for on these pages, and the map out a traffic growth forecast based on that.",
                "Katie McDonald   1 month ago Not heard of it!  Have you used it and would you recommend",
                "Kyle   1 month ago i've trialed it out a bit, but my daily use case did not apply. if it did, i'd totally use it. I know @Nick LeRoy uses it, and others are [affiliate] promoting it pretty heavily (e.g. Kevin Indig, I believe Eli Schwartz, etc.)",
                "Nick LeRoy   1 month ago @Kyle and @Katie McDonald thanks for the ping. I have used SEOMonitor and in full transparency they have paid me to promote it.",
                "Nick LeRoy   1 month ago I think the tool is good but should be taken as directional insight.  Its as good as most would build through a spreadsheet. 1",
                "Nick LeRoy   1 month ago so its mostly a time saver IMO.  The bigger value add (and their target) is actually large agencies who are regularly trying to show value and win new SEO business.",
                "Katie McDonald   1 month ago How much is it",
                "Nick LeRoy   1 month ago you can do a free trial but I think its like $100/m",
                "Nick LeRoy   1 month ago nothing crazy",
                "Nick LeRoy   1 month ago If you sign up for the trial and want to put down that you heard about it from me -- I don't get paid but they get validation from paying me to share my insights/opinions",
                "Nick LeRoy   1 month ago image.png  ",
                "Katie McDonald   1 month ago The case with me is that I want to show potential traffic and thus conversions based on new pages (5 atm) and then if successful (lots more). I can do that in a spreadsheet so what does the tool do for 100 dollars a month?",
                "Katie McDonald   1 month ago Okay thanks so much!",
                "Nick LeRoy   1 month ago gotcha -- so this is going to focus more so on growing existing content... goign from say 8th page of google to 1st page. Id still try the free trial but this may not be a perfect solution for what your looking for.",
                "Katie McDonald   1 month ago Yeah not necessarily to win new business atm",
                "Craig Harkins   1 month ago I would look at the linking structure of some sites that are successful in your niche and also look at how much they rely on City vs Country pages for traffic. Looking at this site, they put focus on top cities which cross link to related cities and blog content: https://indiecampers.com/rent-an-rv/cologne Linking changes take some time to take effect. Google has to recrawl the site and bake the new signals in. I can see some impacts right away but its usually a month or more before we realize the full impacts. indiecampers.com Campervan Rental in Cologne - Best Deals | Indie Campers Looking for a campervan & RV rental in Cologne? Explore the city's surroundings on an unforgettable road trip. 24/7 assistance & free cancelation! (252 kB) https://indiecampers.com/rent-an-rv/cologne 1"
            ]
        },
        {
            "message_text": "Braden Becker   6:44 PM Does anyone have any case studies (or cautionary tales) of subdomain   subfolder blog migrations that were not net positives on traffic? Success stories are common, but I'm wondering if, for example, a blog might inherit strained crawl budget in exchange for link equity, and it goes south.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Cillian BC   8:30 PM I reached out to the publisher of a list post article that features all our competitors, but not us, they charge $2700 per year to be added to the article. It gets ~40 clicks p/m(GSC). 2/11 competitors currently pay, the rest are featured for free, is this a thing now? 5 replies Last reply 28 days ago",
            "replies": [
                "Kyle   1 month ago wait, did they give you that data (40/m, etc.)? that's crazy. also, yeah, publishers are looking for any way they can to keep the cash flowing. asking to be added is a rental agreement now; if you want the space, you often are asked to pay.",
                "Cillian BC   1 month ago Yep, they sent me a GSC screenshot for the article (edited) ",
                "Kyle   1 month ago i'd be curious what their outbound clicks on paid listings are. what type of roi are they hypothetically driving?",
                "Cillian BC   1 month ago I didn't question it any further. 40 clicks per month @ $225 per month on a listicle article.",
                "James Norquay   28 days ago This is very common now for most list type sites, ask for monthly cost because if you pay yearly and the site gets hit and drops in ranks the money is gone."
            ]
        },
        {
            "message_text": "Jordana Abitbol   5:33 AM Hey! For schema data markup on articles, I understand its important to have an author url added for credibility in a certain industry. My writer works on all client blogs in different industries so Im wondering if someone knows if I should use their LinkedIn url as the author url. Or is there some type of website where blog writers should create a profile and talk about the industries they work in that is better to link to for the schema data? Many thanks, this is my first post so excited for any feedback:) 12 replies Last reply 1 month ago",
            "replies": [
                "Kavi Kardos   1 month ago I most often see folks just using personal, self-created websites for this sort of thing. Usually with a bio and some samples of past work plus contact info",
                "Kyle   1 month ago A great question for the #schema channel!",
                "Jordana Abitbol   1 month ago Thank you Kavi! If they dont have a website have you seen people use LinkedIn",
                "Jordana Abitbol   1 month ago Hi Kyle, great point. Ill post there as well :)",
                "Kyle   1 month ago Typically, the author URL in schema will be for the URL on the website they are the author of. You would use the sameas property to indicate other URLs, which defines them as a person as well. That could be a LinkedIn, Twitter, their personal website, other publications, etc.  (edited) ",
                "Kyle   1 month ago Oh, and welcome!",
                "Jordana Abitbol   1 month ago Yes, that would be typical, but its a bit different because the writer is not part of the clients company. Or are you saying they should have a page on the clients website as the author of their blog?",
                "Mika Lepist   1 month ago Author profile page on the site they are writing on, possibly with links to other sites and profiles to build credibility, unless there are some compelling reasons not to have on the same site. This way you control the content of that page as well and don't have to worry about 404s later unless you take it down. Or no author page and a short bio in the article footer. But sometimes it just doesn't matter. So the answer is: it depends :) (edited)  1",
                "Kyle   1 month ago Im saying, if they write the content for your client, and the content is published on your clients blog, then the authors schema would be set to them, and you would use the sameas property to reference other URLs associated with the author. That could include having a dedicated author page on the client site, but does not necessarily have to. They also do not need their own site, but could include it in the sameas if available. Does that make sense? (Edited due to poor text to speech while holding a baby ) (edited)  1",
                "Kyle   1 month ago And sorry, to answer your point of not being part of the company: thats very common. Ghost writer, contract writer, etc - same approach applies in most instances.",
                "Jordana Abitbol   1 month ago Thank you Mika! 1",
                "Jordana Abitbol   1 month ago Ahah omg multi tasking at its finest   okay this all makes so much sense. Thank you so much! 1"
            ]
        },
        {
            "message_text": "Abby Leigh Curtis   6:45 PM Question for y'all. We're having some instances of our Research News content ranking better than core content for some high-priority keywords. Other than de-optimizing the RN content and linking to the core content, I'm not sure how to signal to Google that it's not the main page on a given topic. Related: my boss is also hesitant to link to the RN content from core content, even when it provides informative context. 32 replies Last reply 15 days ago",
            "replies": [
                "Boyd Norwood   1 month ago Do you have an example keyword/SERP I could look at along with the URL of the page that you would rather be the one ranking? 2",
                "Jonas Sickler   1 month ago Its hard to say without knowing the keyword, but here are some high-level things to consider: competitive landscape - what types of websites and pages are ranking? What types of content does google prefer? Search intent - what do users seem to want when they search that keyword? Does your core content satisfy that intent better than the news page? timeliness - Is the keyword part of a trending or news related topic? Is relevant and timeliness important? Are there a lot of recent news articles about it in the news tab? authority - Does the news page on your website have a lot of backlinks compared to the core page? (edited)",
                "Jonas Sickler   1 month ago Also, @Abby Leigh Curtis , I analyzed the organic search market share for breast cancer keywords last month. I can send you the data about the top 20 brands with the most market share, and which pages are driving performance for them if you think it would be useful. Happy to share a Google sheet of data and screenshot of the graph (edited)  1",
                "Mika Lepist   1 month ago Simple thing you could try like you mentioned is linking from the higher ranking content to the one you want with a close variation if not exactly the keyword (as long as it's human sensible) you're wanting to rank the other for. That alone might be enough without having to de-optimize, adding risk. Try it on something that doesn't rank as well where the RN is still better positioned than desired page. (edited)  1",
                "Abby Leigh Curtis   1 month ago Of course the example I had has now shifted in favor of the core content, lol 2",
                "Jonas Sickler   1 month ago @Mika Lepist makes a great point about internal linking though. Those are incredibly valuable for passing context, relevance, and authority 1",
                "Abby Leigh Curtis   1 month ago absolutely agree",
                "Boyd Norwood   1 month ago @Jonas Sickler Im curious to know how many keywords you included in your analysis of the breast cancer market?",
                "Jonas Sickler   1 month ago I pulled thousands of terms initially, but trimmed the list at 1600 monthly volume for this set. When calculating market share, we find theres very little variation in market share percentage beyond the top 300 or so terms  provided you have a good representation of the entire space We have some proprietary tech that allows us to do keyword research and calculate market share using APIs. 1",
                "Jonas Sickler   1 month ago Feel free to poke around the data here https://docs.google.com/spreadsheets/d/1YtB7-WU7zPUz9vp3k7z9xOLUUiWopZ7-zijFFAqCc5s/edit#gid=344811536 Rather than an exhaustive list of all keywords to publish on, it gives a snapshot of the biggest opportunities and whos controlling the conversation. We designed this approach to help executives understand the broader value of organic search in terms of asset value and market share rather than traffic and rankings. (edited) ",
                "Boyd Norwood   1 month ago Awesome thanks! 1",
                "Abby Leigh Curtis   21 days ago Okay, I finally have an example. https://www.breastcancer.org/research-news/most-satisfied-going-flat-but-without-dr-support outranks https://www.breastcancer.org/treatment/surgery/going-flat-no-reconstruction for \"going flat after mastectomy\"  BUT ONLY ON MOBILE",
                "Mika Lepist   21 days ago I see https://www.breastcancer.org/treatment/surgery/going-flat-no-reconstruction #1 on both mobile and desktop. Incognito/private on both browsers. 1",
                "Abby Leigh Curtis   21 days ago RPReplay_Final1696016770  0:07",
                "Abby Leigh Curtis   21 days ago omg i did not know the music would be in the video lmao 2",
                "Jonas Sickler   21 days ago First, I saw your main content ranking for that term on both mobile and desktop, but then ran the search again in private browsing and saw the news piece and a flap closure page ranking in positions 3/4. So there could be a number of competing pages. But heres my take: ---- Both of these URLs seem to answer the same question: whether or not you should go flat after surgery. The surgery URL is about the options and considerations, and the news URL is about the emotional impact of the decision  both of those are highly valuable. This seems like a personal choice that can have both emotional and health ramifications, but there is no right or wrong answer. Given Googles commitment to lifting up helpful content and to highlight more perspectives, Google probably sees the value in showing the news content which offers survey data from real women who have made this choice. On the other hand, the surgery/treatment content offers readers information about all the considerations involved in making the decision. Also worth noting, the mobile version of the surgery content looked odd. So check that out. Maybe Google doesnt see it as a good page experience, so its showing the other content instead? -- Overall, I like how you have news content. It supports the website and builds trust. Its an excellent way to attract citations from other websites, and then you can link out to the main content to pass it along. But I would make sure to differentiate it from your surgery content. 1",
                "Jonas Sickler   21 days ago 3 files  ",
                "Jonas Sickler   21 days ago image of the surgery page above, the competing SERPs, and the news page - all on mobile",
                "Abby Leigh Curtis   21 days ago thank you for pointing that out! Ill investigate",
                "Mika Lepist   21 days ago Your video makes me think you're not in private mode. Are you signed in to Google? In private tab G will prompt you to sign in, etc. If you're not in private tab, then you're going to get customized results. (edited) ",
                "Abby Leigh Curtis   21 days ago Im signed out but not in incognito",
                "Abby Leigh Curtis   21 days ago this wasnt even an intentional discovery, Im at the gym and was trying to send our content to a friend who is getting a double mastectomy",
                "Mika Lepist   21 days ago You're still cookied. I'd always use incognito/private. Try it and see if you get different results.",
                "Abby Leigh Curtis   21 days ago  ",
                "Abby Leigh Curtis   21 days ago Ill do that!",
                "Mika Lepist   21 days ago I'm also getting the same rendering issue on mobile that @Jonas Sickler shared in the first image. Jonas, if you tap the X to close the consent banner, are you able to interact with the page? It locks the page on my end so I can't do anything after that, but might be ad blocker conflict.",
                "Mika Lepist   21 days ago @Abby Leigh Curtis if you want to signal to Google what  you want your primary content to be for a term, you can do a site search with the term. ex: https://www.google.com/search?q=going+flat+after+masectomy+site%3Abreastcancer.org Then you can see what other content Google is associating with that term and put links from those pages to the one you want to rank. It doesn't always work because Google may still decide one piece of content is better than another (or like in the case of rendering or other issues demotes for mobile), but it can help. 1",
                "Mika Lepist   21 days ago Incognito search of course - you don't want any personalization affecting the result.",
                "Boyd Norwood   15 days ago @Abby Leigh Curtis @@Jonas Sickle, I pulled some SERP data for the 311 breast cancer related phrases that data @Jonas Sickler shared earlier in this thread. (I was curious to compare Nozzles share of voice data with his market share databut that is another story). Anyway, for those 311 keywords, the images below give you some data about the following as it was on October 1st: (first image) - how many times a /research-news/ url ranked (second image) - which keywords had a /research-news/ url as the top ranking url In that 2nd row, for breast cancer gene, your url is ranking inside the PAA box as one of the answers. (see third image) If you would like help seeing how big a problem this is for keywords that you care about, just send me a list of those keywords and Ill plug them in and find out (at no charge to you). Im a fan of looking at a lot of SERPs for this type of analysis. The more keywords, the better youll understand the problem. Im okay if you send up to 10,000 keywords. 3 files  ",
                "Abby Leigh Curtis   15 days ago Thank you so much, @Boyd Norwood !!",
                "Abby Leigh Curtis   15 days ago Right now I'm trying to see which of our core pages also rank for the terms RN content is ranking for. It's proving more difficult than I anticipated (edited) ",
                "Boyd Norwood   15 days ago If you send me a list of keywords, I can help with that. 1"
            ]
        },
        {
            "message_text": "Zach Hall   1:14 AM Hey all! My accounting firm is starting to write more short alert articles that are time bound. For instance, some of them make people aware of certain tax extensions or deadlines. My original thought is to just remove and redirect when the alert is no long relevant. Is this the best way to handle article of such type? +3 9 replies Last reply 1 month ago",
            "replies": [
                "Paul Baterina   1 month ago Where would you redirect it?",
                "Carrie Hill   1 month ago Id redirect to a custom page that states  the content you were looking for is now out of date - tax info changes fastetc. With a site search box and some links to your most popular content and definitely a CTA 1",
                "Stephanie Briggs   1 month ago My instinct is the same. Id likely redirect them to a hub/category page that has the latest timely news articles listed. Unless its something that will come up every year, then I might keep that URL evergreen and change the content on it to whatever is relevant at the current time. 2 2",
                "Mika Lepist   1 month ago What @Stephanie Briggs said. 1",
                "Jonas Sickler   1 month ago I agree with @Stephanie Briggs . And I love that you are keeping your sensitive tax information up to date to serve users better! Here are some additional things to consider: If the advice changes, but is still relevant, Id update the article rather than removing it. If the advice is no longer valid and the content cant be updated, Id redirect it to a similar topic that users might find helpful. If you have nothing relevant to redirect to, then I like your suggestion, @Carrie Hill , of redirecting to a custom page with a search box. In that case, I might recommend also including links to several of your most important categories or articles as well. You could even have some fun with it ____ Oops! It looks like we archived that content. (Unlike wine, tax advice doesnt get better with age). What can we help you find [SEARCH BOX]? Our most popular resources: (list of top 10 categories or pages) 1",
                "Zach Hall   1 month ago Thank you all! Those tips are very helpful. 1",
                "Blair MacGregor   1 month ago Ill go against the grain slightly and say I dont think the pages youre describing necessarily *have* to be 301d/removed. Plenty of news sites have archived stories about tax deadlines, brackets etc from previous years. If it was accurate and helpful to users at the time it was relevant, its not going to count as some kind of quality strike against your site just because its old. You just dont want to confuse people into thinking its still relevant for the upcoming tax season. To that end, you could keep the page(s) with some kind of label (perhaps in the hero or right above the body) that says This was valid for the 2022 tax season but is no longer updated. Thats what we did on Annuity.org with COVID-specific financial information that we published. And the pages are still there, link equity is maintained etc. 1",
                "Tyler Brown   1 month ago All good thoughts here. I'd agree with @Blair MacGregor , personally. I used to run a Mediare Supplement site that had articles about expired plans - they still received traffic, and served legitimate user queries. But that does come with a light time cost of making sure you update the articles to reflect that it's old information. 1 1",
                "Jonas Sickler   1 month ago True. Ultimately it comes down to whats best for your users. In a very sensitive YMYL space, Id be cautious about any content that could send users down the wrong path. If tax advice is out of date in a way that could cause financial harm to users, it may be best to retire the content rather than place a note on the page stating that its out of date In short, put users first when making any decisions 1"
            ]
        },
        {
            "message_text": "Abby Leigh Curtis   11:24 PM I feel like I'm back at an agency. I'm now required to put explanations/reasoning behind everything in my SEO briefs 5 1 reply 14 days ago",
            "replies": [
                "Bridget Sandine   14 days ago Same. But I find the more people know the more buy in you get (in most cases). 1"
            ]
        },
        {
            "message_text": "Paul Skirbe   1:40 AM hey guys, i'm trying to understand a few things about YMYL content. i'm working with a client in the coupon space and it seems to qualify for YMYL content because it is about savings while you're shopping (according to https://ahrefs.com/seo/glossary/ymyl-pages). so what do people do to signal the quality of the content, besides trying to make the best quality article? seems like authorship is a big deal. sharing who authored the page with a brief bio. anything else? 2 replies Last reply 1 month ago",
            "replies": [
                "Jonas Sickler   1 month ago Trust is pretty important in that space. Ive seen so much spam where you click the link and it redirects or the coupons dont work. I agree it touches the YMYL space, but not to the degree finance and investing does, or health information. Overall, Id look at what Google seems to be favoring in the SERP. Are they articles? Or lists of coupons? Do they look like blog posts or do they have a different format? Timeliness is also important for coupons. How will you treat expired coupons or codes that dont work? In other words, its critical to think about user experience beyond just how can I rank - but how can you deliver on the expectations of your audience, and ensure they have a great experience from the click to the purchase.",
                "Paul Skirbe   1 month ago @Jonas Sickler thank you! i'll look at the pages that are performant and see how they treat expiration, user experience, etc. 1"
            ]
        },
        {
            "message_text": "Katie McDonald   11:54 PM EEAT Q +2 11 replies Last reply 24 days ago",
            "replies": [
                "Katie McDonald   29 days ago Ive just redirected my very new Hiking  .co.uk site to a .com one so I can start focusing on US traffic.. and one day in the future look at affiliate marketing via ads my plan originally was to write  about the topic - big passion and hobby of mine - but the thing is Ive never been to America. So Im thinking I could still produce good content, and then ask US bloggers who hike to back link and guest post But will Eeat stop me ranking if Ive never been to USA?",
                "Paul Baterina   29 days ago I think at the end of the day, if the content is useful and helpful you'll be able to rank. Perhaps there could be certain queries regarding to hiking that's not catered specifically to America, where you're still ranking for it. Ex: \"How to prepare for a hike\" etc. ? I think if anything, you being the expert as a \"hiker\" should be more than enough. Now if you write \"10 places to hike in Los Angeles California!\" And you've never been, then maybe it wouldn't help. Unless you angle it in a way where you have writers / other hikers contribute that are from California ,and have hiked it. The other part is the unknown.. I've read this recent algo update has hit a ton of bloggers pretty bad. Even those that may seem \"authoritative\" \"unique content\" etc. also got hit. Granted, the algo is still fresh so we have to give it time. And the other unknown, with SGE, I'm not sure what that would entail. With that said, I personally think you should be fine, depending on the topic regarding hiking.",
                "Paul Baterina   29 days ago I don't know if this will help. I did a list of bloggers in the past for hiking. Some as parents/family hikes, and some solo hikers. Maybe you can go through this list, identify if they're from the UK and see if they do have articles that are ranking well in America (?). Or extract the list here, and find more bloggers that are? I hope that's some help! image.png  ",
                "Jonas Sickler   29 days ago @Paul Baterina made some excellent points about what topics you can write about. The think to remember about EEAT, is that you dont need to satisfy all 3 (experience, expertise, authority) in order to build trust. Every topic is different, and you should lean into whichever one of those elements makes the most sense for your topic area. In terms of hiking, some topics are universal: hiking equipment trip supplies best practices safety And type of hiking conditions are somewhat universal too: day hikes vs thru-hiking mountains vs trails wet vs dry cold vs hot That said, I would avoid targeting queries that seem to require experience that you might not have: best hikes in New York hiking the Appalachian Trail most scenic hiking trails in California",
                "Jonas Sickler   29 days ago I always liked the simplicity of this graphic: what-is-google-eeat.png  1",
                "Kane Jamison   29 days ago I would tackle all of the stuff Jonas highlighted that is more universal, and hire out a little expertise once it makes sense to do so on those US phrases. It is very possible to read other people's trail trip reports and highlight other people's photos and configure your own map and still produce the world's best page about a specific trail, so, not impossible, but will be missing a little bit of the 'experience' factor until you do it, or get your own photos, or can demonstrate the experience through a guest author.",
                "Kane Jamison   29 days ago Sidenote - I worked in the vacation rentals space in 2010, and wrote a few articles about featured hikes near our cabins. I didn't pretend to have done the hikes, I just described the routes, made a great map image, and curated other people's experiences. I just checked and most of them are still ranking on page 1 for the hike name 13 years later without any refresh or changes. They're 500 words with 2 images. So... you can still earn some traffic for some of the hiking keywords you want to go after, without showing the expertise, if you offer something substantially better than other hike profiles. (edited) ",
                "Tree   29 days ago Avid US Hiker here. I bet you could create a \"list of places you want to hike\" as a checklist/mini html sitemap of sorts. Then start putting together how to make it happen...travel plans, permits, differences bt us hike vs intl hiking, etc. Or aggregate specific hike reports/resources from you favorite bloggers/different sites that roll up to \"hiking in {place}\" resource page.",
                "Paul Baterina   29 days ago With the name Tree, I bet you're an avid hiker! What a dope name @Tree .",
                "Geoff   29 days ago Additionally, theres a lot of public domain / Creative Commons photos out there that you can use to avoid stock photos.",
                "Jeremy Rivera   24 days ago Does anyone have any insight on how Google looks on author changes for existing articles from referencing a \"nobody\" to a new author, with a author bio, and proper Schema markup?"
            ]
        },
        {
            "message_text": "Ishaan Gupta   12:19 PM Have been experimenting on how to write op-ed level high quality articles much faster using LLMs for research. ~90% there",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Abby Leigh Curtis   7:37 PM Has anyone else seen a clear pattern of negative impact on rankings and traffic when pop-ups are active? 7 replies Last reply 24 days ago",
            "replies": [
                "Jeremy Rivera   25 days ago I have 1/2 of the picture on this, I just consulted and pointed out that their full-page interstitial pop-up is hard to close, and might run afoul of Google's stated rules:",
                "Jeremy Rivera   25 days ago About this last point: John Mueller, one of Googles webmaster spokespersons, added that the penalty addresses interstitials that show up on the interaction between the search click and going through the page and seeing the content. So thats kind of the place were looking for those interstitials. What you do afterward, like if someone clicks on stuff within your website or closes the tab or something like that then thats kind of between you and the user. (source). Search Engine Journal Google's John Mueller on Structured Data, Speed, Disavows, Legacy Penalties & Much More [PODCAST] Google's John Mueller also talks about technical SEO, content, communicating with SEOs, and why people should feel free to ask \"dumb\" questions. Written by Danny Goodwin Est. reading time 4 minutes Nov 21st, 2019 https://www.searchenginejournal.com/google-john-mueller-podcast-interview/336401/ YouTube | Google Search Central English Google Webmaster Central office-hours hangout 1",
                "Jeremy Rivera   25 days ago https://webmasters.googleblog.com/2016/08/helping-users-easily-access-content-on.html Official Google Webmaster Central Blog Helping users easily access content on mobile Official news on crawling and indexing sites for the Google index 1",
                "Adam Humphreys   24 days ago Its best to delay popups as to not annoy users. I hate popups and unless its a financial offer thats enticing Id strongly avoid newsletter prompts.",
                "Abby Leigh Curtis   24 days ago yeah, I've recommended a delay I'm just curious if anyone else has seen an IMMEDIATE impact on rankings/traffic.",
                "Adam Humphreys   24 days ago Let us know how it works out. You could likely get an idea by GSC data crawl following and monitoring the rank reported in there. Its not 100% but its correlated. If anything your customers will appreciate it.",
                "James Norquay   24 days ago Add a delay on the pop ups and usually its fine. What Ive seen cause issues is where websites add popups with no delay and it causes cls issues or similar. Articles like this are a good start to push you in the right direction  -https://wisepops.com/blog/SEO-friendly-popups If you or the client is worried you can test implemtation on a small set of pages first before site wide roll out.  (edited)  wisepops.com How to Create SEO-Friendly Pop-Ups in 2023 Learn what Google really thinks of pop-ups and how you can optimize your pop-ups for both SEO and conversion. (37 kB) https://wisepops.com/blog/SEO-friendly-popups 1"
            ]
        },
        {
            "message_text": "Jordan Silton   6:52 PM Does anyone have a great video partner they work with to create quality how-to or DIY videos as part of a content strategy? Looking to produce 50+ videos, so this partner would need to be able to work at scale, not just a couple per month. Please reply or DM me if you have anyone you'd recommend. 2 replies Last reply 24 days ago",
            "replies": [
                "Katie High   24 days ago I may have someone. Let me check and see if this is a good fit for them.",
                "Kavi Kardos   24 days ago Hey Jordan, would they need to be able to travel to film on-site or could this be done remotely?"
            ]
        },
        {
            "message_text": "Abby Leigh Curtis   9:37 PM My boss panics every time we see fluctuations in clicks or traffic. Does anyone have tips for how they explain to non-SEO folks that it's completely normal? +3 16 replies Last reply 18 days ago",
            "replies": [
                "Becky Westmoreland   23 days ago Interest - you can always show the google trends line as well - that interest determines everything - if someone isn't looking for x - our job is just to be in those top spots for when they do 1",
                "Becky Westmoreland   23 days ago Working in entertainment this is true - we have titanic.fandom.com which will get spikes in traffic when the show is on tv or holidays or if the ip does a deal, but generally no one is looking for it",
                "Abby Leigh Curtis   23 days ago that makes total sense, Becky!",
                "Becky Westmoreland   23 days ago I have done slides where Interest, Traffic, Ranking, and Impressions on Google are the base analysis - you can't just look at one of these metrics. Just like having a high temperature doesn't mean you have a fever - if you just came out of a sauna you would also have a high temperature.",
                "Katie McDonald   23 days ago Explain that there are hundreds of ranking factors, the serps change hundreds of times in a day so its never the same! 3",
                "Jonas Sickler   23 days ago Great tip from Becky. Several things to keep in mind Traffic always fluctuates. Watch monthly and quarterly trends, not daily and weekly. Be mindful of seasonality  breast cancer events or news could cause irraddic spikes Search intent shifts, and sometimes SERP features reduce CTR by answering questions in the SERP Try to emphasize business metrics over vanity metrics in reports  Rankings, impressions, and traffic are all vanity metrics. Theyre good leading indicators of revenue, but ultimately arent worth anything themselves beyond KPIs that youre moving in the right direction. Look instead at hard and soft conversions (subscribes, donations, transactions, revenue - things that directly drive top-line revenue or business value) Think in terms of market share gained/lost for the sets of keywords you care most about rather than hard traffic numbers. If the overall search volume is reduced, you could gain market share while also losing clicks. So, while traffic would be lower, youd have a larger share of the available clicks Filter to your target audience - are you looking at US only customers? If so, ignore any traffic from outside the US for all reports. Your numbers will go down, but the data will be more valuable and accurate (edited) 3",
                "Abby Leigh Curtis   23 days ago Great points, @Jonas Sickler ! Unfortunately, we have to report on traffic weekly, so I think my director's fight-or-flight has been affected by that",
                "Jonas Sickler   23 days ago PS - Abby, Ill pull the September market share report for our breast cancer terms and send those over to you in a DM when the data is ready. Should be available October 2 1 1",
                "Jonas Sickler   23 days ago I hear you. Sometimes folks want those reports.",
                "Abby Leigh Curtis   23 days ago I thought this was a great visual from Google/ @Chris Long on LinkedIn: (edited)  image.png  ",
                "Jonas Sickler   23 days ago Yes! Thats a fantastic illustration of how to diagnose specific issues",
                "Tamara Hellgren   23 days ago If you are reporting on traffic & clicks weekly are you including year-over-year comparison? If numbers are up compared to the same time period previous year it should take the sting out of them being \"down\" due to normal fluctuations 1 2",
                "Paul Baterina   23 days ago Show them this graph. It's Nike.com. Say even they go up and down lol. image.png  3 1",
                "RP   21 days ago Great question as I have to deal with this also. I reiterate what has been said above, try to educate them that several metrics need to be viewed to get an overall picture combined with market demand/competitor traffic/rankings/overall conversions/PPC performance etc. I also like to remind them that I've been waiting on dev stuff for months and what would the site be doing if we hadn't made any improvements! 1",
                "Matthew Bardsley   18 days ago This thread is giving me PTSD from former clients  I always found that context was the best way to navigate these convos. Empowering your boss with why traffic is down and showing data trends can really help them understand and communicate it with who they report to. As @Jonas Sickler said, maybe you can monitor higher quality traffic. Showing that quality traffic wasn't affected or that it's a low priority keyword that is down clicks can quickly establish what is worth chasing and what isn't. We would report on total metrics but all of the granular reporting was on quality metrics because the total just didn't represent what was actually generating revenue. Our process was that we always wanted to catch issues within 24 hours. We'd monitor for at least a week (as long as it wasn't a critical drop). Then the following week we'd identify some quick win solutions if the course hadn't corrected. Sharing this process with your boss can also help them understand how you're going to handle drops in traffic which can build a lot of confidence that they don't have to ask for this data. Finally, if it remains a problem, reminding your boss that chasing every drop has a consequence. It could mean not getting to the action items that actually improve performance. That is a delicate convo but if it persists, you may need to discuss how it'll affect your long term goals. Hope that helps, @Abby Leigh Curtis !! 1",
                "Abby Leigh Curtis   18 days ago thank you, @Matthew Bardsley 1"
            ]
        },
        {
            "message_text": "Andy   1:38 AM Apologies if this has been asked already, wordpress category and author pages, index, noindex, it doesn't matter, thank you. 3 replies Last reply 23 days ago",
            "replies": [
                "Tory Gray   23 days ago It depends! Author pages: mostly index, esp if they are good/valuable/rich pages full of awesome authors with E-E-A-T. If not less so. Improve that! Category pages: mostly index, unless theyre acting like tag pages (eg duplicate and full of wild variations due to spelling and spacing etc). Keep category pages tight - eg a limited list of actually useful categorization. Then optimize them as you would any page thats useful for users overall, and users coming into those pages from search engines. 6",
                "Andy   23 days ago Perfect, thank you @Tory Gray I'll keep doing what I have been doing over the last few months, even our \"large\" sites are less than 1000 pages, inc blogs, so mostly in good shape and kept clean...and we never use tags, so messy if done wrong.",
                "Tory Gray   23 days ago 100%. Good luck!! 1"
            ]
        },
        {
            "message_text": "Katie McDonald   2:13 PM Brand / ranking Q 5 replies Last reply 22 days ago",
            "replies": [
                "Katie McDonald   22 days ago Client is big supplier of an age checking software so knife / kitchenware / alcohol companies can use their software on their website to verify the customers age before they buy - helps that company stay legal and not sell to minors. Terms they want to rank for are often age verification software for X so for knive retailers- its zero SV. Q is on intent. The SERPs include ppc ads - by software suppliers. Top organic ranking is a snippet - from a knife seller that says we use (client name!) And then the whole page is company pages that talk about their policies.. who use the client and mention the brand name. The 4th listing is my client-but its a blog not rheir landing page. So! Would you optimize for that term anyway, even though the results arent software companies - and go with the idea that people will see all these companies talking about my clients software, and hopefully click on my clients page when it ranks?",
                "Richard Gargan   22 days ago I would personally still optimize for it because as you imply, zero search volume might actually be 10 per month and have some very high intent buyers there I think I would also do lots of internal linking to a head term page age verification software that includes a knives section. Its difficult to beat the likes of G2 for age verification software but can be done with lots of internal and external anchor text rich links 1",
                "Katie McDonald   22 days ago We have pages for each sector. Were sixth for age verification software- the home page ranking. 1",
                "Jonas Sickler   22 days ago Thats a tough one. Google doesnt seem to understand the query. Its interpreting it as why do i need to verify my age to buy a knife, and folks are probably buying paid ads on the terms age verification and verify age regardless of the intent. Id check out GSC to see what terms the customer is getting impressions for that align with age verification system, software, laws, rules, regulations, platform, etc for knife cutlery retailers. If you see any terms that might align, you could publish content about it. Id probably lean to an informational page, and then run Google Dynamic Search Ads (DSA) to that page rather than the homepage since its more aligned with the intent. Whats the topic cluster look like? there are so many related queries at the top of the funnel to dive into before folks start to consider whether they need  age verification systems. For example, in the US, theres a lot of volume around laws: louisiana age verification law (3600 MSV) Age verification requirements (collective MSV 280) 2",
                "Katie McDonald   22 days ago Going to do that and also consider some paid ads as l4l competition is doing this"
            ]
        },
        {
            "message_text": "Adam Humphreys   7:44 PM Does anyone have any resources for copywriting headlines etc? I saw an article referencing a book or something to that effect at one point of a ton of highly converting headlines. I am sending out an email soon and would like to revisit some copywriting resources. I have some good ideas but want to split test. A lot of perfectionism is going on over here. I would love to hit it out of the park ideally. (edited)  7 replies Last reply 17 days ago",
            "replies": [
                "Natasha Post   18 days ago Hubspot usually has tons of articles on headlines: https://blog.hubspot.com/marketing/headline-writing-tips blog.hubspot.com How to Write Better Headlines [Infographic] Want more traffic to your blog? Here are some tips for writing more compelling headlines. (105 kB) https://blog.hubspot.com/marketing/headline-writing-tips",
                "Natasha Post   18 days ago As for copywriting books, not headlines specific, but I'm reading Copywriting Secrets by Jim Edwards and finding it extremely helpful and actionable.",
                "Holly Miller Anderson   18 days ago @Natasha Post didn't Hubspot have a tool to generate titles at one point?",
                "Holly Miller Anderson   18 days ago this may have been it at one point but now they're also using it as an upsell. https://www.hubspot.com/blog-topic-generator hubspot.com Free Blog Ideas Generator by HubSpot (2023) HubSpots free Blog Ideas Generator tool gives you a years worth of blog post ideas in a matter of seconds. Create your own topics and titles now. (75 kB) https://www.hubspot.com/blog-topic-generator",
                "Adam Humphreys   18 days ago In this case the intended purpose is for email. I need high open rate.",
                "Natasha Post   17 days ago @Holly Miller Anderson I feel like they did, but there's also this one: https://www.aminstitute.com/headline/ aminstitute.com Headline Analyzer - Emotional Marketing Value The world's first Headline Analyzer, gives instant rating of the Emotional Marketing Value (EMV) of headlines and subject lines.",
                "Natasha Post   17 days ago @Adam Humphreys You're welcome to toss it at us and we can give our two cents. Tips I know of. - Address the person by name and use the power of one. Meaning make it feel like the email is just for them.  Emoji's tend to help, but don't overdo it. Use regular case, and avoid spam triggers that might toss you in the promotions or spam tab of your list. Part of your open rate is also going to depend on your deliverability rate, so segmenting accordingly always helps. (edited) "
            ]
        },
        {
            "message_text": "Amanda Milligan   8:37 PM Hey all - Im looking to work with some freelancer writers for some potential projects coming up. Anyone have recs for writers with a specialty in finance? (And/or with a journalism background?) 4 replies Last reply 15 days ago",
            "replies": [
                "Matt Stacks   16 days ago Hey @Amanda Milligan , Id love to chat about helping you out. Ive written over 150 articles in the finance space. Feel free to DM me to chat more!",
                "Amanda Milligan   16 days ago Hey Matt - can you DM me your resume and writing samples? 1",
                "Daniel McCue   15 days ago @Amanda Milligan , Ive worked in the insurance space for more than a decade. Will send some samples via dm.",
                "Amanda Milligan   15 days ago @Daniel McCue great thanks!"
            ]
        },
        {
            "message_text": "Hannah Smith   10:09 PM == UPDATE: TICKETS HAVE NOW BEEN ALLOCATED & WINNERS NOTIFIED VIA DM. == *LAST MINUTE GIVEAWAY* Hello there, @Britt Klontz & I have now closed ticket sales for our live cohort Digital PR Pitch Writing course, but we've a few tickets left which we'd like to give away! Here's what you need to know: Throughout the course attendees will be guided step-by-step through the PR pitching process Britt and Hannah personally use; theyll suggest a range of exercises attendees might like to complete between sessions, plus there will be plenty of time for Q&A each week. This live, cohort-based training course will run over a four-week period, with a 90 minute workshop session delivered over Zoom each week. These are the dates: - Week One: October 10th 2023, 5pm-6:30pm (UK) - Week Two: October 17th 2023, 5pm-6:30pm (UK) - Week Three: October 24th 2023, 5pm-6:30pm (UK) - Week Four: October 31st 2023, 5pm-6:30pm (UK) Full course details are here: https://worderist.com/live-workshops/pr-pitch-writing-live-workshop-series/ == Please only put your name forward if you can make all the sessions! To apply, just DM me your full name, job title, company name, and email. I'll announce the winners & assign the tickets at 12pm (UK time) Thursday 5th October (that's tomorrow). (edited)  Worderist PR Pitch Writing: Live Workshop Series Learn how to come up with Digital PR ideas that generate top-tier media coverage. Four live sessions delivered over Zoom, beginning May 3rd 2023. Sep 2nd",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Adam Humphreys   1:37 AM https://www.seerinteractive.com/insights/ai-vs-human-written-metadata?utm_campaign=Brand%20%7C%20Community%20-%20Weekly%20Newsletter&utm_medium=email&_hsmi=276819412&_hsenc=p2ANqtz-9ROF8SSbLmtNwmSIntbhqcu18E8s9u4OR_G3Lup2iwWQzv4ge6bw3Utcauyt7Sidd38GykHh-weYEC6Dq2u8J5jPDbJg&utm_content=276819411&utm_source=hs_email#TLDR predictable seerinteractive.com AI vs Human Written Meta Descriptions: Which Leads to Higher CTRs? Considering using ChatGPT for metadata optimization? Check out our test between ChatGPT-4 & manual metadata to find the efficiency and performance of each. (297 kB) https://www.seerinteractive.com/insights/ai-vs-human-written-metadata?utm_campaign=Brand%20%7C%20Community%20-%20Weekly%20Newsletter&utm_medium=email&_hsmi=276819412&_hsenc=p2ANqtz-9ROF8SSbLmtNwmSIntbhqcu18E8s9u4OR_G3Lup2iwWQzv4ge6bw3Utcauyt7Sidd38GykHh-weYEC6Dq2u8J5jPDbJg&utm_content=276819411&utm_source=hs_email#TLDR 3 1 1 1 +3 21 replies Last reply 14 days ago",
            "replies": [
                "Rick   16 days ago Super important takeaway here... 2023-10-04_14-43-18.png  3",
                "Abby Leigh Curtis   16 days ago I love this",
                "Micah Fisher-Kirshner   16 days ago Needs a GPT written, human edited group to test",
                "Adam Humphreys   16 days ago Micah, I have heard people say that theyve been successful with this method.",
                "Micah Fisher-Kirshner   16 days ago Yeah, plus I'd add more than just one style to prompt a Meta Description for a test. May be that the prompt sucks too. (edited) ",
                "Adam Humphreys   16 days ago Have you been successful with hybrid?",
                "Micah Fisher-Kirshner   16 days ago I'm looking at on the phone on train, so may have missed this, but did it say they checked to make sure the Meta descriptions were used on Google (or caveated it?) Also the initial groups CTR weren't similar, so would suggest getting to find similar CTR groups (edited) ",
                "Micah Fisher-Kirshner   16 days ago @Adam Humphreys I've not done gpt written human edited for Meta descriptions tbh yet. But articles? Yeah, even got featured snippets on some with testing (not purposefully). (edited) ",
                "Adam Humphreys   16 days ago I know an agency that does this with no human moderation lol. I wont name who they are but it beats nothing I guess.",
                "Micah Fisher-Kirshner   16 days ago Heh, definitely wouldnt risk that. Too many inaccuracies too",
                "Adam Humphreys   16 days ago lol python people get confident 1",
                "Mika Lepist   15 days ago Am I the only one that is surprised by the 19.1 min/page for meta descriptions for human written? 3",
                "Seppo Puusa   15 days ago Was going to say the same thing as @Mika Lepist most of us probably dont spend 20 minutes writing a meta description, so that has to be taken into account when reading the results.",
                "Noah   14 days ago I used to template descriptions en masse and customize if it made sense.",
                "Mika Lepist   14 days ago That's basically what I start from if they aren't decent already. Google is extracting their own anyway. Was looking back through the link and the large variance of CTRs in the test groups also raise questions. 1",
                "Paul Baterina   14 days ago I want to run this test with REVOLVE. Our current meta descriptions suck. You can look for it yourself. Lol. Maybe do 500 AI vs 500 human written. Specifically PLP or PDP pages, all with similar positions/impressions/CTR. Then run the test there. May need to use seotesting.com or something as well or just work with my business intelligence team internally. 1 1",
                "Mika Lepist   14 days ago A more transparent, larger and apples to apples test would be great. Would be nice to see as well how many of those get overridden by Google also.",
                "Paul Baterina   14 days ago Alright. I'm going to do it. I'll let you know how it goes!",
                "Paul Baterina   14 days ago May need a couple weeks to set this up, figuring out various types of prompts. And then run the test for a bit (maybe 2-3 months).",
                "Mika Lepist   14 days ago Can't wait to find out. That will be awesome info to have and a few months of data should help with any question about algo updates unless they keep rapid firing like they have been.",
                "Paul Baterina   14 days ago Yep. I got you! (edited)  1"
            ]
        },
        {
            "message_text": "Mika Lepist   8:57 PM How do you deal with content that gets flagged as inappropriate or derogatory but actually isn't? Case: one page on an automotive site uses the word \"retard\" in respect to the timing of engine ignition. For those not familiar, this is the appropriate term and nothing to do with being derogatory. Advance vs Retard are actions for fuel ignition timing in an engine. 8 replies Last reply 14 days ago",
            "replies": [
                "Kyle   14 days ago interesting use case! i would consider adding an additional explanation of \"retard\" either in a tool tip or in parenthesis following the word, to provide additional context. 2",
                "Mika Lepist   14 days ago Good idea.",
                "Mika Lepist   14 days ago I didn't think to check Bard, but that's been something I have been occasionally on things because I have a theory that it helps to provide insight into Google's automated systems in some cases. Here's what it says: IMG_4398  ",
                "Kyle   14 days ago that response is what i would have expected and hoped for in terms of the assessment of the word; however, in your application, there's a direct industrial use that is quite different than the global understanding (hence why i thought the additional context may help circumvent the inappropriate classification ).",
                "Kyle   14 days ago would love to hear how you proceed on addressing this and what the potential outcome ends up being!",
                "Mika Lepist   14 days ago It was UGC on a large site that wasn't getting any traffic to that page so they nuked it. I may try and see if we can bring it back to test. Would be good to know, since that could be something faced again since there are plenty of other uses of that on the site.",
                "Kyle   14 days ago Oh, interesting!",
                "Katie McDonald   14 days ago Yeah Id re read the page -if it was that word causing the problem id reconsider"
            ]
        },
        {
            "message_text": "Katie McDonald   11:13 PM Question about Helpful Content / what google understands 4 replies Last reply 14 days ago",
            "replies": [
                "Katie McDonald   14 days ago Were competing with these  for Campervan hire Canada https://indiecampers.co.uk/campervan-hire/canada https://freedomdestinations.co.uk/canada/motorhomes https://www.autoeurope.co.uk/campervan-hire-canada/ Were going to make our content more local with tables of popular destinations and info about each, and then table of local depots. But the big thing is weve added an interactive map to the top of the page with the heading plan your Canada adventure so its a map of Canada with icons of the popular attractions (with links to resources, whats available there, when its open and nearest spot) and then also pins of the depots and info about them. Its going live next week.. but my question is this. Because its not a standard copy change, is Google still clever enough to understand that map, and hopefully reward us for being helpful? Ps a lot of the content on our existing page is quite generic content about Canada and then how to book and weve struggled to get to top of page 1 ..",
                "Mika Lepist   14 days ago You're adding copy in tables, and Google can render JS plus any POI data from map points depending how those are included, so it sounds like an overall improvement to the generic copy of the page.",
                "Katie McDonald   14 days ago No other competitor in the top 3 that I can see has a tool where people can click around and choose the attractions to visit etc and find their local depots etc.. Im just baffled as to why not.",
                "Mika Lepist   14 days ago Probably purely focused on conversion metrics. Plus, dev and content priority to implement and maintain."
            ]
        },
        {
            "message_text": "Jason William Fisher   7:48 PM Read this from Barry Adams, a recent guest on our Voices of Search podcast. Really insightful. If you work for (or have a client) in the news business, this is worth a read about breaking news content and how one might want to attack posting content in that arena for better SEO. https://www.seoforgooglenews.com/p/optimise-for-first-crawl seoforgooglenews.com Why Articles Should Be Optimised Before Publishing One of Google's quirks means that once an article has been crawled and indexed, any changes won't necessarily be picked up by Google until it's too late. (50 kB) https://www.seoforgooglenews.com/p/optimise-for-first-crawl 3 7 replies Last reply 9 days ago",
            "replies": [
                "Jonas Sickler   12 days ago Nice article Jason, thanks for sharing. Barry definitely knows his news SEO. Also, I just noticed you had Jeff Coyle on your podcast in Sept. Ill have to listen to that one. I always learn something new from him!",
                "Jason William Fisher   12 days ago Yeah... Barry is a beast. And LMK about Jeff's pod episode. I have not listened to that one yet. And... perhaps you want to be on the podcast (if you've never been). I can connect you w Tyson. LMK 1",
                "Jonas Sickler   12 days ago It would be an honor to be a guest! DM me and lets make the connection  1",
                "Jonas Sickler   11 days ago PS - the Coyle episode was great. Excellent way to end it: In the end, Google will have to take a heavy hand against anyone pretending to be what theyre not. There are so many ways we can use AI to help with content publication. I think its less about drafting infinite content, and more about understanding audiences, keeping content up to date, ensuring coverage of all the questions folks have, and giving audiences the best experience we can in their moments of need. 1",
                "Alex Moss   10 days ago All hail Barry",
                "Kavi Kardos   9 days ago I love Barry Adams for news stuff! Ive been reading a ton of him for a new client",
                "Jason William Fisher   9 days ago Love it!"
            ]
        },
        {
            "message_text": "Marie   8:28 PM Question about long-form content on a category page: does it make sense to have 2 or 3K words on a category page with links to subcategories? If yes, how to make it user-friendly? +1 39 replies Last reply 3 days ago",
            "replies": [
                "Paul Baterina   10 days ago I don't think the # of words matter. What I'd be more concerned about, assuming these pages are ranking already and have revenue - is to make sure that if you do add the content, run an a/b test see if you lose cvr or any other KPI's. Will the content be at the top or the bottom? If it's at the top then there's that possibility that conversions get negatively impacted or users didn't like what they wanted (presumptions here, as we have to see the data) so they bounced. Now there's also the question of, well if you add X amount of content with proper internal links, did you see an uplift in traffic and kw positions to offset drop of cvr (assuming)? In terms of \"how to make it user-friendly\" I remember seeing quiksilver, using some form of expanded dropdown of additional content. I remember discussing with the head of SEO, and he said that Google was able to read it. 1 1",
                "Paul Baterina   10 days ago Here. You can see the \"read more\" expandable option. https://www.quiksilver.com/mens/ 2 files  quiksilver.com Men's - Shop The Full Collection Discover our Men&#039;s Collection. Shop Online at Quiksilver Official Store. Free Shipping & Free Returns For Members (12 kB) https://www.quiksilver.com/mens/ 1",
                "Brian   10 days ago Agreed ^ re: number of words don't matter. Focus more on whether a user would find value in any words or not and then write to fulfill their intent rather than for SEO purposes. What are the main questions that a user would have when landing on that page? How can you help them in their journey?",
                "Marie   10 days ago I was thinking about repurposing an article with 3k words. This article will become the main category hence the question. Thanks for the ideas. An expanded dropdown or an faq at the bottom of the page can do the job (hopefully google is able to read what is inside the tabs)",
                "Mika Lepist   10 days ago Does the article rank better than the category page and if so Is the intent behind this to change that? Or are you just trying to beef up content on the category page and instead of writing new, using what you have?",
                "Brian   10 days ago Re: (hopefully google is able to read what is inside the tabs) - make sure that the content/answers are available in the rendered DOM on mobile without click. You can ensure this by using Google's URL inspection tool in GSC and/or Google's rich result testing tool. These tools will show you the rendered HTML as seen by Googlebot mobile.",
                "Kane Jamison   10 days ago Having a structured page of content that serves to link all of the sub-pages in that category makes sense. But unlikely that putting a long form article above a list of links is a good experience - you hve to do the work to integrate linking into the content, break up subpages into subsets of links, etc. That probably means having a custom page template on most CMSs to override the default archive page template. Sometimes it is simpler to launch it as a separate hub pages and canonicalize/redirect the archive page over to that URL. EG you launch a /widgets/ hubpage, and redirect the /category/widgets/ page over to that custom page where you have easier control over the format and styling. (edited) ",
                "Marie   10 days ago @Mika Lepist the category does not exist but will target the exact same keyword. That's why, I thought about using the content of the article instead of creating content targeting the same queries (edited) ",
                "Marie   10 days ago @Brian on mobile, Gbots don't read what is inside tabs?",
                "Marie   10 days ago @Kane Jamison of course the content won't be above the list of links but at the bottom of the page as FAQ for instance",
                "Brian   10 days ago No, they can depending on how its implemented. Must be available without click in the rendered DOM @Marie 1",
                "Mika Lepist   10 days ago Maybe a dumb question, but how many products would be on that category page total? If we're talking just a few and you don't see that increasing then I might approach it very differently than a larger ecom site.",
                "Seppo Puusa   9 days ago I would be vary of adding a lot of article style content on ecommerce pages. Google likely has some classifier that categorises pages into something like ecommerce listing page, ecommerce product page, long form article page, short answer page, video, etc. Adding a lot of content could cause the page to be classified into wrong category and tank ecommerce rankings.",
                "Seppo Puusa   9 days ago Some searches have multiple intents and it makes sense to target all of the relevant intents with different pages. This is often true for shorter ecommerce category searches where the user can be looking for product listings or recommendations and short listings. If thats the case here, I would consider keeping the article and category pages separate and just linking them together. the category does not exist but will target the exact same keyword. Thats why, I thought about using the content of the article instead of creating content targeting the same queries",
                "Marie   9 days ago @Seppo Puusa it is not an ecommerce but lead gen style",
                "Marie   9 days ago @Mika Lepist not an ecommerce but a website to generate leads. But if a category for a lead gen has 5 pages in it, what would be your advice?",
                "Mika Lepist   9 days ago Maybe it was that quicksilver link, but my mind was in ecom. Can you give some context as to what industry or a similar one to help me visualize it better? How many pages on the site overall?",
                "Paul Baterina   9 days ago Damnit. My mind was in ecom too. LOL.",
                "Paul Baterina   9 days ago Time to remove the quiksilver link 1",
                "Marie   9 days ago @Paul Baterina nooo don't remove the link",
                "Seppo Puusa   9 days ago We can all blame @Paul Baterina for leading us down the wrong path",
                "Paul Baterina   9 days ago I'm sorry guys . Drinks on me for the first 10 rounds. 2",
                "Marie   9 days ago @Mika Lepist real estate industry. Specific niche in real estate. For now, there are 160 pages but the plan is to grow",
                "Mika Lepist   9 days ago So if this content does well, why not leave it and create the category with a different or broader term?",
                "Marie   9 days ago The article already targets the broader term but does not perform hell. Hence the idea to build a sort of \"hub\" with the category page supported by different blog posts",
                "Brian   9 days ago When looking at that term, what types of pages rank well already in G search?",
                "Brian   9 days ago (what types of competitor pages?) 1",
                "Mika Lepist   9 days ago To add to what Brian said - articles or other types of pages in the top 10",
                "Mika Lepist   9 days ago % wise. So if they're all or a majority articles vs the idea or a category page or landing pages 1",
                "Marie   8 days ago Thank you guys, will check that out later and keep you updated.",
                "Marie   8 days ago By the way, another question: if I want to add a module on my home page with some temporary news that I can delete later when they are outdated (all the info will be in the module so no new page will be created) and push the newest news. What's the best way to approach this without hurting SEO? Can I just change the info in the module whenever I want because at the end of the day, it's not a page?",
                "Mika Lepist   8 days ago What does this module look like, from a technical perspective? Links to reputable external sources? Links to internal news?",
                "Mika Lepist   8 days ago Meant to say \"technical and content\" perspective... ex: is it JS parsing an RSS feed linking externally, or is it internal news links.",
                "Marie   7 days ago @Brian do you have an example of a website using accordions on mobile version like you suggested?",
                "Brian   7 days ago @Marie yeah here's an example where both the questions and answers are visible in the rendered DOM without click/without interacting with the accordions image.png  1",
                "Marie   4 days ago @Mika Lepist the module will not contain external or internal links. The module will only appear when there is an interesting short news related to the industry to share with users then will be deactivated when there is none",
                "Marie   3 days ago @Mika Lepist based on what I said yesterday, I don't think having this module when there are short news to share and off when there aren't could have negative impacts SEO wise. What's your opinion?",
                "Mika Lepist   3 days ago I guess it depends on implementation and how much additional text it adds to the page if that is a factor - ex: very light content page and this adds a relative substantial amount vs a very content heavy page and this is negligible. (edited) ",
                "Marie   3 days ago It will be negligible"
            ]
        },
        {
            "message_text": "Jordana Abitbol   8:22 PM I had a client ask if theres a way to create dynamic content based off the users search term. Does anyone here have experience with dynamic content and if so is this possible? I think unberflip does this but havent used them before. Sounds a bit like programmatic seo but dont have experience in that myself. 5 replies Last reply 6 days ago",
            "replies": [
                "Jared McKiernan   7 days ago Not for organic SEO, because how would you know what the user's search term was?",
                "Jordana Abitbol   7 days ago Thanks Jared, what about the search queries report, they are being tracked there and GA4 search terms report -but it rarely shows results there",
                "Jared McKiernan   7 days ago That's only from paid search - this is why sometimes you see sites do this for paid landing pages.",
                "Jordana Abitbol   7 days ago Gotcha, thank you Jared!",
                "Fred Newtz   6 days ago I mean if you took that dynamically generated content and put it into a static cache and worked from there it might be one thing for potential future SEO purposes, but definitely paid search is the only real relevant answer here."
            ]
        },
        {
            "message_text": "Alejandro Crdenas Chapelln   4:39 PM Hi guys! We're creating some \"location\" landing pages following the same template for all of them. We change the tags, headings,  change the name of the city when mentioned throughout the body (4-5 times), and then we have specific FAQs for each location where we answer Qs closely related to the city. Do you guys think that would be enough or would Google see that as \"duplicated content\"? Thanks in advance 3 replies Last reply 1 day ago",
            "replies": [
                "Abby Leigh Curtis   1 day ago This is a year old, but...https://searchengineland.com/location-pages-google-october-spam-update-390016 Search Engine Land Location pages in Google's crosshairs after October spam update Ranking drops and deindexed pages are plaguing service area business sites. Let's explore the potential cause and what local SEOs can do. Written by Jake Hundley Est. reading time 8 minutes Dec 6th, 2022",
                "Alejandro Crdenas Chapelln   1 day ago Thanks Abby! Pretty helpful",
                "Abby Leigh Curtis   1 day ago it's a tough issue to navigate, but I used to tell my clients there are a few ways to approach, including having an FAQ page that has a section for each location, having a \"locations\" page with sections for each location, etc."
            ]
        },
        {
            "message_text": "Abby Leigh Curtis   7:04 PM We're working through some of our wonkiest subfolders and page groups and are stuck at a crossroads. We have SEVERAL pages about supplements that don't really perform, but are still important to inform our readers on. Would we be better off leaving them as is (for now, until we have bandwidth to truly optimize them) or folding them into the supplements category page? 1 reply 1 day ago",
            "replies": [
                "Adam Humphreys   1 day ago If its of use and benefit to the users then integrate it into the category page. Then make a point of improving it when you have time. Its all about the end user right? 1 2"
            ]
        }
    ]
}