{
    "messages": [
        {
            "message_text": "Carla Basset   9:41 AM replied to a thread: Hi everyone :) As I don't have someone to talk about this, I thought I'd give it a try here. I'm an in-house SEO and responsible for six different brands/websites in three countries. I have been doing this for the past three years and I just constantly have the feeling that I haven't been able to get forward. I know that I'm quite new to this field, but am I just too new to get it all done quicker and better? Or is this something that really can't be done by one person? Do you have any tips for a working routine? How does a day for an experienced SEO look like? Wow thanks for all the great answers !!    Love it! 5",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Eric Wu   10:39 AM Im curious the type of SEO reporting folks are being asked to do in-house Are you asked to report weekly or monthly? Aside from aligning reports to business objectives like revenue, is there expectation to align to OKRs? Are you also asked to make quarterly projections? +2 7 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago weekly, monthly, quarterly Yes, but weve struggled with getting clarity on Os and KRs that can be effectively measured, relative to SEO they/we do yearlong forecasting 1",
                "Valentin Pletzer   3 months ago Im also responsible for the analytics/bi and data team. Im trying to have all (important) data in dashboards available on demand. The editors are looking at the data of the previous day, other teams have longer cycles. We do OKR and we do align with our company goals but growing our organic reach is something that we (a news publisher) are always aiming for. we are projecting the upcoming year at the end of the year. This is what we call the plan. We do re-forecasts three to four times a year. 1",
                "Victor M Pan   3 months ago I keep a weekly pulse. We do a monthly report. We do a bi-annual reassessment, forecasts are often in them, and they are annual forecasts broken down by month. Rev per customer fluctuates a bit so we do signups and leads. Rev per customer based on segmentations gets calculated at least once a year - sooner for some launches given our multi-tier saas situation. Re: OKR yeah we re do something called OGP which is the equivalent but more long term (think 5 year) - priorities and resource get shifted based in alignment and cross team impact to be worked out by managers. So imagine how AI mayve shifted a lot of planning. (edited)  2",
                "Rajeev Lekhwar   3 months ago Weekly, monthly, and quarterly! (And sometimes I find myself looking at the nos. daily when something I desperately wanted gets implemented, lollll). Yes, we focus on OKR a lot, it helps in identifying the right optimization opportunities and prioritizing them. Not quarterly but annual projections, it is based on the recommendations I give wrt their impact on the system. 2",
                "Abby Leigh Curtis   3 months ago Weekly traffic updates (dumb) and monthly analytics updates The priority is traffic recovery right now, so no They have been asking for forecasting but our wild fluctuations in historical data due to a site migration makes it very muddy (edited) 1 2",
                "Nam Le   3 months ago I keep an eye on weekly traffic and provide a biweekly/monthly update to exec (performance + initiative progress). OKRs are mostly to stay on track with initiatives and quarterly planning. No formal forecasting except the general expectation of 60-70% QoQ growth from leadership 1",
                "Kal Dimitrov   3 months ago We have all of that on the side but it's nothing formal. Recently I've been into the following method of measuring work - https://newsletter.seomba.com/p/input-metrics-for-seo. Worth checking it out! newsletter.seomba.com Input Metrics for SEO How to use input metrics to get buy-in and investment for your SEO program (32 kB) https://newsletter.seomba.com/p/input-metrics-for-seo 1"
            ]
        },
        {
            "message_text": "Kyle   4:42 PM Has anyone else worked in-house in a niche where the struggles to drive growth due to volatility in consumer demand? If so, how did you handle that re: comms with leadership, forecasting & goals, etc.? +2 11 replies Last reply 3 months ago",
            "replies": [
                "Valentin Pletzer   3 months ago Im working in-house in news/publishing. We have both: daily volatility and seasonal changes in demand. The best you can do is to be as transparent as possible. Also: Try to communicate as simple as possible but have the detailed data available in a moments notice.",
                "Andrew Prince   3 months ago Track competitive market share with something like SERP visibility. If able, build out a total addressable market (TAM) and work towards that. Those are 10,000 foot view metrics that share the overall markets performance and your sites place within it.  (edited) ",
                "Victor M Pan   3 months ago What Andrew said. Why were down. How were doing compared to (thing they care) and what we plan to do. Sometimes its timely events outside your control. Sharing whats out of your control and what is, if given more resources, is how we go about fixing a crisis 1",
                "Kyle   3 months ago Thanks @Valentin Pletzer @Andrew Prince @Victor M Pan ! I worked in publishing too @Valentin Pletzer - luckily it was in niches that were more evergreen in nature. I think what Im struggling with now in the health niche is that I lack the resources to properly do what youve all suggested (Ive tried). Were a local marketplace where position and opportunity vary at the city and neighborhood/borough levels for the same query. To track at that level, you need explicit tracking (think nozzle or an in-house tool using dataforSEO, valueserp, or something similar). I have that now but only got it recently and its a narrow view of TAM and % visibility/share against comps. In our space Covid has fueled traffic for so long, then it went away and 20-30% of normal traffic went away because of it as well (aka sick care). Category expansion is a clear avenue for growth, but thats already owned and planned by other teams. So what Im challenged with is how to communicate this effectivelyin the absence of respected dataand what to do to grow (as were way off of forecast) since consumer demand has gone away.",
                "Victor M Pan   3 months ago Can you create an index instead of a TAM?",
                "Victor M Pan   3 months ago So theres the S&P500 for stocks - create your own S&P for local keywords",
                "Victor M Pan   3 months ago If youre a mission-driven company (HubSpot is) we use first principles reasoning and company values in the absence of data for change. The dumbest method (and probably all you need) is Google trends to show different categories that benefited and busted from Covid-19 demand.",
                "Victor M Pan   3 months ago So yeah personally Id run all 3 methods with an ally in the org to see which primary method will lead to change. I think a strong narrative for change is more important than getting data youve noted you dont have. My votes on the trends data for its simplicity - with its shortcomings heavily annotated in an appendix - and improvements would be, as you noted, building out better rank tracking processes that are essential to execution and prioritization. A quote I like: If you have 100% data certainty on something, youre moving too slow. 2",
                "Natan Gesher   3 months ago Has anyone else worked in-house in a niche where the struggles to drive growth due to volatility in consumer demand? Grubhub was like this. Food delivery is quite volatile, with a huge percentage of demand driven just by the weather!   Everything came down to executives' maturity level, which did vary by person and over time, but at that company was generally very good. Unfortunately I believe that maturity can not be taught, only learned - though it can be learned the easy way or the hard way. My impression was that they learned it the hard way with some other SEO leads in the past, and I got to benefit from those struggles. I do very strongly agree with the competitive market share / share of SERP / percentage of voice type metrics. 1 2",
                "Shawn   3 months ago Im in legal tech - we basically scrape courthouses for cases, documents, rulings, etc. and aggregate them to make it easier for lawyers/clerks to get them. The volatility is crazy and still havent quite figured out how to generate growth.",
                "Peter Ebbinghaus   3 months ago Transparency and using low-demand seasons for upper-funnel content optimization."
            ]
        },
        {
            "message_text": "Victor M Pan   12:42 AM Poor mana polly - are you in the marketing org or product org (comment if something else)? Marketing  Product :party_blob: Something else (leave in comments) 14 :party_blob: 9 1 5 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago under VP of product on the consumer marketing team. Weird mix of being in marketing but unofficially working as a PM 2",
                "Nam Le   3 months ago Not one size fits all but from what I have seen, B2B/Content-heavy SEO is mostly under Marketing, while B2C/Marketplace/Ecommerce SEO is often under Product (with the addition of SEO Product work) 1",
                "Cillian BC   3 months ago In marketing but sit under the COO. We are B2B so it aligns with like Nam said above",
                "Patrick Stox   3 months ago Both.",
                "Emily Brady   3 months ago I'm in marketing under the co-founder (startup) - but in past in-house roles i've been on the marketing side, and more often growth than product marketing."
            ]
        },
        {
            "message_text": "Josh Green   9:33 PM As an in-house SEO the biggest struggle I have is to become almost embedded with the engineers/developers. Occasionally opening up that communications channel is more than difficult. What strategies and tools do you use to communicate with the devs? How did you get them to open the door to collaboration and shared info exchanges? +1 13 replies Last reply 3 months ago",
            "replies": [
                "Shawn   3 months ago I worked to build relationships with the managers/directors. Helped them understand the overlaps between engineering and SEO. Asked to be invited to their meetings, especially sprint planning to help answer any questions they have. Of course this was all pre-pandemic when we were in the office so it was easier to walk over to a desk. Today, between Jira, Slack, and Notion that is how I communicate with the engineers - but I still formed a relationship with the CTO and am part of sprint planning.",
                "Boris Kuslitskiy (he/him)   3 months ago You need to speak their language and present things in ways that match their needs/desires. Assuming they're using agile/scrum, match the scope of your requests with their sprints and give them what they need to do sprint planning. Be available for questions. Publicly give them praise when they do something awesome. Compromise to not squeeze out every ounce of seo value if it's significantly extra dev work. Adjust prioritization if the devs like working on something. Devs are people, be nice to them and make small talk (as appropriate for the culture). Present requests with as much info as you can to cut down on follow up questions. Do not let exasperation show when the follow up questions sound dumb to you.",
                "Victor M Pan   3 months ago Strategy: Solve problems together. Tactics: Set SEO requirements as if the user is a search engine. Let the developers propose solutions to the user requirements (search engine) Tactics: kickoff and postmortem meetings. Tactics: communicate the impact early in the project and afterwards. Remember to share charts of shared wins when performance review season comes along or even drop a Linkedin recommendation. 4",
                "Victor M Pan   3 months ago Sometimes the doors arent open and you need to put keyword alerts and join channels.",
                "Boris Kuslitskiy (he/him)   3 months ago That last bit is key. Give them something to take credit for when review season rolls into view.",
                "Victor M Pan   3 months ago Yeah a big expensive kickoff meeting is necessary if its been rough previously",
                "Shawn   3 months ago Solid - yeah, one of the things I learned recently from a buddy of mine thats a president of his org was that you need to help them understand how it helps them be successful - and also praise them a lot - especially when there are huge wins.",
                "Shawn   3 months ago I was struggling at my last role to get buy-in on a project. After he walked me through that, I was able to tie the work back into helping them out (reduce his resources moving forward, etc.) and it was amazing how quickly they jumped in and were excited about working with me 1",
                "Victor M Pan   3 months ago Ways to scale: Office hours 2.   Decision documents and rationale 3.   Written/Video recordings of yourself you can reuse. Eg I have things in core web vitals, mobile-friendliness, dynamic rendering, canonicalization and dynamic rendering",
                "Victor M Pan   3 months ago Theres what Google says, then theres how that applies based on your companys tech stack",
                "Kal Dimitrov   3 months ago We build the roadmap together with the product manager (SEO, PM, senior dev together). Other people also join on those meetings, so there's proper communication. In order to get to this level, me and the co-founder that was on the side of marketing team (the two of us at the time), thought we needed to play to our strengths - which is basically, a great dev team that can do a lot of programmatic stuff in terms of page creation. 3-4 years ago (beginning of SEO in our company), we did one or two big dev-heavy projects regarding content (programmatic SEO). This included devs on the content production side, and got them ownership, too. Since then, they saw that SEO works for the business, and that devs can also help with that a lot. Now we have dedicated days from devs time for specific SEO projects (one is speed and technical fixes, the other is programmatic SEO). Plus several smaller-scale activities. It is a process, it doesn't happen overnight. It started with a buy-in for a project that plays on their strengths, which brought traffic and subscriptions. They saw their work matters on all levels (including marketing), and we did more and more of it over time. (edited)  2",
                "Peter Ebbinghaus   3 months ago Great points already made here. Are there some tasks that they tend to do more likely than others? In the past it's helped to discover patterns, lean into those they are open to and then expand by explaining and showing the precise benefits (clicks, revenue uplift, position, schema in SERPs or whatnot). Once they feel like their work has an impact they might even come to you to help them lobby for their ideas as you might be closer to more general decision makers. (edited) ",
                "Craig Harkins   3 months ago Get meetings with anyone who controls priorities and the backlog that gets worked on. Talk to those product managers and marketers and learn about their goals and metrics to find where SEO fits in. Im fortunate to be in product in an org where SEO is valued but even then the resources are limited. I talk to the product managers and try to bake SEO into their work. I also talk to the developers a lot to share what were trying to accomplish and why. Like @Victor M Pan I share results and send praise - Its great for the team to know what they did was important and that gives them a positive to working on SEO stories. 4"
            ]
        },
        {
            "message_text": "Christopher Levy   1:19 AM In 2020 I was in-house at Polaris and every other week they'd bring in an external consultant who essentially would just parrot the latest articles. There wasn't much value, and I never learned anything new -- so I found the whole experience rather off putting. Well, last week I was meeting with an enterprise level fintech through a company that provides training for in-house teams. Their in-house SEO was on the call, and every time she asked me a question (and they were great ones!) her manager (a non-SEO growth marketer) would shut her down saying that it was too technical, too granular, etc. So now I can say that being the external consultant is just as bad. Is this \"normal\" in-house behavior? I would have thought not, but now I've seen it two large, publicly traded corporations as both the in-house SEO and the external SEO consultant. 7 replies Last reply 2 months ago",
            "replies": [
                "Boris Kuslitskiy (he/him)   3 months ago It's definitely annoying having your company pay extra money to bring in consultants who say the same things you've been saying. I've learned to live with it. If management is spending money on them, they'll be more likely to implement their suggestions and, at the end of the day, if the site does better organically, that's good for me.",
                "Emily Brady   3 months ago I've worked at three companies in-house and only one of them paid to have outside help like that. But even then it wasn't positioned as a \"this is training for you\" situation, it was supposed to be \"supplementary work to your strategy.\" So I don't think it's super normal? Redirecting / cutting off questions is definitely not normal in my experience. It sounds like an unskilled manager, but in that situation the boss should be grateful to have someone on the phone who knows to ask about the granular stuff...",
                "Victor M Pan   3 months ago I dont think its normal, but I have seen management by status often and dont love it. Id likely ask who else is in the meeting - eg - if the CEO was in the meeting then technical details need to be simplified - if its a training then details can be broad but specifics would have follow-ups. some teams change the status quo, some dont - around 2020 was covid so Id expect changes to have happened as a result. Did those changes align and work? Sometimes the outside consultant is hired just to add perspective for an expensive decision. Agree the manager likely had a lapse in judgement.",
                "Victor M Pan   3 months ago Agency-side my client had once said we hire you so our competitors dont have access to your ideas and plans - so theres that too. Two years later I sell an SOW with them and we shipped and rank.",
                "Josh Green   3 months ago I had this happen recently. The company hired two outside consultants who backed up literally everything I had proposed. With that said, I find the idea of paying an external consultant when you are paying your internal employee to do the same thing a bit insulting frankly. Multiple reasons but I'll boil them down to two. If you don't trust what your employee is saying why are they an employee? Put it another way, if you don't trust me and the experience I bring, why am I still working for you. Imposter syndrome sucks, I don't need anymore help. If you have the money to pay an external consultant, probably more than you are paying me, why aren't you paying me more? 2",
                "Justin Briggs   3 months ago The cutting-off isn't normal from my experience, but bringing in an outside consultant, even when there is a competent team, seems common. When I've consulted for companies with good in-house teams, it's usually due to a cultural or organizational issue: They need an \"objective\" POV, usually due to internal politics or disagreements. To be a firewall. Let me say the hard truths and/or critique. I take the heat, and in-house SEOs get to protect their relationships. Helpful when something is someone's \"baby\" and a senior leader or an org won't take it well. Broader perspective (access to multiple sites) of SERP trends. Experience with specific strategies (i.e., mergers and acquisitions, launching internationally) or verticals (competitors). To be disruptive, challenge the status quo, fresh take. Easier to get all the leadership to attend a meeting. Dumb, but the price tag helps everyone show up. Especially if I delivered a presentation on-site. When I consulted, I tried to be sensitive to the in-house team's experience and even joke/address the issue. Everyone being aware of the issue helps the in-house team leverage my external status more effectively. Sometimes to move the rock, the idea needs to be on someone else's Powerpoint template. 2",
                "Josh Green   2 months ago I think there is a difference between consultants being brought in via an ask by the SEO team to get experience that isn't present in house/that external throat to choke and one brought in to check the SEO teams work. I have used many specialized contractors/consultants in the past and they work great. I took the question to mean much more the later case where the consultant was being used as a check on the internal SEO without the in-house team requesting it. One point I would make about what you said about he consultant as a firewall, and the in house doesn't want to burn relationships. I have seen instances where there the in house team won't back up up what the consultant said because of those internal politic issues. In a nutshell, if the in house team can't kill the sacred cow themselves, they probably won't be much help to a consultant who says it needs done. This isn't always the case, but I have seen it happen more often than the other way."
            ]
        },
        {
            "message_text": "Peter Ebbinghaus   3:09 PM Hi everyone, how do you handle job titles in-house? Manager vs. Specialist, for example. There doesn't quite seem to be a consent across countries/verticals as well as in-house vs. agencies. Has anyone experience in deviding titles, e.g. by focus, i.e. handling mostly blog content/technicalities vs. e-commerce content/technicalities? Appreciate any input. +1 11 replies Last reply 2 months ago",
            "replies": [
                "Andrew Prince   3 months ago Ive been at a couple enterprise places and its generally analyst - senior analyst - manager - senior manager - director If you break it out by responsibilities, you can give the same title with an appendage. Ex: SEO Specialist, Technical and SEO Specialist, Content The word Manager can be two-fold - either a people manager or a channel manager 1",
                "Peter Ebbinghaus   3 months ago Thanks for your insights, Andrew. Do analysts in your experience work mostly for the SEO team while managers own more cross-department responsibilities incl. implementation of tactics?",
                "Andrew Prince   3 months ago Yeah, for the most part. Analysts research execute while managers cross-communicate and strategize is the easiest way to boil it down. 2",
                "Josh Green   3 months ago Agree with Andrew. We had specialist in there too at one place. Went before analyst in the order, essentially entry level SEOs 1",
                "Victor M Pan   3 months ago Agencies have to inflate titles to be client facing. A manager often does not manage. Inhouse roles have that nuance Andrew shared with manager The terms lead, principle, and level x is also sometimes thrown around in larger enterprises. Sometimes roman numerals are also used. Analyst I, Analyst II, Senior Analyst II, etc. Titles are often tied to finance and salary band plans. If youre stuck on market rates as a manager for X role, the workaround is to invent roles or tiers, or even role creation. 1",
                "Peter Ebbinghaus   3 months ago Thank you, Josh and Victor! I still find it interesting that a Specialist often seems to be an entry-position. Role creation is a good one if done considerately.",
                "Jordan Silton   2 months ago Not sure if you are still looking for role progressions, but here's what I have proposed in the past for companies like Apartments.com, also they may not still use this progression. Individual Contributor: I - SEO Analyst II - SEO Specialist III - SEO Strategist IV- Senior SEO Strategist V - Principal SEO Strategist Manager: I - Team Lead, SEO II - Manager, SEO III - Senior Manager, SEO IV- Director, SEO V - Senior Director, SEO",
                "Peter Ebbinghaus   2 months ago Thanks, Jordan",
                "Peter Ebbinghaus   2 months ago Interesting to see again how a Team Lead sometimes has less responsibility than a manager, and vice versa - depending on the context.",
                "Jordan Silton   2 months ago Team Lead in this context for in house work is more about getting initial management experience with 1-2 employees A manager would usually be expected to have 3-5 individual contributor employees under them 2",
                "Craig Harkins   2 months ago We still have this but worked in the SEO Product Manager title to match in with those individual III to V bands. We retitled a position to a more specific SEO PM title to help us get to the candidates and skill sets we needed. 2"
            ]
        },
        {
            "message_text": "Pinned by Kyle Kyle   9:16 PM Hey all, just for housekeeping in case you didnt see it in #bullhorn, I wanted to cross-post this here for heads up; were going to continue working to keep things clean, safe, and comfortable for everyone in this community, and appreciate everyone doing their part :) https://theseocommunity.slack.com/archives/C05JVB1F207/p1691210679611609 Noah Hey All!  Most other communities and Twitter are negative and mean and have ended up pushing many in our community away from sharing their questions or contributing answers. We are trying to build something new, positive, and safe in the SEO space. Think of it as a big bunch of friends sitting around a campfire. Show more (edited)  Posted in bullhorn | Aug 5th | View message 10",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Josh Green   11:24 PM I'm curious. How many of us in-house SEOs are part of a team of SEOs and how many of us are the lone SEO? <Channeling TikTok>I'll go first. I am part of a team..ish. I am really the only SEO with experience. I am teaching a couple people interested in SEO about it, but they are VERY new into the field. I've been part of a very large in-house team in the past, but been solo for a couple years now. 9+ 29 replies Last reply 2 months ago",
            "replies": [
                "Abby Leigh Curtis   2 months ago I'm the lone ranger, but my boss knows a good deal about SEO.",
                "Tyler Brown   2 months ago Same as Abby. My boss handled SEO internally before I arrived and kept the lights on, but would never claim to be an expert.",
                "Shawn   2 months ago Solo SEO but Im at a startup. Boss has a decent understanding of SEO which helps with getting priorities in sprints. I came from T-Mobile and we had a team of ten there.  (edited) ",
                "Victor M Pan   2 months ago Was semi-lone when I started at HubSpot from being an agency director (aka manager of 4, both paid and organic search) - now I work in Growth and frankly theres now more than a dozen (SEOs and SEO hybrids) of us split between functions and locales. When youre solo or lacking feedback loops, communities like these are truly awesome  (edited) ",
                "Andrew Prince   2 months ago Team",
                "Emily Brady   2 months ago Solo! (I've never been in-house where I was working w/ a team; however, I have worked with very robust content teams that added a lot of seo value)",
                "Benjamn Conde   2 months ago I work for a big SaaS company, but I'm the only one doing it for the Sapnish version of the website. It is hard, specially cause external teams not always understand the difference in the market.",
                "Becky Westmoreland   2 months ago I have been solo a majority of my career. Currently a mighty team of myself and my 2 employees.",
                "Joshua Poole   2 months ago i work for a large SEO agency - 80+ SEOs globally (edited) ",
                "Crystal Ortiz   2 months ago Ive been part of both and right now Im technically solo but I work with a lot of other really smart consultants across a lot of digital channels. Happy to be here for you to lean on when you need to brainstorm or talk shop",
                "Alex Harford   2 months ago I was the lone SEO at both inhouse jobs I've had. At the first job, I was a web dev but moved myself to SEO and thankfully my employers agreed it was a good idea!",
                "Eric Wu   2 months ago Currently: same as Abby and Tyler Solo but manager was handling SEO and is competent but not expert level Previously: The largest in-house team was at Demand Media where we had 10 SEOs Most other places was 2 or 3 SEOs (edited) ",
                "Paul Shapiro   2 months ago Large team. I think SEO is currently 14,at Shopify. Theres also a bunch of SEO-adjacent roles. (edited) ",
                "Paul Baterina   2 months ago SOLO SEO with over 1,200 employees e-commerce. I'm lonely. Been lonely for 7 years now... 1",
                "Zach Hall   2 months ago I am a solo SEO for my accounting firm. It has its pros and cons but I would really like someone to bounce ideas off of. 4",
                "Paul Baterina   2 months ago @Zach Hall that's exactly what I miss. I don't have anyone to bounce ideas with. Maybe my CEO at most.",
                "Shawn   2 months ago yup - thats really the only thing I miss about my TMO days, the team",
                "Josh Green   2 months ago @Zach Hall , @Paul Baterina , & @Shawn thats what this group is for. I know we all have NDAs, which makes things a bit harder, but we all are SEO geeks here. Feel free to ask whatever you need, we all understand any obfuscations that you need to make. 3 1",
                "Shawn   2 months ago totally - super pumped for it for sure. Ive been fortunate to have a couple of smaller groups that I get to bounce ideas on and it does help cause sometimes you get too deep into something that you really need some perspective on",
                "Shawn   2 months ago Even cooler that I got to meet a few of the folks at MozCon this week",
                "Victor M Pan   2 months ago Yeah I felt lonely too at WordStream and Larry (CTO) would just through ideas after ideas to execute. Agency was nice in that it helped get me out of a filter bubble 1",
                "Kyle   2 months ago I get a lot of that @Victor M Pan .",
                "Scott Salter   2 months ago A team. I manage our SEO team - currently 8 of us with 3 vacancies",
                "Kyle   2 months ago Sounds like you should be posting up in #jobs @Scott Salter 1 2 1",
                "Rajeev Lekhwar   2 months ago Lone SEO here",
                "Will   2 months ago A team! 6 seo specific team members, and about 20 editors",
                "Boris Kuslitskiy (he/him)   2 months ago I'm on a team of in-house SEOs, but also I understand the size of the team is likely an outlier because the corp is huge.",
                "Ash Nallawalla   2 months ago I'm the solo SEO in a multinational company, but an SEO agency is also in place. I will be going solo next month to give that a try."
            ]
        },
        {
            "message_text": "Jordan Silton   9:19 PM A close colleague and friend just asked me for a list of the top handful of SEO agency's I'd recommend. That's like asking for the best type of bourbon or wine. How can you pick just one, or even a few? There are so many options and people/firms that are best-in-class for different flavors of SEO. For example, we all know (or should know) that @Andrew Shotland is at the forefront of local SEO for multi-location brands. Who are your go-to agencies for which specialities? 1 +1 9 replies Last reply 2 months ago",
            "replies": [
                "Mark Howser   2 months ago Onely for Technical SEO Screaming Frog for Off-Page SEO Webris for SEO sprints BMG360 for enterprise SEO 1",
                "Mark Howser   2 months ago and me for Ecommerce SEO (shameless plug lol) 1",
                "Becky Westmoreland   2 months ago Lumar's team has been awesome",
                "Pedro Da Silva   2 months ago I would go for Tombras for any national SEO; local SEO (with the focus on landing pages only); and e-commerce. They have won multiple US search awards",
                "Mark Howser   2 months ago Don't you think those search awards are kinda BS though? I've seen agencies that are pretty lackluster win those every year 1",
                "Pedro Da Silva   2 months ago They could, it all depends in how you show the data and pay the fee. However, my time working there was great and they are very innovative and on top of SEO trends.",
                "Jordan Silton   2 months ago Ive worked with Bartosz and team at Onely and can validate they know what they are doing for technical SEO. Their rates are also reasonable for the states, or were, due to their location",
                "Craig Harkins   2 months ago Location3 and LocalSEO Guide have been good for local. Ive worked with Merkle - on the expensive side but they bring end to end brand to SEO to the mix. There are some contacts that have hung up their own shingle and do a great job without the typical agency overhead. 1",
                "Tess Voecks   2 months ago Shameless plug for Local SEO Guide. It's true that we crush local SEO, but we also do enterprise and e-comm too!"
            ]
        },
        {
            "message_text": "Victor M Pan   2:42 AM Algo updates here. What happens in your org Whenever this predictably happens? +2 7 replies Last reply 2 months ago",
            "replies": [
                "Sophie Brannon   2 months ago The team send each other little emojis and we rideeee the wave. Very fortunate to have a lot of SEO understanding at the top so nobody panics 3 1",
                "Tree   2 months ago We recently subscribed to this RSS feed and push into Slack: https://status.search.google.com/incidents/nBtYtBeex4GYBbdDS2LX 1",
                "Daniel Zuccon   2 months ago what's the easiest way to push RSS to Slack @Tree ?",
                "Valentin Pletzer   2 months ago We also subscribed to the RSS feed via a Slack app called RSS As a director responsible for several domains I just wrote an info-mail to management and interested parties. Our SEO-team, who monitors the pages anyways, is taking a second look for the next days but other than that we try to remain calm. Usually some domains go up and others go down so it is always a bag of mixed feelings. 2 1",
                "Craig Harkins   2 months ago I send out an email to leadership with the announcement and any initial/early indications. Then follow up during the update and at the end with what we are seeing. It becomes a part of my weekly updates. My team stays calm and monitors their domains and we look for patterns in which segments moved. 2",
                "Eric Wu   2 months ago I typically wait 2 days for GSC data to catch up, then do an analysis on Click & Impression deviations segmented by: Core page types Branded/non-branded kwds Head terms Fat Tail Long-tail Usually will monitor daily for 1 week, but usually will have a good indicator within 3 days of the reported algo update (assuming there are no holidays that co-occur) 3",
                "Will   2 months ago Report cards start going out on the daily, pre/post Example: Screen Shot 2023-08-23 at 3.21.57 PM.png  "
            ]
        },
        {
            "message_text": "James Churchman   10:58 PM Hey all! Happy Friday. My question isn't necessarily in-house specific, or even SEO-specific, but thought I'd start here! In my current role, I've launched my company's SEO strategy and am an individual contributor on the SEO side of the business. I've been with the company for a bit over a year now, and it's been a great learning experience getting SEO off the ground. Thus far, I've found my biggest obstacle is communicating in a thoughtful and effective way. I believe that I overcomplicate basic concepts, and don't effectively communicate tactics and the overall SEO vision when trying to get other stakeholders at the company- particularly Brand and Product, on board with projects. I'm wondering if this community has any resources I could utilize to start improving my ability to cross-functionally communicate. Thank you in advance! +1 6 replies Last reply 2 months ago",
            "replies": [
                "Jared McKiernan   2 months ago Tom Critchlow's SEO MBA is perfect for this: https://newsletter.seomba.com/ newsletter.seomba.com The SEO MBA | Tom Critchlow | Substack 10,000+ subscribers. SEO x Business. Click to read The SEO MBA, by Tom Critchlow, a Substack publication. (38 kB) https://newsletter.seomba.com/ 1 6 2",
                "neil   2 months ago @James Churchman read back what you wrote there. it's perfectly clear concise communication. we all get exactly what you're driving at. the issue is that the other stakeholders probably don't value or understand SEO as something worthwhile, until it stops working. perhaps they lump it in with the same guy who fixes the printer. i've the exact same doubts about my own communication. i try reading out loud what i've written and see does it scan well. when i work up the courage i will take a communications course where they record you and then analyse your speech for repetition and tics. my partner did this; she said it was agonising to do, but she cleaned up her communication skills. her speech was full of filler words (um, ah, y'know etc), and watching it a back with a comms expert really helped her, her job has a lot of presentation and arguing your own corner 1",
                "Jonas Sickler   2 months ago I totally agree about the value of the SEO MBA course and emails. Its phenomenal for telling the right story to stakeholders in order to get buy in to invest in organic search. Depending on your companys priorities, you may need to reframe the concept of SEO through a broader lens to convince some stakeholders. Reception marketing: meeting consumers in their moment of need (this is the next iteration of permission marketing. This concept might help stakeholders understand why you need SEO. https://martech.org/3-ways-to-maximize-the-power-of-reception-marketing/ Owned asset optimization: This is an asset-first approach to marketing (rather than channel first). It resonates with stakeholders because it prioritizes outcomes like lower CPA, higher lifetime value, stronger brand equity, more control over brand messaging, detailed consumer insights, and lift across all marketing channels. In other words, instead of talking about traffic and rankings, it focuses on business outcomes that drive growth and performance. It still has its roots in SEO, but it expands the value of content created for organic search to other channels. https://terakeet.com/blog/owned-asset-optimization/ (edited) ",
                "Andrew Prince   2 months ago use analogies to connect concepts Do loose forecasting and projections for initiatives so its easier to prioritize share metrics that matter to them - ex: branded search volume trends 3 1",
                "Craig Harkins   2 months ago Agree with the above. Learning how to break down SEO concepts into what matters for your stakeholders is a skill that will pay huge dividends. The SEO MBA course and blog/newsletter breaks things down and provides good examples. Ive found that finding visuals to demonstrate what youre trying to do in your strategy goes a long way. As does aligning your SEO goals to other corporate or department goals around UX, accessibility, brand visibility, etc.",
                "Becky Westmoreland   2 months ago Also - always include how much traffic to revenue generated can happen in an estimated opportunity (with caveats of course)"
            ]
        },
        {
            "message_text": "Bridget Sandine   1:08 AM Hi all! Wondering what everyone uses for visibility monitoring tool these days? Our current KW ranking tools aren't cutting it. Is there anything out there that's great for enterprise businesses that report on daily monitoring, for several markets and engines that's not a bazillion $$$$? +2 8 replies Last reply 2 months ago",
            "replies": [
                "Jared McKiernan   2 months ago Traject Data is the most cost-effective version of this i've seen (though daily might get a bit spendy). 3",
                "Ash Nallawalla   2 months ago My employer chose BrightEdge. Pricing depends on the number of domains. Its metric is called Share of Voice and compares your keyword set against those of your competitors and also against market competitors.",
                "Eric Wu   2 months ago @Jared McKiernan I never heard of Traject Data. I just went to their site and it looks kind of sketchy They have 3 different SERP APIs that do nearly the same thing but at 3 different price points and each is its own website? Which API do you all use?",
                "Jared McKiernan   2 months ago Thatd be the SERP API, it was originally the Authority Labs product. The company in general has acquired a bunch of overlapping products  2 1",
                "Geoff   2 months ago We use traject as well. You could use serp api, data for seo, or a half dozen others. If enterprise level refers to large number of keywords, getting the serp and dumping to bq and then using a bi tool to visualize is the most cost effective option. And flexible to combine with other data.",
                "Sarah Blocksidge   2 months ago What do you currently use? We use SE Ranking and while it's not perfect, it gets the job done and has some nice additional tools to it",
                "Donna Donahue   2 months ago Bright Edge and Conductor are similar, and my experience with both of them is that they are pretty spendy.",
                "Craig Harkins   2 months ago Add to the list GetStat (owned by Moz) and Nozzle as other tools that will give you daily ranking snapshots. Negotiate on the total searches you need to track daily/weekly."
            ]
        },
        {
            "message_text": "Josh Green   7:41 PM Just for a bit of fun. Most of us probably started life working for an agency. What was the biggest surprise for you going in-house? Mine was finding out that I couldn't actually make direct changes to pages/sites myself. I expected the big guys I went to work for to have amazing CMSs, not more bubble gum and bailing wire than my past clients. 1 +6 14 replies Last reply 1 month ago",
            "replies": [
                "Abby Leigh Curtis   2 months ago umm SAME. I have to submit tickets for redirects... 2",
                "Alex Harford   2 months ago Both in house jobs I've had I was able to make changes myself. In fact at one of them, I was also one of two web devs. Getting buy-in can be more difficult in-house. (edited)  1",
                "Eloise West   2 months ago For me, it's been very generous (if any) deadlines! Agency life trained me to expect every request to have a deadline of yesterday The amount of time to think & breathe has been the biggest (and very welcome) surprise. 6 1 1",
                "Abby Leigh Curtis   2 months ago same, @Eloise West ! I get tasks assigned with no actual deliverables expected and no due dates. lol 2 1 1",
                "Andrew Prince   2 months ago How much of a relief it is not to track time. I can do my best work on my timeline instead of a clients. Not spending a large chunk of time creating presentation decks. 1 4 1",
                "Sam Knight   2 months ago To piggy back, I'd have to agree the lack of deadlines was the biggest surprise. Though another is how much the minutiae of business ops would affect my strategies. Easier to be more effective when you know \"the whole story\" 1 1 1",
                "Andrew Prince   2 months ago Id also say how many teams I need to communicate with. At agencies it was mostly a main PoC or small team so it was more direct. At Wayfair and Rocket Mortgage, it can take me days/weeks sometimes just to find the right contact for a certain page element. 2 3",
                "Josh Green   2 months ago Oh yeah. Expedia was a nightmare of trying to find the right product owner or manager to get approval to change something. Want to change one element of a type of page across all the different lines of business? Good luck finding the right 8 people to approve them, 1 for each thing (hotel, car, package....) 3",
                "Josh Green   2 months ago @Abby Leigh Curtis I too can't put in redirects. I can see the list of them, but I can't change or add any. 1",
                "Ash Nallawalla   2 months ago I'm in my final week of in-house. For a long time I never had a deadline for stuff I discovered myself, but all project-related work had to be completed in the sprint. A major change occurred when the bean counters discovered a tax write-off if our tasks were related to \"innovation\" or \"R&D\", so we have to record our time against  a Jira ticket.",
                "Patrick Stox   2 months ago The amount of meetings. I don't miss those. There were so many meetings it was hard to find time to actually do work. 2",
                "Victor M Pan   2 months ago How in-demand SEO was. I closed over 600 tickets related to SEO in a year. How what looked well orchestrated from the outside was a hot disorganized mess from the inside. How short-term planning still prevailed for promotions and job skipping over long-term strategy and creation of scalable systems. How cross-functional it is to be IH - meetings all day. 2",
                "Paul Baterina   2 months ago I wonder if me not working for an agency hindered my growth vs. starting in e-commerce and been there for the last 10 years now...",
                "Peter Rota   1 month ago How slow it is. I feel like it takes forever to get anything done and there's so many approvals that need to happen."
            ]
        },
        {
            "message_text": "Josh Green   9:33 PM Small vent. When the engineers/developers go and do their own \"SEO research\" instead of just talking to you, especially when they refuse to let you attend kick off meetings.... (450 kB) https://media1.giphy.com/media/v1.Y2lkPTc5MGI3NjExbjZiNHNxZDJ5N2RwZWFxazBndXdhNXJwdXl1bXNsdmU1dHFqZXFrMiZlcD12MV9pbnRlcm5hbF9naWZfYnlfaWQmY3Q9Zw/xThta2LpX7YDVnxC1y/giphy.gif 7 2 2 1 4 replies Last reply 1 month ago",
            "replies": [
                "Joe Pawlikowski   1 month ago Constantly and always. Another one: Absolutely love to get a meeting on my calendar about a new product or feature, only to learn it's production-ready and they want to know if there's anything they can do to \"make it better for SEO.\" 1 2",
                "Craig Harkins   1 month ago I dont mind when developers go and do SEO research. It lets me discuss the findings with them and what weve seen in the past. Getting a seat at the kick off meetings is based on building those relationships and talking a lot with the dev and product teams about whats coming. After several times where I was asked to SEO things right before launch I was able to reinforce that SEO considerations have to come early in the process. It took sone time but I started getting read in early.",
                "Josh Green   1 month ago My issue isnt that they did the research. Its that they did the research and decided what I told them was bad for SEO. As for relationship building, I have been disallowed by the product team from communicating with the engineers. I cant go into the reason, but its caused by the silos we are in. Its very frustrating.",
                "Craig Harkins   1 month ago If you are prevented from being able to talk with engineers then how do SEO requirements get communicated? Are you in a marketing org and the PMs are in product? Regardless of org structure, if you dont have relationships built with PMs, UX and Dev then you wont be able to accomplish much tech SEO. In that situation Id be asking my manager and other PMs for advice on how to navigate the discussions so that the products perform better in organic search. Make it less about SEO metrics and more about the other teams KPIs. 1"
            ]
        },
        {
            "message_text": "Kyle   6:18 AM Hey #in-house friends! With mid-year evals/check-ins now over, whats one big thing youve worked on this year that youre either super proud of or want to acknowledge as a learning to take with you into the future? your comments  (edited)  +8 22 replies Last reply 1 month ago",
            "replies": [
                "Kyle   1 month ago Ill start: Ive never stepped into a role where its been so hard to get decent traction early. In my current role (and previous), Ive had things stacked against me which has humbled me in a lot of ways. Things I know work, dont. Ways Ive been successful in communicating, no longer are. Its been a bear of a year so far, but through it Ive been able to start gaining a bit of confidence back, and am excited for what the upcoming 4 quarters bring!",
                "Paul Baterina   1 month ago Super happy that Im able to work closely in almost all departments with ease. From the brand marketing team, engineers, UX, HR, the CEOs, accounting, business intelligence etc. its always been an ongoing battle in the past and now Im able to chat with every one of them regardless of position, all for the greater good of the company. 6",
                "Mika Lepist   1 month ago I'm not in house so I don't know that world, but freelance/consultancy has its issues with buy in and collaboration as well. Is that what you're referring to? 1",
                "Kyle   1 month ago Typically there are mid-year check-ins or evaluations which has people reflecting on whats gone well, what hasnt, etc. So, now that thats over, was looking to see if anyone had anything they were proud of this year or things that didnt go quite as planned from which they learned (or anything in between).",
                "Kyle   1 month ago Mine was more of a failure - I just got through my first year and wasnt as far along as Id hoped to be by now.",
                "Rajeev Lekhwar   1 month ago It has been good for me this year, We launched a new website which has been a great success, I will be working on communicating more with the other cross-team folks (which I have not been doing that much). 2",
                "Ash Nallawalla   1 month ago I knew I was leaving this year, so I created a Confluence (wiki) site for SEO and we recorded all procedures in it for future reference. We have numerous brands and tend to rinse and repeat, usually adding learnings as we go. 5",
                "Jonas Sickler   1 month ago Some great reflections here folks! Weve had incredible wins on our team this year (new website + new marketing category), but Im super proud these personal accomplishments: I helped stand up two new marketing projects that use organic search data in new ways.  The Brand Breakdown: a three-part subscription email series that dives into a trending topic or Fortune 1000 Brand through the lens of consumer search. I use keyword data to understand market share and important topics Organic search market share pages: these interactive web pages help visitors understand whos winning consumer attention in key business segments so they can make strategic marketing decisions to grow their customer base. (Launching soon) 1",
                "Eloise West   1 month ago I feel similar to you, @Kyle  started a new role in May and have been feeling like I wanted to make more of an immediate impact. Unfortunately things are more slow-moving and with many layers of approval compared to agency life! My top learning has been to trust my expertise and not be afraid to insert myself into relevant conversations. My feedback has always been well-received, but I was struggling with the confidence to give it in the first place! I'm glad to be over that hurdle now. 5",
                "Christina Heiser   1 month ago You are a rockstar, @Kyle ! I hope you have a great Q4! One thing I've tried to push myself to do this year is advocate for myself more. I used to take a more of a passive approach at work and let things happen to me, but I stood up for myself earlier this year and fought for a title change/salary adjustment to be more in-line with the actual job I was doing/results I was generating. It was definitely scary to have those conversations (as someone who usually avoids that at all costs), but at the end of the day, I realized the worst anyone could tell me was no! 4",
                "Kyle   1 month ago @Christina Heiser you are the GOAT! i'm so happy/proud for you to take that initiative and get what you deserve (well past due)! keep on crushing it 1",
                "Victor M Pan   1 month ago So I started refocusing on an acquisition channel this year and just hit the yearly goal target set for 2023. I am also no longer focusing on marketplaces (thanks AI) My learning was that if things get stuck let stakeholders know of your plan B (which does not overlap with them) and just ship that. Actions over meetings. Documents with meeting notes on different team priorities for the year. If they prefer to give answers in DMs then ask for permission to document decisions to move on. 1 2",
                "Myles   1 month ago @Kyle So, I'm still wearing my \"SEO rookie\" hat, but let me tell you, this year has been quite the rollercoaster of learning and tackling challenges. One of my 2023 goals was to add a Glossary Section to our site. The big bosses didn't have this at the top of their list, so it took some time to craft the content and get our talented UX and dev teams to perfect the design. But after a 9-month labor of love, my dream finally came to life in August! 7",
                "Kyle   1 month ago congrats, @Myles - that's a massive accomplishment!",
                "Boyd Norwood   1 month ago We migrated our site to wordpress and we are pleased with everything related to that except for one thing. Some of our rankings dropped largely because we failed to bring over the alt text of many images. It took us a couple months to notice but we have since rectified the situation and just recently got a lot of rankings back. Note to future self: follow a checklist that covers all the things after launch, have someone monitor the rankings every week, even after other priorities have begun 2 2",
                "Daniel Mojica   1 month ago As someone who is going on just two years doing SEO, I really focused on keeping up-to-date with industry news and tools. Regularly reading articles and watching videos on what's going on and what tools people are using to make their jobs more efficient and reach their goals has helped me propose new processes and strategies. My managers let me know that they saw a difference in my work and attitude (not that it was negative to begin with) and that I am on my way to a promotion! 2",
                "Peter Rota   1 month ago I was super happy to achieve a branded knowledge panel for my company! 2",
                "Myles   1 month ago @Peter Rota Wikipedia as well? 1",
                "Peter Rota   1 month ago No, I wish. I did create though a wikidata page, but they deleted it. I think I was just adding too much info at once.",
                "Paul Baterina   1 month ago @Mika Lepist I saw you threading us (Myles and I), but how? Can you thread a thread? I don't see the option. Screenshot 2023-09-19 at 8.18.58 AM.png  ",
                "Kyle   1 month ago @Paul Baterina - i think that was a mistake on @Mika Lepist 's part. you're already posting in a thread 1",
                "Mika Lepist   1 month ago Yea probably tapped something wrong on mobile. Sorry! 1"
            ]
        },
        {
            "message_text": "Kyle   6:05 AM This could have gone in either place, so posting here - some great feedback on creating SEO centers of excellence within an org; notably with amazing input and examples from @Ash Nallawalla (thanks Ash!) https://theseocommunity.slack.com/archives/C05K5C0N7RV/p1694481955216659 Kyle This is applicable to #in-house folks as well, but thought operations was the most relevant channel for the initial post: When establishing an SEO center of excellence, how do you  define it internally? Establish SOPs? Show more Thread in operations | Sep 12th | View message 5 replies Last reply 1 month ago",
            "replies": [
                "Josh Green   1 month ago When you say center of excellence, what do you mean? Its either an entirely new concept to me, or something I know about but never heard that name given to it.",
                "Kyle   1 month ago a fancy name i saw a few years back to describe the process of establishing an seo program within an org (e.g. people, processes, tools, measurement, communication).",
                "Josh Green   1 month ago OOOOOH. Well sure. I think I sort of dipped a toe into that before, but not jumped into the whole topic. My two cents, its difficult to get this type of program fully fleshed out company wide until you have buy in to communicate and/or knowledge share from the major stakeholders. Not saying you need to be integrated into their processes or influence their decisions yet, just open communication. This bit, in the three in-house teams I have worked on, has been the hardest to achieve. Once that has been achieved, which took years at the first one (partially due to mergers and re-orgs), the others are easy. With that said. The team can do some ground work within the team itself. Set up internal knowledge sharing, establish best practices, and define the SEO strategy you can accomplish without anyone else's buy-in. Dong this does a few things, but most importantly for this discussion, it gets the tools in place and ready to go when you do start getting the cross functional communications going while still letting you make progress towards improving the site's SEO. Josh Green As an in-house SEO the biggest struggle I have is to become almost embedded with the engineers/developers. Occasionally opening up that communications channel is more than difficult. What strategies and tools do you use to communicate with the devs? How did you get them to open the door to collaboration and shared info exchanges? Thread in in-house | Jul 31st | View message 1",
                "Kyle   1 month ago great feedback and insights on this; thanks @Josh Green !",
                "Ash Nallawalla   1 month ago @Josh Green An SEO centre of excellence would be a self-sufficient team. If you know Rachel Heseltine, I worked for the same company until a week ago and she just managed to be given such a team. It has devs, SEOs and other experts as needed."
            ]
        },
        {
            "message_text": "Josh Green   9:46 PM I just had an interesting training with two new SEOs. One is under 3 months in, and the others is a year or so. Their question was: ...how to set an SEO Strategy. What factors are examined, what's the landscape, how is it communicated etc? Keep in mind this needed to be high level for fairly new SEOs functioning at an enterprise level in-house team, how would you answer it? I will happily share my take, but want to see how you all would teach this before I do. 5 replies Last reply 18 days ago",
            "replies": [
                "Stephanie Briggs   1 month ago My approach has always been look at everything (technical SEO, content, competitors), then identify 3-5 high impact projects for the year. Usually, high impact involves fixing things that are very broken and inhibiting success implementing new discovery features or fixing navigation/menus to better align site structure with search demand fixing content to align to search intent (if its a content program) creating new page types to capture relevant, unmet search demand From there, I look at whats feasible within the current structure of the business (which engineering/product teams have capacity to take on new work, how many writers are available, etc.) and whats already in motion that I can work my projects into. In addition to those big wins, I keep a running list of smaller fixes that I can accomplish as projects come up or when the time is right. To me, developing and implementing a successful strategy is accomplishing 1-3 of those big projects and driving significant growth to corresponding site sections. Running a successful program also involves protecting existing traffic from releases that break stuff. From a time management perspective, its about being dogged and persuasive and creative and bold enough to get those big things done and to not get caught up in doing the work that is easy to do (but doesnt drive growth). 2 5 2",
                "Ash Nallawalla   1 month ago I wrote an SEO strategy for a company I left just over a week ago. It started with a reference to the company's \"2025 vision\" document and narrowed down to the areas not yet built, so SEO would be applied to them from the get-go. I referred to existing audits and findings, listing the major boulders we were moving in SEO. The strategy would list the usual prioritisation, e.g. urgency, feasibility, etc. It would try to estimate revenue gains because of this strategy.",
                "Victor M Pan   1 month ago I ask for their field of study then do a metaphor. Biz school students are easier because you explain the business. We have a TAM process which I explained in venn diagrams.",
                "Ruth Burr Reedy   1 month ago Echoing what Ash said  I think the best way to get any SEO initiatives all the way to completion is to tie them to company goals. If their goal is to grow their audience, show how your top-of-funnel content is going to expand traffic, reach, and share of voice. If they've got a specific topic area they're looking to expand into/own, double down on that. If you've got major technical fixes you want to get done, tie those back to those overall goals and (ideally) include some leading-indicator type KPIs. So like, not just \"we're going to decrease page load time by X%\" but \"we're going to increase user engagement by Y% by decreasing page load time by X%.\" 1",
                "Jonas Sickler   18 days ago Given that the audience is new in-house SEOs at an enterprise brand, Id probably start with why SEO isnt really about rankings, impressions, clicks, or traffic. Those are just ways we measure performance. Its actually about understanding our audience and connecting with them in their moment of need. Unlike paid ads, which interrupt folks when theyre trying to consume content, organic search is about publishing the content consumers are actively seeking. Enterprise SEO is built to work across the business, supporting the brand with communications, marketing, sales, customer service, etc. It must account for high level business goals as well as a keen understanding of our audience. what are our business goals who is our audience what do they want, need, and feel how can our brand authentically help them on their journey in a way that aligns with our purpose how big is the organic search opportunity who are we competing with for attention how is our brand represented online"
            ]
        },
        {
            "message_text": "Cillian BC   2:05 PM Sometimes, building links can have an impact. Sorry share a 3rd party grab but it was the easiest way to show the growth in ref domains. GSC show's a similar trajectory in traffic CleanShot 2023-10-05 at 09.59.59.png  2 replies Last reply 17 days ago",
            "replies": [
                "Andrew Prince   18 days ago What leads you to believe that links are responsible for any increases? Not saying it isn't, but curious of the thought process. (edited) ",
                "Cillian BC   17 days ago We created some assets designed to attract links naturally. Which worked. We did nothing else major during this time. Obviously correlation != causation but confident that it contributed in this instance"
            ]
        }
    ]
}