{
    "messages": [
        {
            "message_text": "Britt Klontz   1:00 AM Hi, SEO friends! I'm Britt, and I run a content and digital PR consultancy in Bonney Lake, WA (it is near Seattle). I previously was at a few SEO and PR agencies, BlueGlass > Distilled > Weber Shandwick > Distilled (boomerang employee). I started my consultancy at the tail-end of 2019 and have experience strategizing content and doing PR for various businesses and entrepreneurs, from B2B software companies to lifestyle brands and influencers. My favorite client at the moment is a home organization expert specializing in the KonMari method (yes, you can get certified in this!). I also run training sessions for large in-house teams and 1:1 coaching sessions. Never a dull moment! Excited to connect with the broader SEO community and learning from you all, too. 20 3 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jeremy Galante   4:11 AM Hey Yall! Im Jeremy  Entering my third year as the in-house SEO lead at ClickUp (project management software) and have been in various SEO/digital marketing roles over the last 9 years or so. Im currently living in sunny San Diego, CA but have spent most of life in Buffalo, NY. Excited to be in the company of some awesome people on here! 21 1 8 replies Last reply 3 months ago",
            "replies": [
                "Andrew Prince   3 months ago If you havent met @Tess Voecks you need to. Shes yalls biggest champion! 1",
                "Jason Wilson   3 months ago Jealous! San Diego is the bees knees. I have been trying to get my family to move back to SoCal but we are in the Bay Area for now. 1 1",
                "Adam Humphreys   3 months ago I love clickup but damn if there isnt a ton of content coming in daily. Its got a LOT of features. Its what I use for my business. 1",
                "Adam Humphreys   3 months ago Im jealous of all the amazing meetups you have in the Bay Area @Jason Wilson . Theres a lot of brilliant people down there doing really neat things.",
                "Jason Wilson   3 months ago @Adam Humphreys I have to go to some of them! @Micah Fisher-Kirshner has an awesome meetup and I need to make sure I'm there next time. 1",
                "Jason Wilson   3 months ago @Adam Humphreys a lot of brilliant people that I don't know or interact with, unfortunately! 1",
                "Micah Fisher-Kirshner   3 months ago I need to get the next one set up... Gr... And shame on myself there heh 2 1 1",
                "Jonathan Sackheim   3 months ago Welcome, Jeremy!"
            ]
        },
        {
            "message_text": "Dale   5:33 AM Hi everyone I'm Dale and the Head of Product at Jepto (Probably best know for our GMB reporting). Like many of you I've crossed paths with Noah and last year we even collaborated together to build out Branch Tools. It's great to see a few familiar faces and looking forward to meeting some more. I spend a lot of time trying to solve Local SEO and Ad Agency automation problems, and always keen to discuss reporting, operations, AI and engineering solutions on AWS or GCP. 18 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Colt Sliva   5:42 AM Hey all, Colt Sliva here. Im a Technical SEO at Glassdoor and Ive been building websites for about 15 years. I like to break things and put them back together. 20 5",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Itamar Blauer   12:22 PM Hi everyone I'm Itamar, and I work for a specialist SEO agency called StudioHawk I'm based in London so happy to be here and connect with those near and far (all I ask is that you don't try to sell me links ) 4 20",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Ilias Galiotos   4:35 PM Hi all  I'm Ilias, SEO & Paid Advertising Manager at MarineTraffic/Kpler. It's nice to see so many great people here already -- looking forward to meeting you all! Gimme those SGE goodies if you have them! 15 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Kurt Lambert   6:15 PM Hi everyone, happy to have joined this awesome community! I'm Kurt Lambert, VP of SEO & Content at Silverback Strategies. I've been in the SEO world on the agency side for 14 years. I love problem solving unique SEO challenges through strong technical foundations and getting really creative with content strategies. I'm really looking forward to mixing it up with everyone here! 19",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Roth   9:35 PM Hey guys! I am Roth from the Philippines. I work remotely with an SEO agency in the UK. I work freelance on the side. Happy to be here. :) 12 3",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Monty   1:04 PM Hey SEO fam! Im Monty, a passionate freelance SEO consultant from the vibrant city of Delhi, India. I'm thrilled to join this buzzing community of SEO wizards and connect with all you amazing people. I'm in in the early stage of my career but I've had the opportunity to assist a couple of clients. And previously I've worked remotely as an SEO Specialist for a year. I have a deep-seated love for understanding the 'why' and 'how' behind everything. It has always fueled my curiosity and greatly influenced my journey as an SEO professional. In my free time I enjoy lifting weights at the gym, reading a good book, and long walks in nature. Thank you @Noah for creating this tribe and @Nick LeRoy for recommending it in the #SEOForLunch newsletter. Feel free to reach out if you fancy a chat or need a helping hand. Looking forward to learning from you all. Love to connect, Monty  https://www.linkedin.com/in/monty-mathur-seo https://twitter.com/IAmMontyyyyy (edited)  X (formerly Twitter) Monty Mathur (@IAmMontyyyyy) / X Freelance SEO consultant | Curiosity Driven Person 15 6 replies Last reply 3 months ago",
            "replies": [
                "Nick LeRoy   3 months ago Welcome! 1",
                "Dan Rice   3 months ago I was only asking you the other day if you were in any other networks welcome Monty! 1",
                "Nat Arney   3 months ago So good to see you here Monty! 1",
                "Matt Tutt   3 months ago Hello and welcome Monty! 1",
                "Monty   3 months ago Hey @Dan Rice I can you read your mind",
                "Monty   3 months ago Hello @Matt Tutt & @Nat Arney very happy to see you guys here as well  (edited)  1 1"
            ]
        },
        {
            "message_text": "Shay Ohayon   4:56 AM Hi everyone! Thank you @Noah for creating another space for great SEO conversations 14",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Nat Arney   11:52 AM Hi everyone! I know a lot of you from Twitter/Linkedin/BrightonSEO etc! Thanks @Noah for setting up this community! I'm Nat, I am a Freelance SEO & PR Consultant and live in Brighton in the UK. I've worked agency side, in house and now work for myself. I've worked in Digital Marketing for 11 years now, and prior to that I was a teacher. Good to see so many familiar faces here! 22 1 8 replies Last reply 3 months ago",
            "replies": [
                "Dan Rice   3 months ago Hey Nat and welcome!",
                "Nat Arney   3 months ago Hi Dan!",
                "Kyle   3 months ago NAT!! So great to have you here; welcome!",
                "Nat Arney   3 months ago Hey @Kyle ! Good to see you, thank you! 1",
                "Tory Gray   3 months ago Welcome, Nat! Great to see you here :D",
                "Nat Arney   3 months ago Hi Tory! 1",
                "Jess Joyce   3 months ago NATTTT!!!! 1",
                "Nat Arney   3 months ago Hey @Jess Joyce ! Can't believe we're still waiting for the almanac btw!! 1"
            ]
        },
        {
            "message_text": "Emily B.   8:22 PM Hi, happy Monday! I'm Emily, a coffee obsessed human and passionate marketing soul. I've worked for nonprofits, healthcare, and ecomm clients, and love creative SEO. For any coffee lovers in the group, I'm always looking for good coffee brands to try. Feel free to share over your favorite ones that I can add to my list. Thanks for the add, and have a great, coffee filled day! 16 +1 10 replies Last reply 2 months ago",
            "replies": [
                "Andy Strager   3 months ago Olympia coffee is one of my absolute favorites 1 1",
                "Emily Brady   3 months ago [spiderman] (2 MB) https://media3.giphy.com/media/l36kU80xPf0ojG0Erg/giphy-downsized.gif?cid=6104955eflwao0nlnfok4iibghz8kobwda3t41anlxbie8mg&ep=v1_gifs_translate&rid=giphy-downsized.gif&ct=g Posted using /giphy",
                "Emily Brady   3 months ago Hi and welcome from another Emily B! Have you tried Storyville coffee? (Seattle based but I used to get it shipped all the time!) 1",
                "Emily B.   3 months ago Cheers to another Emily B.   @Emily Brady . I haven't, but adding to my list, so fun. And thanks @Andy Strager I'll check them out.",
                "Jaimee   3 months ago Welcome! I'm also a big coffee fan I second Olympia & Stumptown is another good one!  Also, my good pal works for the subscription Atlas Coffee Company and their coffee is great (& it's just fun to get beans from all over)! (edited)  atlascoffeeclub.com Atlas Coffee Club | The Best Coffee Subscription, Rated #1 Your own personalized subscription. 50+ countries grow coffee. We designed a subscription to help you discover the best. First bag 50% off, starting at $7. 1",
                "Emily B.   3 months ago Awesome @Jaimee I do love Stumptown and will check out Atlas. Thank you!",
                "Brian   3 months ago A local favorite of mine: https://sisterscoffee.com/pages/subscriptions-page 1",
                "Emily B.   3 months ago Thanks @Brian :)",
                "Jonas Sickler   2 months ago Welcome Emily! I love that you (and so many others in this group) think bigger than SEO. Marketing wins when SEO is part of the bigger strategy! In terms of coffee, any local roaster that roasts beans in-house is going to be amazing. There's nothing like that smell  it soothes the soul. 1",
                "Emily B.   2 months ago Hi @Jonas Sickler I totally agree with you on all things marketing and coffee. I support a local roaster here for my daily grind. 1"
            ]
        },
        {
            "message_text": "Dave Smart   11:17 PM Hello all! I'm a freelance tech SEO & dev from Manchester, UK, great to see some familiar faces and some new ones too! 16 2 6 replies Last reply 3 months ago",
            "replies": [
                "Darren G   3 months ago Welcome Dave. Nice to see another SEO person based in Manchester here. 1",
                "Dave Smart   3 months ago Hey Darren! Whoop! A local! 1",
                "Kyle   3 months ago Dave! Welcome, so great to have you in here! I think your insights will be an amazing addition to the #technical-seo channel 1",
                "Dave Smart   3 months ago Hey @Kyle kind of you to say!",
                "Nat Arney   3 months ago Good to see you here Dave! 1",
                "Dave Smart   3 months ago Hey @Nat Arney , good to see you too! 1"
            ]
        },
        {
            "message_text": "Becky Westmoreland   12:38 AM Hey folks - Lots of familiar names from Twitter - glad to find a place to chat 13 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Kavi Kardos   1:28 AM Hey hey! Happy (?) Monday (?)! I'm Kavi, Director of SEO at Uproer. We're a SaaS- and ecommerce-focused agency based in Minneapolis/St. Paul. I work remotely from Austin, TX. I'm a gigantic fan of the Women in Tech SEO Slack community, so I'm excited to be a part of another something similar with all of you! And now I'm headed over to #pawsandclaws to post pictures of my cat... 14 3 4 replies Last reply 2 months ago",
            "replies": [
                "Andy Strager   3 months ago Hey Kavi! Lovely to see you here! (edited)  1",
                "Donna Donahue   3 months ago Welcome @Kavi Kardos I just posted pictures of my kitties. 1",
                "Tory Gray   3 months ago Welcome, Kavi! 1",
                "Jonas Sickler   2 months ago Hi @Kavi Kardos ! I've known Abby Gleason (Reimer) for a while now, and I know she was with Uproer for a while. Nice to have you in this group! 1"
            ]
        },
        {
            "message_text": "Justin Briggs   2:21 AM Hey Everyone, I'm Justin. I am the Director of SEO at Paramount Streaming (Paramount+, Pluto TV & Showtime) and work remotely from Portland, OR. Been in SEO for 15 years, and recently went back in-house after 8 yrs of consulting. Love all parts of SEO, but typically work on large e-commerce and content sites. Enjoy strategy, product, technical SEO, scaling content programs, and data science. Outside of SEO, I'm always happy to chat about film & TV. Excited to find this group and look forward to connecting. You can also find me on LinkedIn. 8 24 5 +1 12 replies Last reply 2 months ago",
            "replies": [
                "Kyle   3 months ago JUSTIN! Welcome - so awesome to see you here!",
                "Justin Briggs   3 months ago Hey @Kyle - Great to see you! 1",
                "Donna Donahue   3 months ago Hi @Justin Briggs nice to meet you. I'm in the large e-commerce space as well. Not quite as exciting at TV and movies and the like, but I like it. 1",
                "Noah   3 months ago @Justin Briggs huge fan here. 1",
                "Brian   3 months ago Hello from Oregon 1",
                "Donna Donahue   3 months ago Hi Brian welcome",
                "Jonas Sickler   2 months ago Hey @Justin Briggs !  This group gets more fabulous every day. Who needs Xwitter anymore - lol. It must be fascinating to do SEO for a network. I was just doing a deep data analysis about the search interest around Yellowstone over the years. Fun facts: Yellowstone has 5-10x the search interest of all other Nielsen top 10 rated cable programs. Yellowstone annual search interest exceeds the TOTAL viewing audience of the entire Nielsen top 10 combined Pretty cool stuff (for us data nerds anyways) (edited)  1",
                "Justin Briggs   2 months ago Hey Jonas! It's been really interesting so far, and those are amazing stats. Awesome show. 1",
                "Noah   2 months ago How much of that Yellowstone search interest is tied to folks searching to plan a visit?",
                "Jonas Sickler   2 months ago Great question @Noah ! Zero as far as I know. I will share all of the data for anyone who wants to scrutinize it in September. We are running a campaign next month, so I cant share it before then. I eliminated all entities involving the national park or camping. I was pretty meticulous in going through the keywords to make sure they were only about the show and not the park",
                "Jonas Sickler   2 months ago The only exception is the main term Yellowstone which i included because it had duel meaning",
                "Noah   2 months ago"
            ]
        },
        {
            "message_text": "Kirti Anand Sharma (Kas)   6:48 AM Hi All, Im Kas. I started my career in SEO about 14 years ago at a small company where I was responsible to setup, grow and maintain a portfolio of 100+ websites across several niches like party favors, fashion, health, law, furniture, finance, travel, office supplies, rentals etc. Currently, I am leading SEO at Zillow. Outside of work and family, I dedicate some time to SEO consulting, networking, coaching/mentoring. Please reach out if you would like to connect and chat! 16 2 1 7 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago Welcome Kas, excited to have you here!",
                "Kirti Anand Sharma (Kas)   3 months ago Hey @Kyle Hows it going? Thank you, excited to be here!",
                "Kyle   3 months ago Going well! Id love to connect and chat sometime soon!",
                "Kirti Anand Sharma (Kas)   3 months ago Lets do it! Sending you a DM.",
                "Crystal Ortiz   3 months ago Hi Kirti! Would love to connect sometime 1",
                "Kirti Anand Sharma (Kas)   3 months ago Would love that @Crystal Ortiz",
                "Crystal Ortiz   3 months ago Yay Ill DM you!"
            ]
        },
        {
            "message_text": "Cat Boyce   7:08 AM Hi all! I'm Cat, she/her & I'm a Senior Digital Product Manager at the Ad Council, a non-profit that partners with government agencies and other non-profits to create social good PSAs. I'm leaning into search more in my role and am especially interested in how we can use AI to improve SEO processes and workflows. Other work interests of mine include accessibility, information architecture, user research, and analytics.  Outside of work I'm a big photography + nature fan. I'm based in Brooklyn, NY. Excited to be a part of this community. Feel free to connect with me on LinkedIn. 3 16 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jordan Silton   7:49 PM Hi Everyone, I'm Jordan. Thanks so much @Noah for bringing us all together. I'm a big believer in the power of the SEO community, and it's great to see to many familiar faces and new ones all in the same place. I live in Atlanta, GA with my wife and three kids, enjoy being the family chef , and playing any kind of sport (particularly tennis and soccer right now). Atlanta is a bit of a land-locked city with some small lakes, but I love to race sailboats and in general be on the water under sail. So, please let me know when you charter or buy a private boat, and I'd be happy to island hop in the Caribbean with you. My professional expertise lies at the intersection of marketing and product, focused on marketplaces, consumer growth, and SEO. Most recently, I was VP, Product at Angi (formerly Angie's List) and before that I was Senior Director of Product, SEO at Apartments.com (CoStar Group) after working for a couple of digital agencies locally with lots of great clients. I'm currently doing a bit of consulting and looking for my next career opportunity. One particular area of interest is a focus on helping companies turn themselves around through product growth, exceptional customer experience, high-performance teams. If you know any private equity firms that are looking for help in this area, I'd welcome and appreciate any connections. Feel free to reach out here on Slack or find me on LinkedIn . It's great to be part of this group, and I look forward to connecting with you all. 24 +1 6 replies Last reply 2 months ago",
            "replies": [
                "Jordan Choo   3 months ago Always nice to meet a fellow Jordan! 2",
                "Jess Joyce   3 months ago 2x Jordans!!!",
                "Monty   3 months ago Hi Jordan! nice to meet you",
                "Micah Fisher-Kirshner   3 months ago Jordan! Good to see you here. 2",
                "Crystal Ortiz   3 months ago Hi Jordan! 1",
                "Jonas Sickler   2 months ago Welcome @Jordan Silton . You're journey is fascinating! Good luck on the next phase of your career"
            ]
        },
        {
            "message_text": "Anthony Barone   10:06 PM Hey everyone I'm Anthony, I own and run a specialist SEO agency called StudioHawk in the UK Live in London now but originally Australian 19 3 3 replies Last reply 2 months ago",
            "replies": [
                "Sophie Brannon   3 months ago     1",
                "Crystal Ortiz   3 months ago Hello hello! 1",
                "Joshua Poole   2 months ago Nice Anthony"
            ]
        },
        {
            "message_text": "Melissa De Oa   12:30 AM Hi guys! Im Melissa, I currently work as the SEO lead for GLIDE in Austin, Texas, however Im based in Costa Rica. Looking forward to the conversations! 20 4 replies Last reply 3 months ago",
            "replies": [
                "Jameson Treseler   3 months ago pura vida!",
                "Jason Wilson   3 months ago Welcome! Love Costa Rica!",
                "Melissa De Oa   3 months ago Thank you! Pura vida",
                "Crystal Ortiz   3 months ago Hi there! 1"
            ]
        },
        {
            "message_text": "Maddie Darveau   4:46 AM Hi all! So excited to finally find an SEO community. Joining from #MozCon2023. I'm Maddie, I'm an SEO specialist for a niche e-comm marketing agency based in Des Moines, Iowa, and I'm super passionate about the intersection of SEO, social media, and organic content! 4 17 2 replies Last reply 3 months ago",
            "replies": [
                "Daniel McCue   3 months ago (Waves in Iowan) 1",
                "Crystal Ortiz   3 months ago Hi Maddie!"
            ]
        },
        {
            "message_text": "Becky Westmoreland   6:57 AM I didn't intro myself earlier, but I'm Head of SEO at Fandom, including the MetaCrtic, GameSpot, TVGuide, GameFAQs and Fanatical brands. 22 3 3 replies Last reply 2 months ago",
            "replies": [
                "Crystal Ortiz   3 months ago Hi Becky! 1",
                "Jonas Sickler   2 months ago That's gotta be a super fun space to work in. I bet those communities are hyper engaged  especially when Zelda TOTK released.",
                "Becky Westmoreland   2 months ago A very passionate community for each IP @Jonas Sickler   - a lot of folks don't realize we have more than 200,000 websites 1"
            ]
        },
        {
            "message_text": "Jon Henshaw   7:43 AM Hey, y'all, this looks like a mighty fine place that @Noah created. And if he didn't start this, then either @Dave Ojeda is a filthy liar, or I got the wrong Noah. In my free time, I write, experiment, and build stuff at Coywolf. My weekdays are dedicated to my corporate overlord and capitalist savior, Vimeo, where I'm the Senior Director of SEO. They are lovely people, it's a cool business, and the healthcare is pretty good too. The oldies here may know me as one of the founders of Raven Tools, which I exited in 2017. I look forward to being helpful, useless, or just lurking. Only time will tell which one I'll be. Maybe I'll do all of those things, or maybe I'll do none of those things and will discover some new online behavior that has yet to be discovered and will dramatically change how we communicate online forever. Think smell-o-vision. This has been my TED talk and my intro. 12 22 3 1 1 +6 13 replies Last reply 2 months ago",
            "replies": [
                "Kyle   3 months ago JON! Welcome; so awesome to see you here! I still drink from my coywolf coffee mug on the daily  (edited)  2 1",
                "Jason Wilson   3 months ago Welcome, Jon! I would say get Todd F to join but hes too busy making Kombucha to talk SEO anymore! Tell him I said that! 1",
                "Tory Gray   3 months ago Hi Jon! 1",
                "Mike Blazer   3 months ago Hi Jon! (edited)  1",
                "Crystal Ortiz   3 months ago Hello hello! 1",
                "Jess Joyce   3 months ago JON!! 1",
                "Dave Ojeda   3 months ago Welcome Jon! 1",
                "Adam Humphreys   2 months ago The best newsletter! I always look at the stuff you put in there and go, How is nobody talking about this stuff!? 1",
                "Jon Henshaw   2 months ago I mean, since you brought it up, I'm just gonna slide this link in here: https://coywolf.email coywolf.email Coywolf Email Newsletter (47 kB) https://coywolf.email/ 1 1",
                "Dave Ojeda   2 months ago And some of the best swag I own!!! 2",
                "Jess Joyce   2 months ago I love my Coywolf MUG!!! 1",
                "Jonas Sickler   2 months ago Hey @Jon Henshaw ! Great to bump into you here. 1",
                "Keri Morgret   2 months ago Good to see you, though I don't know how I feel about being called an oldie!"
            ]
        },
        {
            "message_text": "Dave Ojeda   7:36 PM Hey there! Happy to jump on board, with a gentle push from @Jess Joyce (Thanks!) Been doing local and organic SEO for 13 years. Over the past 7 years I focus mostly on Schema Markup strategy, audits and template creations. Looking forward to being here! 4 4 20 6 4 5 2 1 3 replies Last reply 3 months ago",
            "replies": [
                "Jess Joyce   3 months ago Dave! Dave! Dave! cheers",
                "Kyle   3 months ago Hey Dave!!",
                "Jason Wilson   3 months ago Welcome, Dave! @Kyle I believe that schema channel is now in order!"
            ]
        },
        {
            "message_text": "Michelle Micallef   9:23 PM Good morning! Excited to be here and feeling inspired by the many great Moz presentations the last few days! I'm the Product Manager of SEO at Rover.com! 5 22 1 1 reply 2 months ago",
            "replies": [
                "Jonas Sickler   2 months ago Hi Michelle! Welcome to this incredible group. Sorry it took me almost 2 weeks to catch up. This party got big fast! lol. 1"
            ]
        },
        {
            "message_text": "Abel Johnson   9:31 PM Hello everyone! Really excited to be here! Cheers to @Noah for the invite! Im Abel, I lead a small team of SEOs at an agency out of Minneapolis called Voro Digital. I have been in SEO about 12 ish years .. maybe a little more.. time is a joke these days, nothing is real.  lol I have worked in agency side and in house throughout my career but at this point still prefer agency a lot more. I LOVE to build things and tinker and break things down (although the putting it back together is questionable at times lol) In my free time (lol free time) I like to take on a variety of things from djing to home improvement, to car restoration.. because why not right? Pleasure to meet everyone! Looking forward to the conversations! 20 4",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Josh Tominus   10:47 PM Thought Id give this introduction thing a go. My name's Josh and I'm currently an SEO Manager for NBCUniversal, where I focus on their Fandango and NBC Sports Next divisions. With five years of experience in the industry, I've tackled everything from off-page strategies to content and technical SEO. Though I used to work in an agency setting, I've recently made the move in-house, and Im finding my footing among its unique challenges and opportunities. When I'm not knee-deep in analytics and optimization, you can catch me watching a ton of films (proud cinephile here!), solving my way out of escape rooms, hitting the gym, or hiking some scenic trails - if you can actually call it a hike in Florida. Im always down to exchange Letterboxd usernames or talk about your favorite national park trips! I must admit, I've mainly been a lurker in the SEO community, but I'm excited to break that trend and connect with more like-minded folks in the industry. Looking forward to learning from all of you and contributing where I can. Feel free to reach out; I'm always up for a chat about SEO or swapping film recommendations! Lets connect on LinkedIn and Twitter! (edited)  Twitter Josh Tominus (@JoshTominus) / Twitter SEO Manager at NBC Universal | Fandango | Rotten Tomatoes | Vudu | GolfNow | GolfPass | SportsEngine 6 29 +7 17 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago Welcome Josh! 1",
                "Brian   2 months ago Hi @Josh Tominus do you work with Irving Corzo? 1",
                "Josh Tominus   2 months ago @Brian Not directly, but I did chat with him and the rest of the Peacock SEO team last month!",
                "Brian   2 months ago Nice! @Josh Tominus I used to work with Irving at Merkle a few years ago. I knew he was at NBC but wasn't quite sure what team. You'll have to tell him I say hello if you run into him again sometime soon!",
                "Becky Westmoreland   2 months ago Hi competitor   1 1",
                "Nathan Driver   2 months ago Hey @Josh Tominus - used to work for NBC affiliate station in Ohio years ago 1 1",
                "Alex Harford   2 months ago Hey Josh! I've mostly been a lurker until relatively recently too - managing to join Twitter shortly before Elon Musk bought it. What films would you recommend? I rate everything on IMDB but keep meaning to try Letterboxd. I'm aiming for a top 100 of the 2010s - so far I have 81 from about 650 watched: https://www.imdb.com/list/ls049362246/ I love hiking too - what's your favourite NP? My favourite place is the Hebrides off Scotland's west coast. IMDb 2010s Best Films According to Me - IMDb 2010s Best Films According to Me (14 kB) https://www.imdb.com/list/ls049362246/ 1",
                "Monty   2 months ago Hey Josh - fellow movie lover here 1 1",
                "Steve DiMatteo   2 months ago Hey Josh, great to meet you - heres my Letterboxd! https://letterboxd.com/stevedimatteo/ Letterboxd Steve DiMatteos profile Steve uses Letterboxd to share film reviews and lists. 2,006 films watched. Favorites: Aliens (1986), Terminator 2: Judgment Day (1991), Jurassic Park (1993), Twister (1996). Bio: Co-host of Revenge of the '90s, the podcast devoted to all things '90s movies. 1 1",
                "Paul Baterina   2 months ago Hey Josh nice to meet you! What's your favorite movie of all time?! Yes. You have to pick 1! 1",
                "Josh Tominus   2 months ago Thank you everyone for the warm welcome!  (edited) ",
                "Josh Tominus   2 months ago @Alex Harford My top five favorite movies at the moment are Everything Everywhere All At Once, La La Land, Persona, Eternal Sunshine of the Spotless Mind, and Hereditary. Definitely should give a content warning for some of those, especially Hereditary haha. - I haven't had a chance to actually visit a national park yet, looking to plan a trip with my partner to Glacier National Park though! @Steve DiMatteo Followed you! I'll have to check out your podcast! @Paul Baterina Oof, that's tough. If I had to pick all-time, I'd probably have to say Ingmar Bergman's Persona! (edited)  1",
                "Steve DiMatteo   2 months ago @Josh Tominus Youll have to come on as a guest too!",
                "Brian   2 months ago Saw Glacier NP mentioned....you need to go. \"Going to sun road\" and logans pass are",
                "Zach Hall   2 months ago @Josh Tominus Hey Josh! I have wondered what its like doing SEO in the sports world. I graduated college with a sport management degree which we didnt talk much about SEO.",
                "Eloise West   2 months ago Welcome @Josh Tominus ! I also recently made the jump in-house, and I'm also in sunny (too sunny?!) Florida. Looking forward to all the movie recs! Personal recent fave of mine is Midsommar",
                "Jonas Sickler   2 months ago Hey @Josh Tominus ! We're all so glad you decided to come out of the shadows. It sounds like you have a lot to offer the community!"
            ]
        },
        {
            "message_text": "Stephanie Briggs   7:51 PM Hey all, I'm Stephanie and I am an independent consultant mostly working with large e-commerce brands that have content programs.  You may have seen me present on search-driven content strategy at MozCon a few years back, but I've been pretty quiet on social media the last few years. Excited to be here! 6 24 5 replies Last reply 2 months ago",
            "replies": [
                "Noah   2 months ago So stoked you and @Justin Briggs have hopped on here. You blew my mind with your deck. 1",
                "Victor M Pan   2 months ago The Briggs power couple are here! BU alum here. Its almost September, the better months of Boston.",
                "Stephanie Briggs   2 months ago I miss Boston so much! 1",
                "Dana DiTomaso   2 months ago Good to see you! 1",
                "Crystal Ortiz   2 months ago Hi Stephanie!"
            ]
        },
        {
            "message_text": "Rick   7:59 PM Hey gang. I'm Rick in Denver, CO. I've been doing SEO professionally since 2008. Over the past 15 years I've had my hands on SEO, PPC, and paid & organic social. I've been inbound marketing certified, and Hubspot certified. I've managed SEO in-house at small startups, global enterprise, a few agencies, and (of course) freelance here and there. Technical SEO is my bread and butter, and the professional language that I speak most fluently. In December I'll celebrate 6 years on the Technical SEO team at Seer Interactive. I also work part time on the Strategy & Analytics team at Seer, doing primarily backend stuff like data builds and analyses internally for our channel teams. I'm currently open to interesting freelance and white-label enterprise projects, and shooting the shit about day to day work stuff.  (edited)  5 26 1 1 1 1 +3 12 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago RICK! Welcome; so awesome to see you here! 1",
                "Tory Gray   2 months ago RICK! Welcome 1",
                "Noah   2 months ago My Man!  Great to have you here. So stoked you joined. 1",
                "Rick   2 months ago Thanks y'all. I'm looking forward to participating.",
                "Jenna K   2 months ago Yay Rick!!! 1",
                "Crystal Ortiz   2 months ago Hi Rick! 1",
                "Paul Baterina   2 months ago Welcome my gamer friend! I just read your intro. Random note -I remember we did a site migration and our traffic dropped 50%. My seo manager at the time asked me to reach out to you guys for consultation on why. After I reached out to Will, I found the problem. We had no indexed no followed our homepage lol! 1",
                "Rick   2 months ago @Paul Baterina Oh, JFC. That's one of the most embarrassing mistakes ever. How was the rebound once you fixed the homepage?",
                "Paul Baterina   2 months ago Recovered right away haha",
                "Rick   2 months ago Nice.",
                "Adam Humphreys   2 months ago Nice to meet another technical SEO. 1",
                "Rick   2 months ago @Adam Humphreys Thanks bruh. I like your Jay's hat. One of my friends from Highschool pitched for them for a while. 1"
            ]
        },
        {
            "message_text": "Christina Heiser   10:55 PM Hi everyone! My name is Christina, and I'm the content director at Saatva, a luxury mattress company. I oversee content strategy for the brand's blog (and I have @Nick LeRoy helping out with SEO - thank you for the invite to this group!). I'm a journalist-turned-content marketer and have 10+ years experience writing and editing for a variety of digital publications that have a heavy focus on producing SEO-focused content. (In my spare time, I'm also a freelance writer and work with a few clients in the health and wellness space.) I'm looking forward to connecting with everyone here and also broadening my expertise in SEO! 5 27 +3 10 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago CHRISTINA!!!",
                "Christina Heiser   2 months ago Great to see you here, @Kyle !!",
                "Nick LeRoy   2 months ago See what happens when you go to Mozcon @Kyle .. they get addicted!! 2",
                "Paul Baterina   2 months ago Hi Christina!! I was the director of SEO for Sleepadvisor a couple years ago. We definitely reviewed your products lol 1 1",
                "Christina Heiser   2 months ago That's awesome! I hope you liked them, @Paul Baterina !",
                "Jason Wilson   2 months ago Welcome, Christina! 1",
                "Steve DiMatteo   2 months ago Hey Christina! Great to meet another journalist-turned-content-marketer",
                "Christina Heiser   2 months ago Yes, @Steve DiMatteo ! Definitely the best career move I ever made! 1",
                "Crystal Ortiz   2 months ago Hi Christina! 1",
                "Monty   2 months ago Hi Christina, great to have you here. Welcome! 1"
            ]
        },
        {
            "message_text": "Sean Taylor   12:21 AM Hey everyone, just joined via invite from my VP of SEO @Ray Martinez . I'm a Senior SEO Analyst at Archer Education and I've been in SEO for 5 years now. Archer is a higher ed technology company so I primarily work on higher ed sites. I love digging into data and am constantly looking to learn more from SEOs in other industries/backgrounds. Excited to connect with you all! 22 1 1 3 replies Last reply 2 months ago",
            "replies": [
                "Crystal Ortiz   2 months ago Hi Sean!",
                "Sean Taylor   2 months ago Hi @Crystal Ortiz !",
                "Cheryl   2 months ago Welcome, Sean"
            ]
        },
        {
            "message_text": "Miriam Ellis   12:26 AM Hi everybody! Noah kindly invited me to this space. I'm Miriam and I'm the Local Search Data Scientist at Moz. One of the main reasons I'm joining is because I'm finding Twitter less useful as a source of SEO news, and that's making work harder for me. One of my roles is as the writer of the Moz Top 10 newsletter, and I'm looking forward to hopefully seeing more of everyone's work in here. 36 1 1 +5 13 replies Last reply 2 months ago",
            "replies": [
                "Crystal Ortiz   2 months ago Hi Miriam!",
                "Miriam Ellis   2 months ago Hi Crystal!!! So nice to see you in here.",
                "Sarah Blocksidge   2 months ago I love all the art you do and post on Twitter! Perhaps we can get a channel for that :) 1",
                "Miriam Ellis   2 months ago Oh, that is so nice @Sarah Blocksidge ! Thank you. I'm about to relaunch my art site to sell prints. Hopefully by the end of the month. It's really nice to speak with you Sarah. 2",
                "Crystal Ortiz   2 months ago Nice to see you too!",
                "Dana DiTomaso   2 months ago Hi Miriam!",
                "Adam Humphreys   2 months ago Hi, I basically scour different sources of relevant industry news and put it in my group as it comes up. Lately, its been a bit thin haha.",
                "Cheryl   2 months ago Miriam! Hiiii Nice to see you here.",
                "Matt McGee   2 months ago Hi Miriam!!",
                "Areej   2 months ago YAY welcome Miriam!",
                "Miriam Ellis   2 months ago Hello Dana, Adam, Cheryl, Matt and Areej!!! 3",
                "Alex Harford   2 months ago You've been my go-to for local SEO advice for as long as I remember - probably over 10 years. It's good to see you here!",
                "Keri Morgret   2 months ago So good to see you Miriam! You were awesome to work with at Moz and I'm glad to know you're still so active."
            ]
        },
        {
            "message_text": "Taylor Ross   12:33 AM Hi everyone! Im Taylor Ross and Im based in Dallas, Texas. I met Noah this week at Moz Con and was so blown away with him and his brain that I just KNEW I had to join this community. Im super excited to be here! Ive been doing SEO since 2012 (yes, I survived the Penguin update ). Im currently the Technical SEO Manager with my company, but I am also pretty dangerous on the content side I love asking and answering questions, so lets make each other smarter!!!! (edited)  29 3 1 4 replies Last reply 2 months ago",
            "replies": [
                "Crystal Ortiz   2 months ago Hi Taylor!! 1",
                "Adam Humphreys   2 months ago LOL, what a time to join SEO. Thats right when local relevance went hyper and a couple years after things like exact match domains went away. You missed out on all the fun. 1",
                "Cheryl   2 months ago Hi Taylor, welcome 1",
                "Areej   2 months ago Welcome Taylor, it was so nice to meet you at MozCon! 1"
            ]
        },
        {
            "message_text": "Michael Ferrari   1:44 AM Hey everyone! My name is Michael, and Im an SEO consultant based just outside of Philly. I heard about this group a week or two ago and then again at MozCon. So, now Im here to connect with likeminded people and hopefully help answer some questions along the way. Looking forward to joining the conversation! 22 2 4 replies Last reply 2 months ago",
            "replies": [
                "Paul Baterina   2 months ago Welcome! Love your last name!!!!",
                "Michael Ferrari   2 months ago Ha! Thanks, Paul!",
                "Cheryl   2 months ago Welcome, Michael",
                "Areej   2 months ago Welcome Michael!"
            ]
        },
        {
            "message_text": "Hayata Nakamura   5:12 AM Hi I am Hayata, originally from Japan and am an SEO at G2 in Chicago. I see a lot of familiar faces in this Slack and I am excited to join this community! My interest is unlimited, but I specialize in technical SEO and international SEO. @Noah , you nailed it at MozCon! 3 21 1 3 replies Last reply 2 months ago",
            "replies": [
                "Cheryl   2 months ago Welcome Hayata! 1",
                "Dave Ojeda   2 months ago Welcome, glad to see another Chicago native in the group 1",
                "Areej   2 months ago Welcome Hayata! 1"
            ]
        },
        {
            "message_text": "Julian Desmond   8:50 AM Hi I am Julian, I work for an agency that focuses mostly on local SEO for home services and senior living. I am actually just moving into the role of SEO Specialist at the agency and am transitioning from Marketing Specialist. Found out about the group from MozCon and am super stoked to dive in and learn through osmosis with all of you! A community like this was exactly what I was looking for as I dive in and light a fire under me to be valuable in this role! (edited)  3 21 1 4 replies Last reply 2 months ago",
            "replies": [
                "Areej   2 months ago Welcome Julian!",
                "Adam Humphreys   2 months ago Senior care local is a great niche having worked in it personally and trained many to manage it.",
                "Julian Desmond   2 months ago @Areej Thanks Areej! (edited) ",
                "Julian Desmond   2 months ago @Adam Humphreys From my perspective it seems like there is a lot of room for improvement, which gives our agency lots of opportunity! Would love to connect at some point!"
            ]
        },
        {
            "message_text": "Greg Sterling   11:04 AM Hi everyone. I'm Greg. Together with David Mihm and Mike Blumenthal I founded Nearmedia.co. I'm in the SF Bay Area. I've been a marketer, research analyst and content creator mostly focused on search and local for 20+ years. 31 1 2 replies Last reply 2 months ago",
            "replies": [
                "Areej   2 months ago Welcome Greg!",
                "Greg Sterling   2 months ago Thanks"
            ]
        },
        {
            "message_text": "Jenny Bernarde   4:37 PM Hey all! Im Jenny from BrightLocal My job is to help provide a platform for local SEOs, share your insights and knowledge, and find as many opportunities to raise your voices as I can! That includes webinars, the podcast, news articles or blog pieces. Im also behind all of BLs social channels! Ill be keeping a close eye on finding out whats new in local SEO and SEO so I can help report on news and make sure people are aware of new changes in the industry. Im based in Brighton, UK so have probably met a few of you at brightonSEO, but if not, youll see us there again in September so please make sure to say Hi.  (edited)  26 1 1 5 replies Last reply 2 months ago",
            "replies": [
                "Areej   2 months ago YAY welcome Jenny! 1",
                "Nat Arney   2 months ago Hey Jenny! Good to see you here! 1",
                "Jenny Bernarde   2 months ago Hey friends!",
                "Adam Humphreys   2 months ago Neat, Ill be in Brighton for the event. 1",
                "Azeem Ahmad   2 months ago Hi Jenny! 1"
            ]
        },
        {
            "message_text": "James Wirth   8:38 PM Hi all! First time poster, long-time follower (ok, since MozCon day #2 but in SEO time it seems like forever). SEO generalist by background but 3+ years at Citation Labs - a link building agency - focusing on strategy and growth and a little o' everything else. I love digging into data, spend a lot of time on analysis. Honored to be here and excited to learn from everyone! 3 13",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Cherie Dickey   8:57 PM Hello everyone! I'm Cherie. I am so excited this group exists! I used to be a familiar face over at the Local Search Forum, though I haven't had time to be active in quite a while. Back when I was active, I was an SEO Specialist for a digital marketing agency called Vortala. We provide services mainly to chiropractors and dentists, so we live mainly in the healthcare space. I became the SEO Team Leader, and am now the SEM Manager - so a lot more responsibility. Time really became the issue when we began the HUGE project that was migrating over 2,000 websites to GA4, so that's why I've been quiet over at the forum. I've encouraged my team to join me here, I hope that's okay! Anyhoo... nice to meet all of you! 4 1 13 2 replies Last reply 2 months ago",
            "replies": [
                "Noah   2 months ago Wowzers. Id love it if youd share a thread in thr #analytics channel about what that process was like. Lessons learned. 1",
                "Cherie Dickey   2 months ago Hi Noah! Absolutely! It was definitely a learning experience. I will try to find some time next week!"
            ]
        },
        {
            "message_text": "Abby Dorland   10:09 PM Hi all! I'm Abby, and I work at Thomson Reuters as an in-house SEO, mainly focused on content marketing. I'm fairly new to the industry ( ~2 years of experience), so I'm excited to learn from all the smart people on here! 25 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jannell   10:16 PM Hey gang!  Jannell here.  Im a Senior SEO Administrator for Vortala which is a fancy title meaning that I set-up/troubleshoot Google Business Profiles, GA4, Google Search Console, call tracking, and LOTS of other platforms we use for our clients.  Been at this, specifically local SEO, for about 10 years and still feel like I have a lot to learn!  Thanks for putting this group up 20 1 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Simon   10:49 PM Hey all! I'm Simon, an eCommerce SEO expert. I've been doing SEO for more than 10 years now. Happy to be part of this community, already seeing familiar faces i've been following on twitter for years. 17 1 2 replies Last reply 2 months ago",
            "replies": [
                "Paul Baterina   2 months ago What sup Simon!! Would love to share some of that knowledddgeeeee with you in the future. eCommerce SEO expert here as well (10 years coincidence!) Lol. 1",
                "Simon   2 months ago Hey, sure would love that. We can bounce different ideas off of each other. Feel free DM me at anytime."
            ]
        },
        {
            "message_text": "Joe Hall   12:30 AM Hey all! My name is Joe Hall. I am an SEO consultant and web developer. Sometimes I come across as rude on social media (I think because of some un-diagnosed issues with anxiety), sorry about that.. But I am a lot nicer in my human form and slack feels more human to me than other types of social media. So I am excited to be here and be human with all of you. Some non SEO things about me: I enjoy seafood, cold drinks, T-shirts, hats, coffee, good books, good art, music, poetry, kung fu movies, space, making things with code, and spreadsheets. 38 6 +3 18 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago Favorite kung fu movie?",
                "Donna Donahue   2 months ago Welcome Joe!  I remember you fondly from my first MozCon in 2015 or 16 don't remember which. I just remember watching your presentation and thinking to myself \"I will not ever be as smart as that guy in this lifetime\"",
                "Donna Donahue   2 months ago So I'm kinda fan girling over here there you answered a question for me today",
                "Joe Hall   2 months ago @Donna Donahue thats very nice of you to say because I thought I did a really bad job on that talk. LOL The one I did last year was so much better. But thank you for the kind words.",
                "Donna Donahue   2 months ago You should pitch for DMO in October, I'm going to that",
                "Joe Hall   2 months ago @Kyle recent ones probably IP Man, and then classics anything with Bruce Lee. 1",
                "Donna Donahue   2 months ago Okay more importantly. Starwars or Startrek?",
                "Donna Donahue   2 months ago err, Star Wars, my husband would fire me right now for that",
                "Joe Hall   2 months ago i actually love both. I really depends on what mood I am in.",
                "Donna Donahue   2 months ago baby yoda (2 MB) https://media1.giphy.com/media/Wn74RUT0vjnoU98Hnt/giphy.gif?cid=6104955eaqqqorrl0tz923tywgkrfl42m907ckagjjtjmgjk&ep=v1_gifs_translate&rid=giphy.gif&ct=g Posted using /giphy | GIF by Mobius",
                "Donna Donahue   2 months ago great answer ;)",
                "Areej   2 months ago You're one of the nicest people I ever met. We missed you at Mozcon this week! 1",
                "Adam Humphreys   2 months ago Ive come to appreciate its best to just ask better questions when someone says something that comes across blunt lol.",
                "Donna Donahue   2 months ago Same Adam, I'd rather someone ask me. As I always say you don't ever have to wonder where you stand with me, I'll let you know",
                "Donna Donahue   2 months ago I always love to hear \"I think Donna doesn't like me\" trust me if I don't like you, you won't have to think about it",
                "Jason Wilson   2 months ago Nah Joe, I have followed for a while and youve always seemed like a solid guy. Never greedy with resources or egotistical.",
                "Nat Arney   2 months ago Good to see you here Joe! 1",
                "Rick   2 months ago I hope you have a good therapist for the anxiety issues. Diagnosis is the first step to healing, and it's done wonders for me, personally. Good luck brother."
            ]
        },
        {
            "message_text": "Claudia   1:36 AM Hi All, my name is Claudia. I own Reputation Arm a reputation management dashboard. I am also a Google Product Expert for Google business Profiles. Happy to be here. 20 2 5 replies Last reply 2 months ago",
            "replies": [
                "Donna Donahue   2 months ago Hi Claudia welcome. @Ben Fisher is also here The local SEO channel would be a great place for you to hang. I'm sure many people will have lots of questions for you",
                "Colan Nielsen   2 months ago Hey Claudia",
                "Claudia   2 months ago",
                "Jason Wilson   2 months ago Hi Claudia! I love rep management. One of the most fun types of SEO!",
                "Jason Wilson   2 months ago Welcome"
            ]
        },
        {
            "message_text": "dawood ahmad   5:36 AM Hello everyone, I am Dawood. I am an SEO beginner who switched careers after 30.I am happy to be a part of this community. :) 15 2 replies Last reply 2 months ago",
            "replies": [
                "Jason Wilson   2 months ago Work ethic is a great equalizer, Dawood! There are soooo many good resources now. Sometimes I wish I could start over. It was much harder to learn when I started doing SEO. Tap into the community here for help and you will do great! Welcome!",
                "dawood ahmad   2 months ago Thank you Jason for your kind welcome. I will try to participate as best as I can. :)"
            ]
        },
        {
            "message_text": "Ciarn  Muiris   3:47 PM Hello all! My name is Ciarn  Muiris. I've been an SEO for over 9 years and this is my day one of being a freelance SEO consultant! Most recently I worked as a Senior SEO Specialist at a large fintech company (up until yesterday), as well as as a SEO Specialist and SEO Manager at three different marketing agencies in the UK and Ireland. I am excited to be here with all of you. Some non SEO things about me: I enjoy Gaelic football, playing and listening to music (traditional Irish music being my favourite), the Irish language (I am bilingual), strength and mobility training, reading and good conversations 19 1 1 5 replies Last reply 2 months ago",
            "replies": [
                "Michael Ferrari   2 months ago Welcome, and congrats on going freelance! Ive been doing freelance for over 7 years and I can tell you its extremely rewarding! Feel free to DM if you have any questions while youre starting out.",
                "Kyle   2 months ago Welcome Ciarn! I love traditional Irish music (will be going to Irish fest in Milwaukee this next weekend) and youd probably laugh if you heard it, but I played in an Irish folk punk band for about 13 years. What do you play and any favorite songs?",
                "Ciarn  Muiris   2 months ago Thank you so much @Michael Ferrari and @Kyle ! @Kyle I play the bodhran, though my playing has been very hampered the last 18+ months as I had a serious elbow injury last year along with surgery, and another surgery recently to fix a complication- but I hope to get back to it soon! Also tempted to pick up another instrument e.g. concertina! Very cool that you play, what instrument? Seeing as you're a punk guy, The Pogues must be right up your street?! My favourite songs are pretty much anything traditional and in the Irish language. Hard to beat the classics like \"Mo Ghile Mear\" and \"Samhradh, Samhradh\"! Bands like Altan, Clannad, Planxty etc. Also the Saw Doctors who are more rock than traditional! 1",
                "Kyle   2 months ago Love the bodhran! I hope your recovery goes well and quickly I played bass - stopped playing after my second was born. Lots of pogues though! The repertoire was nearly a 50/50 split of originals written on traditional jigs/reels and covers. Ive got some listening material now - thank you for the songs and bands!",
                "Ciarn  Muiris   2 months ago Thank you sir! Ooh love the bass. I dabbled in a bit of it during the lockdowns just so I could play a few U2 basslines, but later sold it when my injury happened. Let me know how you get on with the tunes and I'll be delighted to recommend any more! 1"
            ]
        },
        {
            "message_text": "Edwin Romero   6:21 PM Hello everyone! I'm an SEO consultant; I went independent about 2 years ago and it's been a ride building up my portfolio, managing a business, and staying up to date in the space.  I work in the e-commerce but I love growing SEO advocacy among internal client stakeholders.  Fun facts about me: I enjoy night time reading I can play the guitar, drums, and bass I've lost count how often I've re-watched Seinfeld and Good Fellas Im hoping to learn, build relationships and share knowledge! 24 1 1 3 replies Last reply 2 months ago",
            "replies": [
                "Jason Wilson   2 months ago Ya Edwin! Glad to see you in here bro. Let's build! 1",
                "Mark Howser   2 months ago @Edwin Romero Fancy running into you here 1",
                "Edwin Romero   2 months ago @Mark Howser glad to see you hear bud!"
            ]
        },
        {
            "message_text": "Houston Jayne   8:57 PM Sup Y'all, looks like a great community and look forward to learning and sharing. Thanks @Daniel Morrison for the invite! 16 1 1 reply 2 months ago",
            "replies": [
                "Jason Wilson   2 months ago Welcome, Houston!"
            ]
        },
        {
            "message_text": "Jono Alderson   1:02 AM 22 2 4 replies Last reply 2 months ago",
            "replies": [
                "Jason Wilson   2 months ago Welcome, Jono!",
                "Jono Alderson   2 months ago Thanks!",
                "Adam Humphreys   2 months ago 1",
                "Azeem Ahmad   2 months ago Here he is! 1"
            ]
        },
        {
            "message_text": "Milica Kovacevic   3:42 PM Hello everyone, I'm Milica, a freelance SEO consultant from Serbia. I worked in e-comm and NGO sectors, and I love both. At the moment I'm working for a small green affiliate website, and working on my own website all by myself starting from scratch I followed @Edwin Romero here. He is a LinkedIn connection and an amazing SEO consultant who taught me a lot about Salesforce Commerce Cloud SEO. I try to balance my passion for digital work with physical world. I live on a small farm with my family. In my free time (which doesn't come often) I love reading (history nerd) and learning new languages! Thank you for having me! 21 2 3 5 replies Last reply 2 months ago",
            "replies": [
                "Jason Wilson   2 months ago Welcome, Milica! Agree, Edwin is a great guy and he knows his stuff! 1 1",
                "Edwin Romero   2 months ago Thank you two so much for the shoutout! 1",
                "Milica Kovacevic   2 months ago Indeed he does! Without him my ecomm migration from WP to SFCC wouldn't be a success",
                "Monty   2 months ago Hey @Milica Kovacevic . So nice to see you here, welcome! 1",
                "Milica Kovacevic   2 months ago Thank you, @Monty ! Thank you all for having me 1"
            ]
        },
        {
            "message_text": "Ajit Kular   8:11 AM Hello everyone, Excited to be part of this SEO community! I have 10 years of experience in SEO where I mostly worked with Ecommerce clients. In 2019, I started a small SEO and Growth Marketing agency and now mostly working with Sustainable Ecommerce brands and NGOs in fundraising etc. I am excited to be a part of this amazing community and looking forward to contribute and learn from everyone. 16",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Ramesh Singh   9:09 AM Hi Everyone! This is Ramesh Singh from Noida, India. I'm a full-time SEO professional working with SEO Industry for more than 17 years now. Worked for different industries from startup to billion dollar unicorn companies. Currently serving at Great Learning as Head of SEO. I'm also an Google Product Expert for search central (Webmasters). I'm excited to be part of this community, looking forward to know you all and learn from each other. 17 1 3 replies Last reply 2 months ago",
            "replies": [
                "Dave Smart   2 months ago Hey @Ramesh Singh ! Great to see you here!",
                "Ramesh Singh   2 months ago @Dave Smart same here. Glad that you are here. Most of the SEO troubles get solved easily now",
                "Ramesh Singh   2 months ago Thank you everyone"
            ]
        },
        {
            "message_text": "Joost de Valk   1:40 PM Hi! Joost, founder of Yoast, now investor. 45 5 2 1 1 2 replies Last reply 2 months ago",
            "replies": [
                "Adam Humphreys   2 months ago Who? Lol . I remember in 2011 sitting at the table and you explaining to us the name origin of the phonetics of the business. Even now, I wonder how many people actually know that.  (edited) ",
                "Shayan Nabi   2 months ago Yoast has been of great help B"
            ]
        },
        {
            "message_text": "Shayan Nabi   8:31 PM Hi, this is Shayan Banday, a digital marketing consultant based in Kashmir. I have recently started an agency and our expertise are SEO and SEM 14",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Dian Puspasari   8:37 PM Hey all! Im Dian based in Louisiana, USA. Im mainly doing Local SEO. Ive only been in SEO for two years, soooo still a lot to learn! Glad to be here and so excited to learn from the experts in the community! 18 5 replies Last reply 2 months ago",
            "replies": [
                "Paul Baterina   2 months ago Great to meet you @Dian Puspasari ! I've been doing SEO for 10 years, and I no jack squat about Local SEO! So I can't wait to learn from you as well! 1",
                "Dian Puspasari   2 months ago Wow 10 years, thats amazing!! Surely we can learn from each other. Thanks for the warm welcome!",
                "Crystal Ortiz   2 months ago Hey!!!!! 1",
                "Dian Puspasari   2 months ago Crystal!   Glad to see you here! Shes my SEO mentor btw yall  (edited)  1",
                "Crystal Ortiz   2 months ago Glad to see you, too!! 1"
            ]
        },
        {
            "message_text": "John Lavapie   8:44 PM Hey Everyone! Im John - working at a digital marketing agency in Edmonton, Alberta, Canada! Its so nice to e-meet you all! 5 16 8 replies Last reply 2 months ago",
            "replies": [
                "Jess Joyce   2 months ago Hey John! WELCOME! Im in Toronto, bit of a skip/jump but love to see more Canucks here 1",
                "Jess Joyce   2 months ago We also have @Tory Gray whos in Toronto as well (but is away on vacation so she may not reply - stay off your phone Tory!)",
                "Tory Gray   2 months ago :waves from cottage country!: 1",
                "Dana DiTomaso   2 months ago Hey John!",
                "Jess Joyce   2 months ago ^^^^ OMG DANA is here too! YESS! 1",
                "John Lavapie   2 months ago Oooo! Hi @Dana DiTomaso !   Love your work so much!!!",
                "Dana DiTomaso   2 months ago Thank you! 1",
                "Adam Humphreys   2 months ago Calgary"
            ]
        },
        {
            "message_text": "Robert Spinrad   8:59 PM Hey all I'm Robert Spinrad, Associate Director of SEO at SEOM Interactive. We're a full service agency operating outside of Philadelphia. I attended MozCon and probably chatted with a few of you there. After hearing @Noah 's presentation, I was inspired to join this community! Looking forward to connecting with you here and on X/Linkedin 20",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Mark Howser   9:14 PM Hey everyone! My name is Mark Howser, and I'm the Senior Manager of SEO for Helium 10, a software solution for Amazon and Walmart sellers. I'm based out of Broomfield, CO (right between Boulder and Denver). Happy to be apart of the community! My long-term vision is to work as a Freelance SEO Consultant for Ecommerce outdoor brands, and I'd love any tips (especially sales tips) along the way! (edited)  23 11 replies Last reply 2 months ago",
            "replies": [
                "Noah   2 months ago MAAAAAARRRRRK!  Meal at Snooze soon?",
                "Mark Howser   2 months ago @Noah absolutely! Their menu looks Just name a day and time and I'd be down! Maybe we could convince @BJ Enoch to take a day off from fly fishing and drag him along!",
                "Noah   2 months ago Thats a big drive for him",
                "Mark Howser   2 months ago Yeahhhh probably not gonna happen but worth a shot haha",
                "Mark Howser   2 months ago I used to work with him at SocialSEO",
                "Noah   2 months ago 100%.  You got me thinking about doing a city meet up though. (edited) ",
                "Mark Howser   2 months ago I'd definitely be down. Didn't they used to have SEO meetups at Punchbowl Social in downtown Denver? Not sure if that's still going on",
                "Dylan Jones   2 months ago Hey Mark! Hope you're doing well!",
                "Mark Howser   2 months ago @Dylan Jones back at ya!",
                "Adam Humphreys   2 months ago Interested to learn more. I talk to people in this space all the time.",
                "Mark Howser   2 months ago @Adam Humphreys feel free to reach out anytime! 1"
            ]
        },
        {
            "message_text": "Joel Messner   1:06 AM Hey everyone! I'm Joel Messner, the SEO Lead at Konstruct Digital, an agency based in Calgary, Alberta, Canada. We are B2B focused and have been around for over 10 years now. I'm excited to be part of this community and contribute where I can! 26 4 2 replies Last reply 2 months ago",
            "replies": [
                "Jason Wilson   2 months ago Right on, another B2B guy! Welcome.",
                "Joel Messner   2 months ago Thanks @Jason Wilson . Definitely love finding other B2B SEOs to share ideas with. 1"
            ]
        },
        {
            "message_text": "Mitch Lown   8:06 PM Hey everyone! I'm Mitch Lown, the Director of Performance Marketing overseeing both Paid and SEO across NBC Sports Next & Fandango Media. Excited to connect with you all! 33 1 reply 2 months ago",
            "replies": [
                "Jason Wilson   2 months ago Welcome, @Mitch Lown"
            ]
        },
        {
            "message_text": "Emily Pickelhaupt   6:37 PM Hi Everyone! I'm Emily Pickelhaupt (dog pic cause hes adorable). Based out of Asheville, NC. SEO Strategist at CNET, formerly ran REI's Content program on its learn section and blog. Excited to meet everyone and build a network as i start to venture into potentially full time freelance! AE7I3968 (1).jpg  37 5 +4 10 replies Last reply 1 month ago",
            "replies": [
                "Mike Blazer   2 months ago Hi Emily. Nice to see you there. Were you involved in CNET's content pruning thing that many SEOs have been chatting about the past few weeks?",
                "Emily Pickelhaupt   2 months ago I actually wasn't - that was done by our technical SEO guy but i do get insights on the results 4",
                "Crystal Ortiz   2 months ago Hi Emily! Whats your dogs name?!",
                "Jason Wilson   2 months ago Hi Emily! Nice to meet you. Welcome.",
                "Nico Brooks   2 months ago OMG HENRY!!!! So great to see you here! Great to see you too Emily 2",
                "Matthew Kay   2 months ago Hello @Emily Pickelhaupt fellow North Carolinian here I am based in Raleigh! 1",
                "Natheem   2 months ago Hey @Emily Pickelhaupt Good to see you here. 1",
                "Emily Pickelhaupt   2 months ago @Crystal Carter Henry! and hes the best, as @Nico Brooks can attest 1",
                "Nick LeRoy   2 months ago Welcome -- definitely come check us out in the #freelance section too!",
                "Maggie Castle   1 month ago Hi Emily!! 1 1 1"
            ]
        },
        {
            "message_text": "Pedro Da Silva   10:32 PM Hey everyone! Just joined the group yesterday as Slack says, my name is Pedro Da Silva, SEO manager at Asurion and owner at Thrive Local Marketing. Currently a Bronze Google Product Expert, and working on providing more valuable information and resources on the GBP forum. Excited to get to know everyone here, and share our crazy finds! IMG_3895  23 9 replies Last reply 2 months ago",
            "replies": [
                "Jason Wilson   2 months ago @Pedro Da Silva welcome!",
                "Pedro Da Silva   2 months ago Thank you, Jason! 1",
                "Jess Joyce   2 months ago Welcome! You have a beautiful family omgoodness!!!",
                "Pedro Da Silva   2 months ago Thank you! They really are :)",
                "Jess Joyce   2 months ago The little wave, omg my heart",
                "Eloise West   2 months ago Nice to meet you, Pedro! And thank you  you inspired me to read about the Google Product Expert program and sign up",
                "Pedro Da Silva   2 months ago That is awesome! Let me know how I can help :) (edited)  1",
                "Monty   2 months ago Welcome, Pedro! What a beautiful family picture 1",
                "Pedro Da Silva   2 months ago Thank you!"
            ]
        },
        {
            "message_text": "Lisa Michetti   2:40 AM Hi hi! I'm Lisa, director of operations at Adster Creative. We're a small digital agency here in Edmonton, Canada but I'll be local to Vancouver in about 10 days!  So happy to be part of the group so I can ween myself off of....OTHER social media places.  I don't do as much SEO work as I used to, leaving much of it in our incredible team's hands, but I love staying up to date with what's happening in digital. 21 3 replies Last reply 2 months ago",
            "replies": [
                "Dana DiTomaso   2 months ago HI LISA!! We're practically going to be neighbours! (edited) ",
                "Lisa Michetti   2 months ago Hi Dana!!!! YES!! So excited for that west coast life!! 1 1",
                "Pedro Da Silva   2 months ago Welcome to the group Lisa! and Vancouver is a beautiful city  (edited)  1"
            ]
        },
        {
            "message_text": "Ash Nallawalla   4:11 AM Hi, I'm Ash in Melbourne, Australia. I work in-house at Carsales, a multinational car and vehicle marketplace platform, but most of my focus is on the Cars brand here. We have international calls with our SEO counterparts in Brazil and the US every six weeks. We also have an SEO agency that adds a few people as required. Doing SEO for well over 24 years and want to slow down, so I will go solo next month and finish writing my three-book set, which started with \"Accidental SEO Manager\" (at Amazon) last year. 24 4 replies Last reply 2 months ago",
            "replies": [
                "Nico Brooks   2 months ago Hey Ash, I think we worked together a bit when you were at Sensis and I was at Local Matters. Fun to see you here and welcome! 1",
                "Pedro Da Silva   2 months ago Welcome Ash! Excited to hear from you 1",
                "Ash Nallawalla   2 months ago Thanks for the welcomes. Yes, Nico. Nice to reconnect.",
                "Adam Humphreys   2 months ago You made it!"
            ]
        },
        {
            "message_text": "Graham  Maonaigh   11:14 AM Hi all, I'm Graham in Dublin, Ireland . I run a full-stack Marketing Agency, Abstract Innovation mainly working with Tech/Saas startups in Seed Stage and Series A. Previously I led SEO at Intercom for two years and have worked in SEO since 2003 in some shape or form. The last few years I've taken more of a JTBD methodological approach to SEO for clients and seen huge benefits to this. Aligning the SEO problems to customer problems (which is closer to business success) sees rapid results for those I've worked with. Looking forward to learn and help in all directions. Say hi  (edited)  graham-o-maonaigh-landscape-2022.jpg  8 19 7 replies Last reply 2 months ago",
            "replies": [
                "Natheem   2 months ago Hey @Graham  Maonaigh welcome 1",
                "Monty   2 months ago Welcome, Graham 1",
                "Donna Donahue   2 months ago Welcome Graham! Hello from sunny Arizona 1 1",
                "Pedro Da Silva   2 months ago Love it Graham! I've been seeing how SEO is highly involved in branding and customer solutions. At times, we tend to look at SEO as a \"free ads\" tool, when in reality, it's a lot more than that. 1",
                "Ciarn  Muiris   2 months ago Welcome @Graham  Maonaigh ! Nice to have a fellow Irish SEO in here! 1 1 1",
                "Donna Donahue   2 months ago My last name is Donahue, does that count? 1 1",
                "Donna Donahue   2 months ago Thank you, I feel validated now. 1"
            ]
        },
        {
            "message_text": "Alessio Nittoli   9:01 PM Hi Everyone! Thanks @Noah for putting together this community! My name is Alessio and I work as technical SEO for EssilorLuxottica, the corporation behind Ray-Ban/Oakley and other 140+ eyewear brands. When I am not busy walking my two dogs, I dabble in coding trying to build tools to automate repetitive tasks. Outside of nerdy things, I am studying to become a canine trainer , I love go hiking whenever I can and messing around my guitar Excited to be here and making new friends! 24 2 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Clif   12:10 AM Hey everybody - figure it's time to say hello My name is Clif, great to meet everyone here. I started in SEO back in my teens in the early 2000's, learning with some local e-commerce businesses after I got out of the warehouse and into the A/C. I built a few of my own e-commerce businesses through college, like The Early Hours Clothing, before I burnt myself out and decided to officially join the tech world. I joined Outdoorsy early on and built their entire programmatic SEO network with some great mentors in product-led search - even convinced them to give me a squad of engineers. After, I joined workstream.us, and built a programmatic program for employer and applicant acquisition before moving more into core product. A month ago, I left the startup world full time to consult with all types of businesses, including early stage marketplaces, coaching businesses, e-commerce, and more. I love search, I love helping others, and I've got a few quiet side projects. I specialize in programmatic, product-led SEO, but I'm OK at a lot of things. Otherwise, I love spending time with my wife and dogs, reading, exploring central Texas, cooking good food, and gardening and decorating our house. I actually have a fine arts degree from SAIC in Chicago, and love making art and doing some design work in my free time. Excited to get to know y'all! 1 14 7 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago @Clif welcome! i was enrolled at SAIC coming out of high school. was going to major in computer animation, but then change my mind last minute to pursue music ed. you can guess how good of a choice that ended up being awesome background you've got and in such a great space (RV).",
                "Clif   2 months ago amazing @Kyle - I was going to study Industrial Design, then Graphic Design...something practical... and ended up with a degree in Fiber and Material Studies. It's going to good use. Can't say we won't find a way though... 1",
                "Jonas Sickler   2 months ago Welcome to the group @Clif ! It sounds like youve figured out exactly what you want in a career. Thats gold. Knowing what you love doing, what you dont, and where you fit in is the key to living a fulfilling life. 1",
                "Clif   2 months ago @Jonas Sickler thanks for the warm welcome! 1",
                "Noah   2 months ago welcome aboard (2 MB) https://media4.giphy.com/media/Ae7SI3LoPYj8Q/giphy.gif?cid=6104955e8eqwxrp6mzuz3ki20kfwopel9ijulwsh8a9m3ble&ep=v1_gifs_translate&rid=giphy.gif&ct=g Posted using /giphy",
                "Noah   2 months ago Programmatic is one of many areas Id like to learn more. 1",
                "Clif   2 months ago @Noah would love to chat! I've built and assisted sites up to 100m+ pages, and other use cases that worked beautifully in the 5-100k range. now we're in a new era, and it's evolving rapidly!"
            ]
        },
        {
            "message_text": "Bridget Sandine   12:18 AM Hello folks - happy Friday y'all. I'm Bridget from the Chicago area I've been in the seo biz since 2007, back when buying links were a thing. I've been on the agency side for a while, but now staying busy building the SEO practice at Becton Dickinson (BD). I'm excited to join, connect and learn from you sharp people! 14 1 1 reply 2 months ago",
            "replies": [
                "Jonas Sickler   2 months ago Welcome @Bridget Sandine ! What an interesting space to be working in. I was looking at the medical device space several months ago while building some market share reports. How much of the space is informational vs transactional search intent? Do you see mostly the need for product/category pages, or articles as well?"
            ]
        },
        {
            "message_text": "Sam Knight   12:22 AM Hey ya'll! Excited to join this community. Thanks for posting it on Linkedin @Noah . I'm the Director of Digital at a behavioral health hospital in Columbus, OH, where our primary vertical is SEO. I'm a Gold Product Expert for Google Business Profile and the vast majority of my experience has been local SEO, primarily duress categories like addiction treatment and PI attorneys. I worked for several agencies before moving in-house to my current role about 2 years ago. On the side, I also dabble with my own affiliate marketing sites, e-comm dropshipping, and lead gen. In my free time I love the outdoors - foraging wild mushrooms, hiking, fishing, hunting, or playing at the dog park with my Coon Hound, Ellie 12 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Dave Snyder   12:46 AM Hey everyone - I am Dave Snyder. I am the current CEO of CopyPress, but I have been in the SEO, Marketing, Content spaces for a long time. I love helping other marketers and agency owners. I am not great at talking about me, so that is all. 20 2 replies Last reply 2 months ago",
            "replies": [
                "Jonas Sickler   2 months ago Great to meet you @Dave Snyder ! Ive known Jeremy Rivera for a while now. Hes a swell guy and youre lucky to have him",
                "Dave Snyder   2 months ago He's a ray of sunshine 1"
            ]
        },
        {
            "message_text": "Holly Miller Anderson   1:03 AM hey everybody, I'm excited to be joining the party here! Can't believe I haven't joined sooner, there are so many familiar faces. Thanks to @Paul Baterina for the invite and @Noah for the LinkedIn post   Quick intro on me: I'm Holly Miller Anderson. I'm currently an SEO Product Manager at Under Armour. In the past I've worked at agencies, in-house enterprise brands and done some freelance consulting. I help brands grow online and integrate SEO as a process.  I'm now in Louisville, KY by way of the Bay Area (shout out to @BaySearch peeps) . Love wine, cheese, fitness talking digital shop and newly learning about bourbon. 12 12 +1 6 replies Last reply 2 months ago",
            "replies": [
                "Paul Baterina   2 months ago @Holly Miller Anderson !!! WOO HOOOO!!!! 1",
                "Kyle   2 months ago @Holly Miller Anderson ! Welcome! 1",
                "Adam Humphreys   2 months ago Forgot squirrels",
                "Micah Fisher-Kirshner   2 months ago Holly!!",
                "Noah   2 months ago Holllly!!!",
                "Azeem Ahmad   2 months ago Hello!"
            ]
        }
    ]
}