{
    "messages": [
        {
            "message_text": "Cynthia Lopez Olson   11:07 PM Hi everyone! My name is Cynthia. I'm currently the SEO Manager at Lucid Software. Ive worked in digital marketing for over 9 years, and over the past 6 years Ive focused on SEO. I'm from Southern California (and currently living here!), but I spent most of my 20s working abroad in China, South Korea and Germany. I also studied abroad in Italy while at university. Outside of SEO, I enjoy the outdoors (hiking, kayaking, beach days). Im a fan of Italian wine, thanks to my time in Italy, and enjoy wine tasting. I also enjoy traveling, learning new languages and eating/discovering different foods/dishes. I'm excited to be a part of this community! 2 17",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Logan Bryant   6:24 AM Hey SEO compatriots! I'm Logan Bryant... SEO and B2B SaaS consultant in the game since 2011. I run my solo consultancy / title tag software and I dig the groups that @Noah has been building. I've worked agency, in-house, and more recently built a small solo-consultancy + title tag software. When I'm not eyelid-deep in SEO, I absolutely LOVE to get outside for some watersports! Wakeboarding and kiteboarding in-particular. Currently based in Miami, but I've also lived in San Francisco, grew up in Vegas, and spend time in Utah & the Philippines. Hit me up anytime SEO fam! 1 12 1 2 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago Logan! Welcome!",
                "Logan Bryant   3 months ago Yo @Kyle !"
            ]
        },
        {
            "message_text": "Lianne Jones   2:28 PM Hey everyone, my name is Lianne and I'm based in the UK. I've been working in SEO for 13 years and now I'm freelance after recently being made redundant. Glad to be part of this community. 13 1 1 1 4 replies Last reply 3 months ago",
            "replies": [
                "Iman   3 months ago Welcome welcome.",
                "Lianne Jones   3 months ago Thank you! 1",
                "Jon Holt-Thomas   3 months ago Drop me your details in case I need some freelance help - also in the UK 1",
                "Lianne Jones   3 months ago Hey @Jon Holt-Thomas I'll pop you a message now"
            ]
        },
        {
            "message_text": "Jon   3:14 PM Good morning all! I'm Jon Robinson, SVP of Digital Media at Consumer Attorney Marketing Group, former COO of Launch That (spent 7 years among the likes of asbestos.com, drugwatch.com, annuity.org and others)  and had a stop along the way as VP of Growth and Operations at Litify before joining CAMG. Based in Orlando but a native NYer. Happy to have found this place. Feel free to connect! 17",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Karen Hopper   6:19 PM Hello! I'm Karen Hopper, Sr. Director of Performance Marketing at Bully Pulpit Interactive. We're primarily public affairs and advertising, but we are developing more advanced marketing and content practices (hence my recent move here). I've met several of you at MozCon (I gave a talk on testing in 2022!) and at CMWorld, and am here to absorb as much as possible about SEO and content development/promotion, and to help y'all out with anything testing/data analysis related. Can't wait to make the most of Twitter's demise in this lil community. 17 2 1 4 replies Last reply 3 months ago",
            "replies": [
                "Cheryl   3 months ago Karen!! It's so nice to see you in here 1",
                "Karen Hopper   3 months ago ahhhh hi!!! 1",
                "Niki Mosier   3 months ago Wooo! Hi! 1",
                "Emily Brady   3 months ago Hiii! 1"
            ]
        },
        {
            "message_text": "Emily Brady   7:35 PM Hi all! My name is Emily and I am currently an in-house SEO for a SaaS company, but have spent a lot of time agency-side and in the local SEO space in the past. If you were at MozCon 2022, you might remember me from my community speaker talk on content and schema for location pages. Looking forward to connecting with y'all! 6 16 1 1 4 replies Last reply 3 months ago",
            "replies": [
                "Noah   3 months ago Seattle?",
                "Emily Brady   3 months ago For MozCon? I wont' be there this year sadly! (I live in Brooklyn) 1",
                "Tory Gray   3 months ago Welcome! Hope to meet you in person at Mozcon! 1",
                "Cheryl   3 months ago Yay, Emily! Really cool to see you in here 1"
            ]
        },
        {
            "message_text": "Areej   7:57 PM Heeeey all, it's great to be here  Thanks for the invite Noah and for creating this awesome group! I'm Areej, UK-based. I spend half my time on Crawlina, my independent SEO consultancy, and the other half on Women in Tech SEO (community, initiatives and festivals) Few conferences coming up that I'll be attending/organising, hope to see some of you here and there - MozCon in Seattle, BrightonSEO in UK and WTSFest in Philly, over the next 2 months! Look forward to meeting/reuniting with lots of you in person Thanks for creating this space, with Twitter/Threads/LinkedIn - who knows what else, it's all up in the air, it's so good to have a space with everyone in one place 9 24 1 2 1 4 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago Areej! Welcome - so glad to have you here! 1",
                "Noah   3 months ago So glad youre here @Areej ! 1",
                "Tory Gray   3 months ago YAY welcome @Areej ! 1",
                "Cheryl   3 months ago hi Areej, welcome! 1"
            ]
        },
        {
            "message_text": "Jackie C   11:04 PM Hi yall My name is Jackie and I'm currently the Web Intelligence and Infrastructure (web product) lead at Uber based in San Francisco, CA. Been a little quiet on Twitter as Im closing out some really big, multiyear projects and my scope abruptly changed a lot but so excited to be here too 5 23 7 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago JACKIE!!!",
                "Jackie C   3 months ago Haha hi Kyle long time no talk!",
                "Kyle   3 months ago you got that right (2 MB) https://media0.giphy.com/media/fXEhRluF0JYNzXigGO/giphy-downsized.gif?cid=6104955ecgu8ulqign9phti0cfj65jm260irmt2c0up5ucc6&ep=v1_gifs_translate&rid=giphy-downsized.gif&ct=g Posted using /giphy | GIF by Schitt's Creek",
                "Tory Gray   3 months ago Welcome, @Jackie C !",
                "Jackie C   3 months ago Thx Tory 1",
                "Cheryl   3 months ago Jackie, hi hi hi!!!",
                "Victor M Pan   3 months ago"
            ]
        },
        {
            "message_text": "Nathan Driver   1:21 AM Hey all - name is Nathan, i'm a media - marketing - geek! Currently residing in SouthWest Ohio and work as an SEO manager for agency that focuses on home services. I've been doing SEO for over 15 years from finance to the news industry. Would love to connect with you: https://www.linkedin.com/in/ndriver/ 11 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Donna Donahue   1:35 AM Welcome Nathan",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "@Nathan Driver sells himself short, he's one of the best technical SEOs I've ever worked with, and an absolute schema guru",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Nathan Driver   1:36 AM hahaha thanks @Donna Donahue - always love learning !",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Donna Donahue   1:38 AM well of course, but still",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Dan Rice   1:42 AM Hey everyone I'm Dan Rice and as of September I'll be assessing Digital Marketing Apprenticeships at Totton College I've built my experience at multiple agencies, funded startups, freelancing and client side with SMEs. From the names I know here, the impostor syndrome in me is strong, this has some serious potential!!! Looking forward to getting involved more here and if I can ever help you, it's always worth asking :D Would love to connect with some of you on Linkedin - https://www.linkedin.com/in/danielrice85/ 11 1 8 replies Last reply 3 months ago",
            "replies": [
                "Dan Rice   3 months ago Forgot to mention I am from Winchester (ish) in the South of England!",
                "Noah   3 months ago One of the most important things Ive learned is that every single one of us are just people. The goal of this community is to flatten our community so we can get to know each other as real people. 2",
                "Tory Gray   3 months ago Hi @Dan Rice , lovely to see you here :D 1",
                "Shawn   3 months ago I feel your imposter syndrome big time 1",
                "Donna Donahue   3 months ago hi @Dan Rice Imposter syndrome is such a real thing, but I have learned to deal with it by not letting my pride stand in the way of my learning from those who have been there and done that. I have met some really great people by not being afraid to ask for help 2",
                "Shawn   3 months ago Amen to that - that is probably my best aspect, my willingness to approach other SEOs that I see on stage and just say hi. Have met some great folks in the industry from that",
                "Dan Rice   3 months ago @Donna Donahue it is very true, you need to be open to learning new things. In fact about half an hour ago I was on threads banging on about learning and being open to being bad at something if you ever wanted to get good at it!",
                "Donna Donahue   3 months ago I've learned a lot in just 5 short years that I've been totally focused on SEO. You're in good company"
            ]
        },
        {
            "message_text": "Lily Ray   1:54 AM Ok fine Ill bite. Hey all 7 4 4 20 2 2 +4 10 replies Last reply today at 6:37 PM",
            "replies": [
                "Kyle   3 months ago LILY!!! 1",
                "Lily Ray   3 months ago",
                "Tory Gray   3 months ago Yay, Lily! 1",
                "Areej   3 months ago YAY! 1",
                "Jason Wilson   3 months ago Eat, DJ, Sleep, Repeat! Did I get that right?! 1",
                "Jason Wilson   3 months ago SEO, DJ, Sleep, Repeat? 1",
                "Cheryl   3 months ago Lily, hello!! 1",
                "Jackie C   3 months ago Imagine when your intro can be fine hi   3 1 1 1 1",
                "Victor M Pan   3 months ago So sorry youre here. 1 1",
                "Jonas Sickler   3 hours ago Hey! Didnt realize you were in this group Lily. Ive really enjoyed the interactions with folks here."
            ]
        },
        {
            "message_text": "Donna Donahue   1:54 AM hey Lily! 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Robin   2:44 AM Hey all, excited to be here! Unfortunately not as much of a rockstar as Lily that I need no introduction. I'm Robin, formerly an SEO Consultant but my my dabbling in tech and strategy slowly overtook more and more of my worklife and now I'm \"something something Innovations\" at an agency called Aira. I do quite a lot of measurement, tool building, strategy stuff and love weird problems, particularly SEO ones 12 4 1 reply 3 months ago",
            "replies": [
                "Kyle   3 months ago ROBIN!! Welcome! 1"
            ]
        },
        {
            "message_text": "Noah   3:04 AM @Robin uhm is Robin Lord and is one of my closest pals, mentors, ideation partners, and is an all around great human. (edited)  6 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Donna Donahue   3:08 AM hi @Robin very nice to meet you. I'm not a rock star either by most people standards, but I am a legend in my own mind if that counts lol 3",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Shawn   3:09 AM another opening act here myself",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Iman   3:11 AM @Dan Rice willkommen willkommen. 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Paul Baterina   12:54 PM Hi everyone! Excited to be here. Im the head of SEO (one man team lol) for REVOLVE.com - online retail. Been here for 10 years, and helped contribute the overall growth so that we would   go public in 2019.  My background is in technical, analytics, and building things at scale. Outside of my 9-5, I get involved in a lot of affiliate (publication) type of sites. I guess you can say Im white hat at day and black hat at night :p. Cant wait to connect with you all! 13 3 2 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago PAUL! Welcome! 1",
                "Iman   3 months ago Welcome welcome. 1"
            ]
        },
        {
            "message_text": "Sarah Blocksidge   6:50 PM Hi all, Happy Friday! I've been lurking for a while, and am stoked to see a lot of faces I recognize from Twitter (X?) on here. I live in the always-sunny Cleveland, Ohio, and am the Marketing Director at a local digital agency where I dabble in a little bit of everything! You may have seen a prank my company did making its way around the internet the past few years about a billboard for a restaurant that only serves meatloaf and strawberry milk Google at your own risk :) 14 1 2 4 replies Last reply 3 months ago",
            "replies": [
                "Andy Strager   3 months ago Howdy East Coast-ish neighbor! Nice to see someone nearby. I am in always-cloudy Pittsburgh! 1",
                "Sarah Blocksidge   3 months ago @Andy Strager hello fellow rustbelter!! 1",
                "Jonas Sickler   3 months ago It's a unique thing to work on the marketing team at an agency rather than working on client websites. We get to experience both sides of that world!",
                "Sarah Blocksidge   3 months ago @Jonas Sickler for sure, it's a fun spot to be in!"
            ]
        },
        {
            "message_text": "Iman   9:30 PM @Josh S. welcome welcome. Can't believe you came here but",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Emily Dougherty (Yost)   10:16 PM Hello, community! Ive been an SEO for 10 years and have been consulting/freelance for the last 7 years. I specialize in the technical side of SEO (and will be attending WTSFest in Philly!). Thank you, Noah for creating this community. I hope to be more active here than I currently am in the Shooting the Poop SEO Clubhouse room . 18 2 2 1 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Sukh   2:41 AM Hi everyone! A lot of brilliant people here! I have the pleasure of working, learning, growing with Noah and my fantastic friends at Sterling Sky! Looking forward to learning, sharing and chit chatting with everyone Shoutout to @Noah aka the kraken on over 400 members in one week! Seriously impressive but are we really surprised? 18 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Peter   4:25 PM Happy Sunday! Im a former agency owner and retail store owner. I work with brick and mortar retailers, mostly on Shopify, to maximize their online revenues with SEO & SEM. My business is a no-contract coaching/consulting hybrid, and I just launched a performance-based marketing program. Im having a lot of fun with my clients, and look forward to meeting many of you at MozCon in August. 14 1 2 replies Last reply 3 months ago",
            "replies": [
                "Dan Rice   3 months ago Hey Pete and welcome. What level of personnel are you training?",
                "Adam Humphreys   3 months ago What do you mean by performance based marketing? Isnt all marketing performance based or do you get some additional benefit from said performance?"
            ]
        },
        {
            "message_text": "Josh Green   9:27 PM Hi all. I've been working in SEO/digital marketing for almost two decades now. I started off at agencies, as many of us do, moving in house in 2012. I've been doing enterprise level in-house SEO since then, with a lot of international mixed in. Since 2015 I have worked for companies with multiple competing sites starting with Expedia who owns 10 different travel domains just inside the US. I have a degree in IT, which means my focus has been largely technical. I have been on the leadership for two different Mental Illness and Neuro Divergence (MIND) ERGs as well, so I am a strong advocate for mental health awareness and inclusion. Feel free to connect on LinkedIn if you would like. 17 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Darren G   9:59 PM Happy Tuesday, everyone! Greetings from Manchester, UK! I'm chuffed to bits to join this dynamic SEO Slack community. With over a decade of experience in digital marketing, specialising in SEO and Paid Advertising, I've worked across various sectors, both in-house and agency side, serving B2B and B2C clients globally. Looking forward to engaging in enlightening discussions, learning from all of you, and contributing valuable insights. Cheers! 14 1 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Katie McDonald   12:23 AM Hi! Im Katie, been in seo nearly 10 years now, work at an agency in Lichfield / Bham and Im a lover of content and all about using AI Cant wait to accelerate learnings from you all! Im also on LinkedIn..  Let me know your LI! (edited)  6 2 3 12 3 replies Last reply 3 months ago",
            "replies": [
                "Iman   3 months ago Welcome welcome",
                "Katie McDonald   3 months ago https://www.linkedin.com/in/katie-mcdonald-b1937b127 thank you! 1 1",
                "Nick LeRoy   3 months ago Glad to see you make it over :)"
            ]
        },
        {
            "message_text": "Jon Holt-Thomas   12:38 AM Hey all! I'm Jon, been running an agency a couple of years in UK/US (CA) and loving the endless challenges here to connect with like-minded people and learn as much as possible! 13 1 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jack Chambers-Ward   2:39 AM Hello everybody!  I'm Jack, I've been working in SEO for about 5 years now. I'm the Marketing & Partnerships Manager at Candour (an agency based in Norwich, UK) and I also recently co-founded the Neurodivergents in SEO community. As well as working in SEO, I've been podcasting for over 13 years and currently host two podcasts: Search With Candour (I'm always looking for new guests if anyone is interested!) & Sequelisers (all about fixing bad movie sequels). I'm looking forward to joining in with the conversations here and learning from you all! (edited)  18 3 1 1 6 replies Last reply 3 months ago",
            "replies": [
                "Josh Green   3 months ago No no, bad SEO! No link to this community. How could you?! Seriously. Need a link to this community. (775 kB) https://tenor.com/6VP2.gif 1",
                "Jack Chambers-Ward   3 months ago Haha, thanks @Josh Green ! My original post was full of links to stuff but it felt a bit self promo-y so I took them all out Here's the link for ND in SEO. We've literally just started and we're growing nicely alresdy.",
                "Matt McGee   3 months ago Welcome, Jack! If you're REALLY desperate for podcast guests, I'd be up for it. Could talk about the dodgy state of real estate SEO in the U.S. (sorry, not at all familiar with the UK) or the olden days of SEO. If that's not a fit, no worries. (edited)  1",
                "Tory Gray   3 months ago Hi, Jack! 1",
                "Sophie Brannon   3 months ago If youre still looking for guests, Im back in the UK   1",
                "Josh Green   3 months ago @Jack Chambers-Ward thanks. I just filled out the survey. If you are looking for guests I am happy to help out if you need my professional or pop-culture help. 1"
            ]
        },
        {
            "message_text": "Anastasiya I.   10:21 AM Hey all! I'm Anastasiya, and I've been in SEO for over 8 years, both in-house and agency. Currently developing a freelancer gig, hoping to turn that into a small SEO agency someday soon  I'm excited to join you all, exchange some insights and connect - being part of a community is next to being in a team, so looking forward to chatting with you! 13 1 3 2 replies Last reply 3 months ago",
            "replies": [
                "Iman   3 months ago Welcome welcome 1",
                "Nick LeRoy   3 months ago Welcome.  Make sure to join us in the #freelance channel too!"
            ]
        },
        {
            "message_text": "Kal Dimitrov   12:21 PM Hi folks, my name is Kal, I've been working as an SEO since 2014, currently working at Enhancv (a SaaS online resume builder). Learned about the recent start of this community from the SEO for Lunch newsletter. Looking forward to the community experience! (edited)  14",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Riya Jain   4:31 PM Hello everyone, I am Riya from Growfusely. I work with SaaS brands to cater to their SEO and Content Marketing needs. Excited to be here and exchange experiences & learn with my fellow SEOs! (edited)  Growfusely SaaS Content Marketing Agency - Growfusely A SaaS content marketing agency specializing in developing data-driven content marketing and SEO strategies for small, medium and enterprise SaaS brands. 1 9 1 reply 3 months ago",
            "replies": [
                "Joshua Poole   3 months ago see you guys around - you do good work 1"
            ]
        },
        {
            "message_text": "Joshua Poole   5:52 PM Hi everyone - I am Josh Poole - Head of Growth (Sales, Marketing, Partnerships) at StudioHawk. Australia's specialised SEO agency, based in Melbourne and Sydney. I have been in the SEO space for 4+ years. I enterprise SEO, creative content marketing, programatic / high growth SEO and everything in between. There is no space i'd rather be in. Connect with me! Keen to see with others around the world are doing. 16 2 2 3 replies Last reply 3 months ago",
            "replies": [
                "Sophie Brannon   3 months ago   good to see you here!!",
                "Joshua Poole   3 months ago hey legend",
                "Joshua Poole   3 months ago thought i would pop by"
            ]
        },
        {
            "message_text": "Sam Lee   6:24 PM Hi folks! Thrilled to be a part of this SEO community. I've been in the space for 12 years - specializing in building & activating strategies for local and global businesses of all kinds, such as Unique Print NY (for my local NYers) and WeWork. I recently started freelancing, which has been such an exciting journey! Give me a shout, would love to do a virtual coffee / drink with anyone! 14 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Liam Carnahan   8:54 PM Hey everyone! My name is Liam. Here to meet other people who like to nerd out about SEO, freelancing, AI, nomading, or whatever it is you're passionate about (except sports, sorry). Here are some quick facts about me: Been in the SEO world since 2008 Focus on creative SEO content & content strategy I train and mentor freelancers of all experience levels My website: InkwellContent.com I'm a digital nomad (next stop, Vancouver) Boston and New England native Resources I make for freelancers and SEO nerds I'm always happy to share my experiences with SEO, and especially love talking to folks who are building (or thinking about starting) their own freelance business. Always down for a chat, so send me a DM or connect with me on LinkedIn. 14 3 1 1 1 reply 3 months ago",
            "replies": [
                "Adam Humphreys   3 months ago Check out Tofino on Vancouver island. Youll love it there but book early. 1"
            ]
        },
        {
            "message_text": "Jason Brown   1:28 AM \"I would never join a club that would have me as a member.\" 1 9 6 1 3 replies Last reply 3 months ago",
            "replies": [
                "Jess Joyce   3 months ago Hi Jason",
                "Jason Brown   3 months ago How are you, Jess?",
                "Jess Joyce   3 months ago Swell thanks yourself?"
            ]
        },
        {
            "message_text": "Eri Hickey   1:39 AM Hi All! I'm Eri. It's nice to meet you! A little bit about me: I've been working in the marketing industry since 2016 and been SEO focused for about 4 years. I'm originally from Alaska but I am now based out of Indiana, USA. My current role is Digital Marketing Manager at Grey Matter Marketing. I do a lot of SEO and content work for medtech companies in the medical device space. I'm also a graphic designer and currently handle social media for about half a dozen clients as well as some freelance on the side. I would love to diversify my linkedin feed with y'all's content so feel free to reach out! It'd be nice to have some more SEO friends to chat with https://www.linkedin.com/in/eri-means/ 4 14 1 1 reply 3 months ago",
            "replies": [
                "Iman   3 months ago Welcome welcome Eri."
            ]
        },
        {
            "message_text": "Craig Harkins   4:21 AM Hello everyone. Im Craig and Ive been in SEO long enough to have gotten links from the Yahoo! directories. Worked up from building my own eCommerce business to going in-house at larger companies. Currently Director of SEO at Apartments.com where I lead SEO and content for our sites. Off work Im , and watching or 21 6 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago Welcome, Craig!",
                "Jordan Choo   3 months ago Hey, Crag! Nice to meet a fellow SEO + runner",
                "Jason Wilson   3 months ago Yahoo Directories, Best of the Web, V7N, Clutch (old clutch), DMOZ, I was there too! Old guy SEOs unite! 1",
                "Jason Wilson   3 months ago Oh, I forgot Digital Point. I used to buy a ton of links from there too. Those were the days!",
                "Matt McGee   3 months ago Kept my first SEO clients from going out of business when I convinced them to buy a Yahoo Directory link for $299. Within a month they had orders from like 15 different countries. 1",
                "Josh Green   3 months ago I remember when BOTW was Best of the Web not Breath of the Wild. Still screws me up when people abbreviate that game name. 1"
            ]
        },
        {
            "message_text": "Mason Nelson   4:46 AM Hey Everyone, I'm looking forward to meeting some great fellow SEOs! 7 years of SEO experience starting from local agency to being on in- house SEO teams at Footlocker Inc. and Lowes Home Improvement while freelancing along the way. By day, I lead an ecom team at Lowes.com, by night, I do freelance SEO. Specialize in E-commerce but have touched just about any industry. I love working on a white-label basis through agencies, taking on big site audits, one-off consulting calls to tackle complex issues and training/mentoring newer folks. PM or connect with me on LinkedIn if youd like to meet & greet (https://www.linkedin.com/in/masonnelson/ / MasonNelsonSEO.com) Thanks! 3 18 1 1 reply 3 months ago",
            "replies": [
                "Josh Green   3 months ago Interviewed at Lowes years ago. The office is pretty amazing. Loved that open floor plan. The birds nest (as I think it was called) was pretty cool to sit in for the interview. 1"
            ]
        },
        {
            "message_text": "Chris Foerster   10:52 AM Hi Everyone.  I am Chris and I have been doing SEO for about 12 years now.  I currently work as a Digital Marketing Director and do freelance SEO for a few law firms. 13 1 1 reply 3 months ago",
            "replies": [
                "Iman   3 months ago Welcome welcome Chris."
            ]
        },
        {
            "message_text": "Rik Snuiverink   1:02 PM Good morning everyone nice to meet you. I just joined. I mainly focus on building links. I build more then 20k links over the last 5 years. All paid links and mostly for really competitive industries like casino etc. I am not sure if this is allowed, if not please remove the link, but I see others doing it as well, here is my profile on Upwork : https://www.upwork.com/freelancers/riksnuiverink?viewMode=1 (edited)  3 3 replies Last reply 3 months ago",
            "replies": [
                "Iman   3 months ago Hi Rik, I think this entire slack channel is not for the link exchange or link building system you offer. So much so that we don't have a link building channel.",
                "Rik Snuiverink   3 months ago I believe this section is just for doing intros isn't it. Just sharing who I am etc. I am not offering anything just sharing who I am. If any of the mods think it is not right then they should delete it .I am completey happy with that. As for your comment itself I am here to learn from other people I am not here to sell any services. There are better ways to do that.",
                "Iman   3 months ago Intros are fine. Learning and helping each other is what this slack is all about. Welcome aboard."
            ]
        },
        {
            "message_text": "Andrew Optimisey   2:15 PM Hi everyone. I'm Andrew aka Optimisey (over on that 'other place'). I'm a UK-based SEO consultant. Nice to see lots of familiar faces here and some new ones too. I'm still trying to find somewhere as good/useful/interesting as 'It' used to be before Space Karen wrecked it - but everything @Noah touches turns to gold, so this seems as good a place as any! 20 3 1 4 replies Last reply 3 months ago",
            "replies": [
                "Jack Chambers-Ward   3 months ago Hello mate! Fun fact: One of the first things I ever did \"publicly\" when I started at Candour was talk about you, Optimisey. As part of @Matt Tutt 's SEO Quiz, naturally. Jack @JLWChambers - Question 5.mp4  0:17 1 1",
                "Andrew Optimisey   3 months ago That's amazing! (and in the Sequelisers t-shirt too!).",
                "Jack Chambers-Ward   3 months ago Always be marketing",
                "Matt Tutt   3 months ago I remember this @Jack Chambers-Ward - feels just like yesterday! I was thinking of relaunching this - a few new rounds... maybe I could get a few takers here in this slack 1"
            ]
        },
        {
            "message_text": "Claire Carlile Rees   2:29 PM Hello, I'm Claire.  I feel old and tired and I'm sad that Twitter imploded and I don't get to hang out with my SEO friends there.  Thank you for having me here instead.  You all look lovely!  Looking forward to making some lovely connections and collaborating on the SEO ting. CCM Local SEO and Chartered Marketer in Pembrokeshire, Wales - Claire Carlile Marketing Ltd Claire Carlile is a Chartered Marketer and Local SEO expert based in Wales, UK - serving clients across the world! 21 2 +2 10 replies Last reply 3 months ago",
            "replies": [
                "Andrew Optimisey   3 months ago Fancy seeing you here... 1",
                "Andrew Optimisey   3 months ago hello again (1 MB) https://media4.giphy.com/media/3o7TKtJgTRbr8Sg5IA/giphy.gif?cid=6104955elxd74h0crh76y8vm3qch9pnpwywzpo0hp1nmqeow&ep=v1_gifs_translate&rid=giphy.gif&ct=g Posted using /giphy | GIF by Gotham",
                "Jack Chambers-Ward   3 months ago Claire! Lovely to see you here! 1",
                "Andrew Optimisey   3 months ago am i invisible (2 MB) https://media2.giphy.com/media/ddeD2osC8kgrTpGJlf/giphy-downsized.gif?cid=6104955ex6da2dk3jzx1piyiu8hiu5bd6ftcutbq3psi2j4v&ep=v1_gifs_translate&rid=giphy-downsized.gif&ct=g Posted using /giphy | GIF by Apple TV",
                "Tory Gray   3 months ago HIIIIIII Claire, and welcome!",
                "Claire Carlile Rees   3 months ago Hello dear! 1",
                "Adam Humphreys   3 months ago Ive never heard the term chartered marketer before. Is this a UK thing? 1",
                "Victor M Pan   3 months ago   1",
                "Dale   3 months ago Hey Claire. Ive got some cool new updates to share with you soon. 1",
                "Claire Carlile Rees   3 months ago Looking forward to seeing / hearing them @Dale"
            ]
        },
        {
            "message_text": "Peter Ebbinghaus   3:14 PM Hi everyone, I work in-house as the SEO Team Lead for a German D2C brand (e-commerce consumer electronics). I focus on overall content analytics and web shop feature development. Good to meet y'all, how are you?  (edited)  2 14 2 replies Last reply 3 months ago",
            "replies": [
                "Rik Snuiverink   3 months ago Guten Morgen Peter,  nice to meet you. I am just new here myself as well.Enjoy your stay. (edited) ",
                "Peter Ebbinghaus   3 months ago Nice to meet you, Rik. Just sent you a connection request on LinkedIn https://www.linkedin.com/in/peterfebbinghaus 1"
            ]
        },
        {
            "message_text": "Elias   3:46 PM Hi All! My name is Elias. I have been exploring Data Science for a while, and checking ways to incorporate it into search and digital marketing. I created an open-source Python package called advertools containing various tools to crawl and analyze sites, sitemaps, robots.txt, log files, create campaigns, etc. Im also teaching a course for beginners. Nice to meet everyone and looking forward to talking to you all! 19 2 2 replies Last reply 3 months ago",
            "replies": [
                "Peter Ebbinghaus   3 months ago Loved your hands-on webinar recently, Elias. All the best for your course.",
                "Elias   3 months ago Thanks a lot @Peter Ebbinghaus"
            ]
        },
        {
            "message_text": "Myles   5:00 PM Hello, my name is Myles. Former front-end dev turned SEO Strategist. I work for B2B PaaS company (Mendix), been there for a little over a year now. I'm looking forward to  connecting with my fellow SEO community and be of service wherever I can. Feel free to connect via LinkedIn or message me here 22 2 1 1 reply 3 months ago",
            "replies": [
                "Iman   3 months ago Welcome welcome Myles."
            ]
        },
        {
            "message_text": "sean   6:58 PM Hey! This is Sean Markey, author of the Rank Theory newsletter and many, many stupid tweets. I built and sold several affiliate sites in the CBD and cannabis seeds space for many six-figures, and these days I write a weekly newsletter about SEO and another about domains (which, unfortunately, I am obsessed with). Shout out to @Nick LeRoy for pointing me here. [rank theory] Home - [rank theory] Rank Theory is a twice-weekly newsletter containing emerging theories, illuminating experiments, and occasional shitposting. Written by Sean Markey Time to read Less than a minute Apr 21st, 2022 2 19 4 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago great, leave it to @Nick LeRoy to bring in more shenanigans. welcome @sean ! 1",
                "sean   3 months ago yeah, everything I do here thats bad/goes wrong is Nicks fault. but everything awesome I bring to the community is all me 1 1",
                "Adam Humphreys   3 months ago Do you know Rishi? He is in that space in a big way.",
                "Jess Joyce   3 months ago Yaaay Sean! Welcome!"
            ]
        },
        {
            "message_text": "Jason Packer   7:06 PM Hi I'm Jason Packer . I have a small analytics agency quantable.com and have been in the SEO (and analytics) field for 20 years or so, mostly on the analytics side -- but I'm very interested in technical SEO as well. I'm also the author of a guide to GA alternatives (https://gaalternatives.guide) and most recently been working on a rock opera about analytics (https://universalsunset.com). 15 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Tyler Brown   7:09 PM Hello! I've worked in SEO for about the past 11 years, mostly B2C/lead-gen/in-house, with some B2B agency experience to speak of as well. I'm currently SEO manager for https://www.getbellhops.com. Happy to find replacements for the ex-bird site. I'm based in Richmond, VA, USA, the greatest city in central Virginia. 13 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Brian   9:06 PM Hello, I'm Brian in-house SEO Product Manager for Crate & Barrel Holdings' web properties - Crate & Barrel, CB2, and Hudson Grace. I lead an agile SEO product development team and I'm a member of our in-house eCommerce automation team. Whether it's enhancing internal tools for scalable SEO efforts or leveraging AI to improve workflows and processes, I strive for efficiency . I'm also constantly on the lookout for the latest Google SERP features, tests, and everything related to organic search. 5 20 1 20 replies Last reply 3 months ago",
            "replies": [
                "Kyle   3 months ago @Brian Do you work with Renee?",
                "Brian   3 months ago @Kyle yes! Renee is my boss.",
                "Kyle   3 months ago NICE! You should totally invite her here",
                "Brian   3 months ago Yes! Just sent her an invite Renee is the best 1 1",
                "Jason Wilson   3 months ago Awesome company! Dont tell my wife, she loves C&B! 1 1",
                "Tory Gray   3 months ago Hi Brian! Tell Renee a big Hi! for me 1 1",
                "Renee Girard   3 months ago hi SEO friends! i'm excited to be here, especially since i'm rarely on twitter anymore 1 1",
                "Kyle   3 months ago Renee!!!",
                "Tory Gray   3 months ago Welcome!",
                "Renee Girard   3 months ago thank you!! @Kyle it's been a min!! are you still in MKE?!",
                "Kyle   3 months ago @Renee Girard yes! We got back last year, moved out to Brookfield in January.",
                "Renee Girard   3 months ago nice! MKESearch is coming back this fall",
                "Brian   3 months ago Slightly off topic, but @Kyle I was born and raised in Brookfield nice move 1",
                "Kyle   3 months ago Wait, what?! Whos running it? I thought Steve et al shut that down",
                "Kyle   3 months ago @Brian we were very nervous moving here from Milwaukee/tosa. Were not ready for suburbia vibes. Its been surprisingly positive though, all things considered.",
                "Renee Girard   3 months ago that's comforting. i've lived by lakefront brewery for 12 years and finally ready for suburbia within driving distance of CBH headquarters. Granular/Momentic are bringing MKESearch back and better than ever! (edited) ",
                "Kyle   3 months ago Weve seen a lot of areas, feel free to HMU if you ever want to chat about the crappy market!",
                "Kyle   3 months ago Re: MKEsearch, thats awesome to hear!",
                "Brian   3 months ago @Kyle good to hear - I always liked that its easy to pop into Tosa/MKE easily if you want to, but also have a bit of separation (edited) ",
                "Brian   3 months ago Plus you can reach the best friday fish fry's in lake country easier from Brookfield 1"
            ]
        },
        {
            "message_text": "Jonathan Sackheim   10:46 PM Hey errrbody. I'm Jonathan, I run a digital advertising agency in Boulder, CO, and we primarily manage B2B paid media campaigns on LinkedIn, Google, and Meta, but we do a limited amount of SEO for existing ad clients. We also do media buying work for other agencies. I've always loved SEO and we've shown good results doing it on our own website: https://groundsforpromotion.com/ Grounds for Promotion Digital Marketing Agency Boulder | Grounds for Promotion Boulder, CO based digital marketing agency that uses strategy, expertise, and analysis to deliver proven advertising results. We outperform other agencies! (67 kB) https://groundsforpromotion.com/ 6 4 14 replies Last reply 3 months ago",
            "replies": [
                "Niki Mosier   3 months ago Hi from Denver!!",
                "Jonathan Sackheim   3 months ago Hey Niki, good to see your name. Did you used to go to SEO Beers? I'm missing that.",
                "Niki Mosier   3 months ago I do go! Yeah, it tends to not happen as often in the summer because people are usually traveling so much.",
                "Jonathan Sackheim   3 months ago Cool. I haven't been in forever, I'd love it if you let me know the next time it's on. I've abandoned Twitter, err X, so yeah.",
                "Niki Mosier   3 months ago HahaI get that! Yeahmaybe @Matt Lacuesta might have to start promoting it on another platform as well. But Ill definitely try to remember to let you know! 1",
                "Dillon Loomis   3 months ago I'm in Colorado Springs, but would love to join SEO Beers whenever it happens! 1",
                "Karen Hopper   3 months ago i grew up in longmont! 1",
                "Niki Mosier   3 months ago Wait what? How did I not know that Karen? Or maybe I did?",
                "Karen Hopper   3 months ago we've definitely talked about CO before but i don't know if longmont ever came up! I'm out there a few times a year to see family and friends (was just there to run the bolder boulder in May!)",
                "Niki Mosier   3 months ago I ran the Bolder Boulder for the 1st time this year! 1",
                "Jonathan Sackheim   3 months ago Look at you two. Nice to meet you @Karen Hopper are you in DC now?",
                "Niki Mosier   3 months ago You have to let us know next time youre here and well have a special SEOBeers 1 1",
                "Karen Hopper   3 months ago yep! i've lived in DC for 12 years, after doing college in MN 1",
                "Jonathan Sackheim   3 months ago Hopefully we can all meet at an SEO beers. @Matt Lacuesta email me if you're doing it? 1"
            ]
        },
        {
            "message_text": "abh   11:53 PM Hey folks! I'm Ashley Berman Hale which is a mouthful so pals often call me abh. Or trash goblin. I've been tinkering in the SEO space (the tech stuff specifically) for a long ass time. I'm introvirtuous in that sometimes I hide at home for extended periods of time but I'm also a sucker for supporting the community and finding ways to better the Internet for humans. I'm good at building really incredible teams and snooping for weird bugs. I love winning over devs so SEO can be more impactful. I have way too many hobbies & foster sick, spicy kittens. I live in Fort Collins, Colorado. I'm currently engaged in some contract work but I'm interested in exploring in-house roles again (I have a ton of experience in big tech, SaaS, econ, communities and publishers). I worked at Deepcrawl/Lumar for a number of years and then made a decision to lay myself off. It was a big heartbreak but it's been great getting back into challenging work. (edited)  1 4 3 2 1 1 21 1 1 6 replies Last reply 2 months ago",
            "replies": [
                "Kyle   3 months ago @abh !!!",
                "abh   3 months ago Hi Kyle!",
                "Jason Wilson   3 months ago What an intro! Welcome!",
                "Nico Brooks   3 months ago \"trash goblin\". Snorted coffee through my nose, so thanks for that. 2",
                "abh   3 months ago I live to please with my own humiliation",
                "Azeem Ahmad   2 months ago You spelt LEGEND wrong. Great to see you here! 1"
            ]
        },
        {
            "message_text": "Britt Klontz   1:00 AM Hi, SEO friends! I'm Britt, and I run a content and digital PR consultancy in Bonney Lake, WA (it is near Seattle). I previously was at a few SEO and PR agencies, BlueGlass > Distilled > Weber Shandwick > Distilled (boomerang employee). I started my consultancy at the tail-end of 2019 and have experience strategizing content and doing PR for various businesses and entrepreneurs, from B2B software companies to lifestyle brands and influencers. My favorite client at the moment is a home organization expert specializing in the KonMari method (yes, you can get certified in this!). I also run training sessions for large in-house teams and 1:1 coaching sessions. Never a dull moment! Excited to connect with the broader SEO community and learning from you all, too. 20 3 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jeremy Galante   4:11 AM Hey Yall! Im Jeremy  Entering my third year as the in-house SEO lead at ClickUp (project management software) and have been in various SEO/digital marketing roles over the last 9 years or so. Im currently living in sunny San Diego, CA but have spent most of life in Buffalo, NY. Excited to be in the company of some awesome people on here! 21 1 8 replies Last reply 3 months ago",
            "replies": [
                "Andrew Prince   3 months ago If you havent met @Tess Voecks you need to. Shes yalls biggest champion! 1",
                "Jason Wilson   3 months ago Jealous! San Diego is the bees knees. I have been trying to get my family to move back to SoCal but we are in the Bay Area for now. 1 1",
                "Adam Humphreys   3 months ago I love clickup but damn if there isnt a ton of content coming in daily. Its got a LOT of features. Its what I use for my business. 1",
                "Adam Humphreys   3 months ago Im jealous of all the amazing meetups you have in the Bay Area @Jason Wilson . Theres a lot of brilliant people down there doing really neat things.",
                "Jason Wilson   3 months ago @Adam Humphreys I have to go to some of them! @Micah Fisher-Kirshner has an awesome meetup and I need to make sure I'm there next time. 1",
                "Jason Wilson   3 months ago @Adam Humphreys a lot of brilliant people that I don't know or interact with, unfortunately! 1",
                "Micah Fisher-Kirshner   3 months ago I need to get the next one set up... Gr... And shame on myself there heh 2 1 1",
                "Jonathan Sackheim   3 months ago Welcome, Jeremy!"
            ]
        }
    ]
}