{
    "messages": [
        {
            "message_text": "Kyle   1:25 AM set the channel topic: Job postings",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Kyle   1:25 AM set the channel description: This channel is for individuals or companies seeking skilled professionals, whether FTE, contract or freelance. Use #jobs-looking for seeking a job. 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Kyle   2:03 AM Jameson Treseler Just saw Aleyda share an open rec for Pitchbox. Link below @Niki Mosier  https://apply.workable.com/pitchbox/j/A925ACCF66/ Posted in jobs-looking (archived) | Jul 21st | This message is older than 90 days",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Andrew Shotland Were hiring an SEO consultant, or two. Hit me up Posted in jobs-looking (archived) | Jul 27th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Emily Brady   10:34 PM Hi all! I have a friend at SaaS startup (finance vertical, to my understanding) who is looking for an agency to help w/ SEO strategy. Based on my convo w/ them, they're looking for both technical SEO and content consulting from an agency that is pretty hands on. Any recs are much appreciated and I will pass them along! +2 9 replies Last reply 3 months ago",
            "replies": [
                "Iman   3 months ago +1 would recommend the gray dot co here. Also @Ray Martinez 3",
                "Katherine Watier Ong   3 months ago I would also recommend Nate Dame's team at https://profoundstrategy.com/ I've worked with them in the past. Profound Strategy Profound Strategy: Meet the SEO partner that delivers Delivering best-in-class SEO consulting and services - meet the dedicated, creative, and ROI-focused team at Profound Strategy. (103 kB) https://profoundstrategy.com/ 1 1",
                "Alex Harford   3 months ago I'll DM you details of the agency I work for.",
                "Andrew Shotland   3 months ago Hey @Emily Brady ! Would love a recommendation. We have 20+ years of tech seo and have worked with a lot of SaaS cos. Heres our soon to launch new site that might help https://lsgseo.com/seo-for-b2b-saas-companies/",
                "Emily Brady   3 months ago @Andrew Shotland ya'll are already on the list!",
                "Emily Brady   3 months ago Thank you all so much for the recs - I really appreciate it!",
                "Andrew Shotland   3 months ago",
                "Jason Wilson   3 months ago Probably can't compete with a lot of these agencies, as I'm a much smaller operation. If they need an experienced consultant that would act like an extension of their team, I'm all ears! 1",
                "Joshua Poole   3 months ago Hi @Emily Brady - we have great experience in the SaaS space. Have worked with a range of products and achieved great results. Happy to chat. https://studiohawk.com.au/ StudioHawk StudioHawk | Best Global SEO Agency Winner We're a Specialist SEO Agency focused on one thing, building SEO campaigns that give you a tangible ROI. Stop hanging with turkeys & soar with the hawks! Est. reading time 1 minute 1 1"
            ]
        },
        {
            "message_text": "This message was deleted. 1 reply 3 months ago",
            "replies": [
                "Noah   3 months ago Im moving this to the #jobs-looking channel."
            ]
        },
        {
            "message_text": "Kyle   7:05 PM I got this message from a recruiter I know; not for me, but wanted to share here if anyone would like an intro: Looking for an Interim SEO Product Director for a 4-month project.  This is a remote opportunity with occasional travel to Dallas & San Francisco. Below are the qualifications for this position:  Identify, measure, and interpret current state of SEO across our brands to validate product strategy.  Provide research, analysis, and support for identifying, evaluating, and resolving strategic opportunities.  Develop and manage a road map based on the current state of the SEO, highlighting timing, impact and work required from key stakeholder engagement strategy on all initiatives.  Build relationships with key business partners and other brand stakeholders; articulates product needs clearly and succinctly to different audiences and cross-functional partners  executive level storytelling.  Has in-depth knowledge of industry trendsand standardsto introduce the continual process, tool, and methodology improvements.  Assist in managing Agency.  Experienced at bringing Sr. Leadership along the strategic road mapping journey.  Collaborate and lead in key initiatives of implementation.       Retail experience preferred! Company is confidential (lol recruiters) 30 hours a week $115/hr If anyone would like an intro, let me know in DM! 3 replies Last reply 3 months ago",
            "replies": [
                "Boris Kuslitskiy (he/him)   3 months ago That's interesting. I'm betting it's setting up the entire SEO engine and then leaving. Surprised they didn't add in training and recruiting in the description.",
                "Jason Wilson   3 months ago @Kyle I'm in San Francisco and I'm interested right now considering a recent loss of a key client. Please send deets! Thx 1",
                "Jason Wilson   3 months ago I will DM you. 1"
            ]
        },
        {
            "message_text": "Donnie Strompf   9:37 PM Were looking for a content distributor. Someone who can create podcast opportunities, find and share content to good channels and perform manual outreach. Any suggestions would be highly appreciated!",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Geoff   7:35 PM Hey everyone Were hiring for a remote full time freelance content marketing specialist to join our team and help scale our content efforts. The role is focused on owning the content process (researching topics, creating briefs, assigning to freelancers, editing / optimizing, and publishing). Details + apply:   https://forms.gle/YybWmzTWsmzyKAm88 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Kyle   7:29 PM Anyone looking for a new role, be sure to check out seojobs.com - lots of great roles posted there! 1 2 replies Last reply 3 months ago",
            "replies": [
                "Nick LeRoy   3 months ago Appreciate you, Kyle.  Happy to provide 25% off any paid job listings for friends of this channel! Just DM me.",
                "abh   3 months ago Seconded for both of you! Thank you for doing this for the community. 1 1"
            ]
        },
        {
            "message_text": "Ben Fisher   11:51 PM Why is it so hard to find a SEO person? We get a lot of replies, but no one can furnish a example audit.... BUT if you can please apply! https://wellfound.com/company/steady-demand/jobs/2617236-seo-specialist Wellfound (formerly AngelList Talent) SEO Specialist at Steady Demand  United States  Remote (Work from Home) Steady Demand is hiring a SEO Specialist in United States - Apply now on Wellfound (formerly AngelList Talent)! Steady Demand is a team of Google Business Profile and social media... +2 16 replies Last reply 2 months ago",
            "replies": [
                "Ryan Cochrane   3 months ago Would you hire from Canada for this role?",
                "Adam Di Frisco   3 months ago @Ben Fisher This is such a compelling job listing... I'll share with my network as well.",
                "Boris Kuslitskiy (he/him)   3 months ago FYI, someone may not be able to quickly and independently produce a report without using the tools they usually use at work.",
                "Boris Kuslitskiy (he/him)   3 months ago If you asked me to audit a site, I absolutely could, but it wouldn't be pretty and it wouldn't be nearly as fast as I'd do at work with the paid tools available there.",
                "Ben Fisher   3 months ago Ryan, true story all our SEO team members are from Canada lol 1 4 1 1",
                "Ben Fisher   3 months ago Thank you Adam",
                "Ben Fisher   3 months ago Boris, what we usually get is an audit that is just a name cleansed version of one done prior",
                "Boris Kuslitskiy (he/him)   3 months ago For people working in-house, a name cleansed version may as well be labeled and is private information.",
                "Andrew Shotland   3 months ago Lol I think if you asked me for an audit I couldnt give you one as they are all covered by NDA 1 1",
                "Ben Fisher   3 months ago But... they can be cleansed to not have details like client info",
                "Adam Humphreys   3 months ago Its hard to relinquish technical audits because when I do it for a Fortune 200 energy company I cant share my findings with the general public even if the issues are readily available. (edited) ",
                "Alex Harford   2 months ago I've never had to provide an example prior audit to a company for an SEO role and would be wary of that. It's usually an interview plus sometimes a quick audit for one of their websites. I did a 5-6 hour audit when interviewing for one company - only a temporary and part-time role - I thought that was too much and wouldn't do it again. I got the job,  and they asked me for data from that audit (which I hadn't kept). (edited) ",
                "Adam Humphreys   2 months ago Ya Alex I tend to see it as people phishing for lists of how to do it.",
                "Adam Di Frisco   2 months ago I don't see it as a problem honestly. I keep audits I've done all the time for examples of work. Cleaning them is really not that much work and I see it as a great way to stand out from competition. As far as the phishing goes, I've never thought of that but I guess I've never considered applying to an agency taht doesn't have a solid reputation.",
                "Adam Humphreys   2 months ago Its more common than you think. Agencies I know also mentioned businesses posting requests for proposals, including audits of what they would do. So they get all this free work done, and SEO agencies fall for it.",
                "Andrew Shotland   2 months ago I fell for this once from Rodan & Fields. Jerked me around for 6 months then tried to hire our tech SEO guy to do freelance on the cheap. 2"
            ]
        },
        {
            "message_text": "This message was deleted. 2 replies Last reply 3 months ago",
            "replies": [
                "Iman   3 months ago Hi Joseph. Could you please delete and post this again in the #jobs-looking channel. The #jobs channel is for people to post jobs adverts. But since you are here I highly recommend joining a cohort by Chima Mmeje. She is on Twitter and LinkedIn and has training cohorts that help people wanting to become SEOs find internships. I do believe Aleyda Solis has something similar as well. Good luck in whatever you do.",
                "Joseph Kaiba   3 months ago Hi, Iman. Noted. 1 1"
            ]
        },
        {
            "message_text": "Rik Snuiverink   1:10 PM Good morning everyone if you are skilled in keyword research, and have your own framework , in which you help your clients please drop me a pm. I work for many different clients mostly in the competitive industries like casino etc. I am looking for someone that has a tested framework that they have implemented many times with success. For this I am of course willing to pay much more then the normal average salary. I could even offer you a certain percentage of the sales etc. But I am really picky with whom to work with and I have done this work myself for many many many years. (edited)  4 replies Last reply 3 months ago",
            "replies": [
                "Niki Mosier   3 months ago I highly recommend reaching out to @BKlein . His keyword research process is on point!",
                "BKlein   3 months ago Thanks, Niki!",
                "Niki Mosier   3 months ago Of course",
                "Adam Humphreys   3 months ago Honestly, I love Clearscope and Inlinks. I think Ahrefs and SEMRush are trying to follow suit now with keyword clusters but very late to the game. 1"
            ]
        },
        {
            "message_text": "Katherine Blake   10:24 PM Good afternoon all! My agency is looking for a freelance content specialist. Heres the posting: SEO Content Specialist (Freelance) Big Sea is looking for an experienced, vibrant and creative SEO Content Specialist to join our growing content team. Were seeking an outstanding SEO with a strong content creation background who can advise our clients on on-page, copy-based strategies to improve their organic reach. The skills were looking for include: Strong familiarity with SEO content best practices Experience in keyword research Familiarity with both content-led SEO and product-led SEO strategies A background in writing SEO optimized content (writing within this role will be minimal; however, youll be making recommendations to content creators) An understanding of internal linking strategy As part of this role, you will be expected to: Conduct content audits to determine opportunities for optimization on a website Produce monthly reports on traffic and keyword analytics Make on-page SEO recommendations for a variety of web content, including blogs, product and service pages, and landing pages Minor content production for significant text features (titles, headings, alt text, and meta descriptions) If interested, please send your resume and contact information to jobs@bigsea.co 3 6 replies Last reply 3 months ago",
            "replies": [
                "Sam Lee   3 months ago Thanks for sending this thru, Katherine. Interested to hear more. I'll send over my resume and contact info to the email provided right now. Cheers! 1",
                "Mohammad Shahnawaz   3 months ago I have sent my CV. Please check it on the mail.",
                "Jenna K   3 months ago I can't speak highly enough of working with @Katherine Blake !!! Also Kate, @Sam Lee is a former colleague and does fantastic work! 1 1",
                "Katherine Blake   3 months ago Thank you so much Jenna! Sam  Im going through applications & will be in touch",
                "Sam Lee   3 months ago So good to see you here, Jenna! 1",
                "Sam Lee   3 months ago Sounds good Katherine!"
            ]
        },
        {
            "message_text": "Noah   10:30 PM great agency 1 1 1 reply 3 months ago",
            "replies": [
                "Katherine Blake   3 months ago Thank you!!"
            ]
        },
        {
            "message_text": "Donna Donahue   1:41 AM is there anyone interested with experience as a VP level marketing role?  If so Antylia is hiring",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "https://workforcenow.adp.com/mascsr/default/mdf/recruitment/recruitment.html?cid=3e76f11f-07c9-470a-8e41-ffbd86bef684&jobId=457145&lang=en_US",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Rick   11:36 PM Seer Interactive is looking for an Associate Director of Digital Measurement Solutions. This position reports to the VP of Analytics and Insights. $115,000 - $150,000/yr https://www.linkedin.com/jobs/view/3684006634/ linkedin.com Seer Interactive hiring Associate Director, Digital Measurement Solutions in United States | LinkedIn Posted 8:59:38 PM. Seer Interactive is a digital marketing consultancy that harnesses compassion, data, and technologySee this and similar jobs on LinkedIn. 6 4 replies Last reply 2 months ago",
            "replies": [
                "Adam Humphreys   2 months ago Kayle Larkin was looking last I checked. Might be worth a reach out to her. Ive worked with her and shes quite good.",
                "Rick   2 months ago @Adam Humphreys Thanks a lot Adam. I don't know Kayle. But, if you will bring this to her attention I will be very grateful.",
                "Adam Humphreys   2 months ago https://www.linkedin.com/in/kaylelarkin",
                "Rick   2 months ago @Adam Humphreys Unfortunately, I can't message her because we're not connections, and I'm not on the hiring team at Seer. This one is all you, my dude."
            ]
        },
        {
            "message_text": "This message was deleted. 3 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago Hey @dawood ahmad ! This should be posted over in #jobs-looking and/or #shameless-plug Thanks and welcome to the community!",
                "dawood ahmad   2 months ago Sorry, didn't know about it.",
                "Kyle   2 months ago No problem; thank you!"
            ]
        },
        {
            "message_text": "Noah   7:57 PM renamed the channel from hiring to jobs-hiring",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Joshua Poole   2:23 PM We are hiring in Melbourne, Australia - https://www.linkedin.com/jobs/view/3687422125/?alternateChannel=search&refId=WDXHeo%2[]%2Fwucoox9LA%3D%3D&trackingId=%2BrMYpdKeLwwiqMcTGeVlJQ%3D%3D 4 3 2 replies Last reply 2 months ago",
            "replies": [
                "Shayan Nabi   2 months ago I am not an Australian, if you can outsource or looking for wfh I can do that.",
                "Adam Humphreys   2 months ago Love Melbourne! My friend Ash Nallawalla had me out that way. He is also an SEO in your area."
            ]
        },
        {
            "message_text": "Dan Rice   4:08 PM As I move over to delivering the digital marketing apprenticeship in September, the team are now able to hire a digital marketing apprentice - if you know anyone looking to get into the industry then I would appreciate you pointing them my way. They need to not be experienced and they have to be UK based for our funding - https://uk.indeed.com/q-digital-marketing-apprentice-l-southampton-so45-jobs.html?vjk=4fe4edbf87a6b14c&advn=5673738888017026",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Ben Fisher   8:50 PM https://wellfound.com/company/steady-demand/jobs/2617236-seo-specialist Wellfound (formerly AngelList Talent) SEO Specialist at Steady Demand  United States  Remote (Work from Home) Steady Demand is hiring a SEO Specialist in United States - Apply now on Wellfound (formerly AngelList Talent)! Steady Demand is a team of Google Business Profile and social media...",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jonathan Sackheim   3:16 AM Can anybody recommend a HubSpot freelancer? We'd like somebody to supplement our agency team capacity here at Grounds for Promotion. 5 replies Last reply 2 months ago",
            "replies": [
                "Dillon Loomis   2 months ago @Jonathan Sackheim Rachael Sink is a HubSpot alum, but since started her own business! Highly recommend her! https://www.linkedin.com/in/rachaelsink/ https://www.linkedin.com/company/rachaels-ink/ 1",
                "Jonathan Sackheim   2 months ago @Dillon Loomis Boom, thanks so much. I'll check her out. 1",
                "Monty   2 months ago @Jonathan Sackheim One of the best Hubspot freelance person I know. https://www.linkedin.com/in/chrisfhiggins 1",
                "Jonathan Sackheim   2 months ago @Monty Thank you! 1",
                "Ciarn  Muiris   2 months ago I worked under Matthew for almost 3 years at a Hubspot Platinum Digital Marketing Agency. He is now a freelancer - the guy is a genius, if you can at all - do check him out - https://matthewshepherd.ie/ matthewshepherd.ie Matthew Shepherd Digital Marketing Consultant & HubSpot Expert Looking to work with a freelance Digital Marketing Consultant & HubSpot Expert? Matthew is a former Senior Inbound Consultant with HubSpot with a wealth of HubSpot and digital marketing experience. (267 kB) https://matthewshepherd.ie/"
            ]
        },
        {
            "message_text": "Scott Salter   1:27 AM Looking for a seo content writer in the UK that can speak either French, German, Dutch or Spanish. https://boards.greenhouse.io/gymshark/jobs/4188446101?gh_src=null boards.greenhouse.io On-Site Content Writer Solihull, England, United Kingdom (684 kB) https://boards.greenhouse.io/gymshark/jobs/4188446101?gh_src=null",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Vahe Arabian   7:06 AM Hi everyone, we have a bunch of roles open following a restructure and expansion - https://app.workello.com/a/state-of-digital-publishing-seo-team-lead-south-east-asia https://app.workello.com/a/state-of-digital-publishing-head-of-seo https://app.workello.com/a/state-of-digital-publishing-seo-team-lead If you have any concerns or questions feel free to DM app.workello.com Workello Connecting great candidates with great employers (29 kB) https://app.workello.com/a/state-of-digital-publishing-seo-team-lead-south-east-asia app.workello.com Workello Connecting great candidates with great employers (29 kB) https://app.workello.com/a/state-of-digital-publishing-head-of-seo app.workello.com Workello Connecting great candidates with great employers (29 kB) https://app.workello.com/a/state-of-digital-publishing-seo-team-lead 1 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Mike Blazer   1:28 AM I have a question. Don't know if this is the right channel to ask this... You're looking to hire an SEO to join your in-house SEO team, you're getting responses to your job posting, but many of the candidates are just kind of money-oriented. How do you identify candidates with sparkle in their eyes, highly motivated candidates who want to learn and grow professionally? What questions should I ask candidates to find the gems that may not have the expertise yet, but have the above attributes? +4 13 replies Last reply 2 months ago",
            "replies": [
                "Jon Henshaw   2 months ago If they have sparkles in their eyes AND are highly motivated, then their likely curious and do their own stuff. So ask them about what they've done or are doing independently.",
                "Mike Blazer   2 months ago I've hired people who had their own projects or side projects that they wanted to work on at the same time, even though their job with us was full time. One thing is if they have a hobby site that they spend time on weekends or whatever, and another thing is if they want to work on their stuff and still get paid by us by trying to look like they're working.",
                "Jon Henshaw   2 months ago I have no doubt that those people were not providing you what you paid them to do. That said, if they are responsive, get their shit done, and are high performers, I don't think whether or not they're giving you 100% during the hours you tell them to work matters all that much. I do and produce plenty of stuff, but I make sure I do it on my time, or I make up that time for my employer on my own time. It's difficult to judge how someone is going to be, though. All I'm saying is that I wouldn't write them off because they may become your greatest asset. 4 1",
                "Sophie Brannon   2 months ago Ask them questions about things that are up and coming or hot topics in the SEO industry (SGE for example or something similar) and if they have even a little bit of knowledge about it, then they likely have the motivation to push their learning and have some industry passion too. If they dont have any knowledge about it but you see them make a note about it to look into it later thats also a good green flag. You can also typically tell based on personality (avoid ego!) and what kind of questions they ask you about the business, what progression looks like and pushing for next steps at the end 1 1",
                "Darren G   2 months ago Hi Mike, not sure what you mean by money-oriented, but wanting a fair pay doesn't make someone money-oriented. It's natural to seek a decent living. However, when interviewing, focus on their passion and curiosity about SEO. Ask about what they like about SEO and where they see it going and what drives them or how they keep up with trends. But remember, a quick learner who's eager to grow will also expect fair pay as they gain experience. It's about balancing passion with practical needs.",
                "Mike Blazer   2 months ago Hello! The salary should be 100% decent and fair, nobody argues with that. But it seems like there are two types of people who respond to job posts: those who want to get the money and those who want to earn it. You know, the takers and the givers. And the ones who are just chasing the money are still telling you that they are givers as well. And I want to identify the givers before I hire them. I want a full-time employee to do the best job he or she can, not someone who is just faking the work process.",
                "Darren G   2 months ago Hi Mike, totally get where you're coming from. It's all about finding the \"givers\" who are genuinely invested in their work. Maybe try asking about specific examples where they've gone above and beyond in previous roles. A trial period could also give you a real sense of their work ethic. It's a tough balance, but those genuine candidates with passion often shine through in the details and enthusiasm. Hope this helps! 1",
                "Natan Gesher   2 months ago Have you considered adding a line at the bottom of the job description that says something like, \"Please do not apply if you are money-oriented\"? You could maybe try that for a week or two, and then compare the pool of definitely-not-money-oriented applicants against the pool of mixed money- and not-money-oriented applicants, to see which is better.",
                "Mike Blazer   2 months ago I'm not getting 10k of applicants to make A/B tests",
                "Adam Humphreys   2 months ago Look at their social media and what theyre sharing/following.",
                "Sam Pennington   2 months ago Might sound silly but isn't this what probationary periods are for? Time to assess if the person is right for the role but professionally and personally. If you get the onboarding right, give them a decent level of work to do for the role and access output and quality it should tell you all you need to know. If your wondering how to get to selecting someone in the first place then that's about reading and understanding a CV. Roles, companies worked for, length of time in recent roles, reason for leaving etc.",
                "Mika Lepist   2 months ago A bit late to the party, but here's my take as someone who is self employed but would prefer to be a part of a larger team: Lots of jobs ask for way too many things from SEOs. They're unrealistic. If that's the case, I think you're going to get lower quality applicants. If someone is highly motivated, the pay structure and environment should cater to that. I think one mistake people make are wanting go-getters and entrepreneurial types, but not providing an environment that is right for that mindset. I think you can easily tell who is motivated if they are interested in a role where there is substantial performance compensation but it also has to offer the ability to actually perform (no hurdles) (edited) ",
                "Nicolai at Yak Media   2 months ago I dont think that asking questions to find gems will help. These days candidates are so well-versed and trained to answer any kind of questions. During my hiring days I was always asking to show me their SEO in action. I was looking for stuff outside their 9to5 responsibilities, like work on their own sites, help on friends sites, etc. Hope its helpful."
            ]
        },
        {
            "message_text": "Katherine Watier Ong   9:19 PM Just the messenger, but MightyCause is looking for a Marketing and Lead Gen Manager: https://docs.google.com/document/d/1Agb5onHaNTDbNkxLmpdoTxWwrSqwcvVQ4QZFHq0Twog/edit?usp=sharing",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Abby Leigh Curtis   5:58 PM Any paid search freelancers among us? We may need some help and I'm curious about hourly rates. 4 replies Last reply 1 month ago",
            "replies": [
                "Eloise West   2 months ago I've done this very casually for a former company. I'll DM you! (edited)  1",
                "Darren G   2 months ago Hi Abby, I work in both worlds and have done both SEO and PPC for years. Will also drop you a DM. 1",
                "Shayan Nabi   2 months ago DM",
                "Jaimee   1 month ago Also have done a bit of freelancing in the past (including for TO ). Happy to answer any questions!"
            ]
        },
        {
            "message_text": "Shawn Rubel   9:05 PM Hi folks, Im looking to hire a consultant to help me understand the WHY about the following data Im seeing:  SemRush reports that our US traffic is declining and US traffic is increasing from our competitor. GSC reports that our US traffic has been flat over the last 12 months. I would like to know the specific terms where we are loosing traffic and marketshare in the US to our competitor. I would like to know the specific terms where our competitor is gaining marketshare (and we are missing the boat). If you can help me with this, please send me a DM to discuss in more detail. Thank you! 3 replies Last reply 2 months ago",
            "replies": [
                "Kyle   2 months ago IIRC, SEMRush estimates traffic by position. This does not always accurately or directionally align with reality, unfortunately.",
                "Crystal Ortiz   2 months ago DMd you",
                "Graham  Maonaigh   2 months ago If you ignore SEMrush for a moment. Just look at GSC data as this is actual data from your Google presence. Firstly over that same period. Have your positions for search terms also remained somewhat static on aggregate. If so, have the numbers of impressions increased or decreased for the terms you rank for? If you are seeing impressions growing and your clicks remaining static you can assume two directions.  Heterogeneity factors are market growth/decline Homogeneous factors are related to changing behaviours or competitive forces you are facing. Its likely a mix of both"
            ]
        },
        {
            "message_text": "Yulin   2:43 AM Hi my company is hiring a junior SEO/content marketing specialist. Fully remote and can start part time if preferred. JD attached 1 reply 2 months ago",
            "replies": [
                "Yulin   2 months ago **Job summary**  The content SEO specialist at Klarity will support the growth marketing team by creating and publishing brand editorial and SEO content. This role will manage content creation and optimization for [helloklarity.com](http://helloklarity.com) and [kiwihealth.com](http://kiwihealth.com), and support other content channels or campaigns as needed. *Responsibilities Manage content creation and SEO content calendar for (http://helloklarity.com) and(http://kiwihealth.com), from ideation to execution Conduct keyword research and comprehensive competitor analysis to identify traffic opportunities for both new and existing content Create high-quality SEO content and optimize existing content for better SEO performance Manage CMS. Update and publish new content on website or other channels Provide content marketing support for other channels as needed, include but not limited: social media, online community, PR, blog newsletter, etc. Support on backlink building efforts Provide weekly or monthly SEO report on content performance *Requirements 2 years of SEO content experience or proven experience as an SEO content specialist, copy writer, editor or similar role. Preferred in healthcare space Strong understanding of SEO principles and beset practices, including keyword placement, semantic keywords, content clustering, competitor research, page wireframes, on-page SEO elements, etc. Experience in SEO link building or backlink audits Highly Proficiency in keyword research and content brief creation. Proficiency in SEO and marketing tools: GSC, SEMrush, Ahref, Google Analytics General content marketing and in-bound marketing experience preferred comfortable working in a fast-paced startup environment and managing multi-tasks** HelloKlarity.com HelloKlarity.com - HelloKlarity.com Create your virtual private practice with Klarity We empower nurse practitioners and physicians assistants with the marketing, software, and human resources needed to succeed in providing profitable telehealth services online.  Get Started Clients choose Klarity for its comprehensive approach As a private practice, theres a million things to do. We ensure your focus is where [] http://helloklarity.com/ kiwihealth.com All-in-one Patient Growth and Healthcare Marketing Platform - Kiwihealth Grow your medical practice and obtain new patients by utilizing our marketing platforms. Designed for telemedicine, mental health, and therapy practices."
            ]
        },
        {
            "message_text": "Ben Fisher   6:06 AM https://wellfound.com/company/steady-demand/jobs/2617236-seo-specialist - For an example audit you can choose a random company to audit or data clense an audit you did but cannot disclose the client Wellfound (formerly AngelList Talent) SEO Specialist at Steady Demand  United States  Remote (Work from Home) Steady Demand is hiring a SEO Specialist in United States - Apply now on Wellfound (formerly AngelList Talent)! Steady Demand is a team of Google Business Profile and social media... 1 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "A side note, we are looking for someone to take over marketing, especially internal marketing to past/current clients.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Granit Doshlaku   5:37 PM [HIRE/BUY] Were looking for SEOs who can work 5-20 hours per week at Manaferra. Tasks to be performed include: - technical SEO audits/strategies - keyword research - on-page improvements - content strategy / content briefs Hourly rate: $30 - $50 depending on the experience. DM me if interested.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Adam Bradley   5:47 PM My CMO is an investor in another company that is need of some SEO support. The company Flare, is in the legal services space. They are based out of NY (but open to remote), about 2 1/2 years old, and disrupting the industry. They are doing a few hundred M in revenue and profitable. Any referrals would be appreciated. DM me or apply via link https://www.comeet.com/jobs/flare/36.00F/senior-seo-manager/DC.C3E Flare Website Flare Were Flare. Designed to support clients during lifes big momentsand the lawyers that care for them. Were reimagining how attorneys and clients work together. (93 kB) https://www.helloflare.com/ Comeet Jobs Job opportunity: Senior SEO Manager at Flare ABOUT US:Our mission is to enable strength and clarity through key life events. We believe everyone should have access to the legal services they need. Funded by leading VC firms, Flare (formerly Themis-Tech) is an industry leader in legal technology. Were reimagining how clients and attorneys work together, with one goal: to make legal services accessible to those who otherwise wouldnt be able to afford it. Were a team of creative problem-solvers who want to make the world a better place. Join us.ABOUT THE ROLE:We are looking for a seasoned Sr. SEO Manager to join our dynamic marketing team. This role will be responsible for driving our SEO strategy and ensuring our content is search-eng Show more 5 replies Last reply 2 months ago",
            "replies": [
                "James Churchman   2 months ago Hey @Adam Bradley , this looks like a really interesting company. I've just started exploring in-house positions. Do you know what their SEO & Growths team looks like currently? (edited) ",
                "Adam Bradley   2 months ago Sorry, I don't know much about the role - I was just asked if I might know of anyone interested, so I thought of this group. 1 1",
                "James Churchman   2 months ago Got it. Well, thanks for posting. Going to apply!",
                "Nick LeRoy   2 months ago This could be a great JD to add to SEOJobs.com if you want to let your contact know.",
                "Adam Humphreys   2 months ago Sounds interesting"
            ]
        },
        {
            "message_text": "Aleksandra Khilova   7:04 PM Hi, SEO community Im looking for freelancer Outreach Vendor, or for white label contract agency for the US market and Europe. Its a part time job, so I dont have any pretty link with job description. (Sorry if I type in wrong chat) Dm me for any recommendations, thanks    (edited)  2 replies Last reply 2 months ago",
            "replies": [
                "Adam Humphreys   2 months ago Recommend eliminating the part about Indian authority from your description here as it comes off poorly. 1",
                "Aleksandra Khilova   2 months ago Sorry for this"
            ]
        },
        {
            "message_text": "Shawn Rubel   7:44 PM Does anyone know a Wikipedia Editor with a good history they could recommend? We are having trouble getting a page to stick and could use some help.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Cillian BC   7:45 PM Can anyone recommend a good link builder? Not looking for a fatjoe et al link buying service. We have some high intent content that we are trying to nudge towards number 1 and want to see if some well placed links can get it over the line. We are an eCommerce customer service SaaS company. We would be in roughly the same realm as Zendesk, Freshdesk, Help scout 3 replies Last reply 2 months ago",
            "replies": [
                "Edwin Romero   2 months ago I've been following Fery Kaszoni for a while and the link building case studies he shares on LinkedIn are always very compelling and creative. 1",
                "Daniel McCue   2 months ago @Cillian BC , Tony Randall. I can make an introduction.",
                "Cillian BC   2 months ago Yes please"
            ]
        },
        {
            "message_text": "Melissa De Oa   4:47 AM Any SEO freelancers who speak Spanish 100%? 6 replies Last reply 2 months ago",
            "replies": [
                "Adam Humphreys   2 months ago Aleyda probably knows a couple 3",
                "Darren G   2 months ago Natalia Witczyk also might able to help.",
                "Owain Lloyd-Williams   2 months ago Can recommend Filipa Serra Gaspar in this regard.",
                "Melissa De Oa   2 months ago Thank you guys, will reach out!",
                "Jhon Cruz   2 months ago I'm available Melissa",
                "Melissa De Oa   2 months ago Hi Jhon thanks Ill DM you!"
            ]
        },
        {
            "message_text": "Sophie Brannon   3:51 PM Hey all   I know of a few roles going at a UK agency - Head of SEO -  60k d.o.e SEO Manager - 35k d.o.e Some of the perks (theres more listed on the job specs) - Fully remote working in the UK (opportunities to work from anywhere within Europe  exceptions apply).   Free Private Medical Health Insurance (with cash back option on Vision & Dental care & 40% off Nuffield Health gym Membership)   3 Wellness days provided each year.   Company Pension Scheme Also know of a digital PR exec role, to help an AU agency get the ball rolling on this service with someone based in the UK. Happy to talk to all levels of experience for this. DM me if youre interested in any of these and Ill share the job specs    (edited)  1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Kyle   7:34 PM From @Andrew Prince Im not looking, but dropping this link to an awesome opp to be an SEO at TikTok: https://www.seojobs.com/job/seo-specialist-tik-tok/ SEOjobs.com SEO Specialist ~ TikTok ~ $128k  $244k ~ San Jose, CA TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Singapore, Jakarta, Seoul and Tokyo. Why Join Us Creation is the core of TikToks purpose. Our platform is built to help imaginations thrive. This [] Written by nick Time to read 5 minutes 3 +4 12 replies Last reply 1 month ago",
            "replies": [
                "Boris Kuslitskiy (he/him)   2 months ago Whoa. That's a hefty salary for a specialist.",
                "Dylan Jones   2 months ago Titles in SEO are so weird, especially when you compare in house to agency. 3",
                "Sam Knight   2 months ago Also sounds like it's in-person... in silicon valley $$$. Salary better be high! lol",
                "Chris Johnson   2 months ago",
                "Adam Humphreys   2 months ago Many of our peers are upwards of $400 an hour now. 2",
                "Nick LeRoy   2 months ago Appreciate you sharing the SEOjobs link :) 1",
                "Paul Baterina   2 months ago Shit I'll gladly be an SEO associate for 250k. But ugh... I love living in SoCal :X",
                "Jason Wilson   2 months ago Thanks for sharing, @Kyle ! Are they kidding with that salary range?!",
                "Adam Humphreys   2 months ago To attract top talent these days you will need those dollars and more.",
                "Kyle   2 months ago Not kidding @Jason Wilson ! Big brands generally dish bigger money.",
                "Jason Wilson   1 month ago @Kyle for sure, Ive worked for some of them I thought it was funny that there is a $116k range. 1",
                "Adam Humphreys   1 month ago Can anyone live on that in a core area in any of those places lol? 2 1"
            ]
        },
        {
            "message_text": "Rik Snuiverink   8:30 PM If anyone here is good at generating new SEO clients and can back this up with proven examples from the past please send me a pm. I run a small digital marketing agency and our main focus is on companies that are looking to expand to Europe. I need someone that can say : this will it cost to for example generate a new lead through Linkedin, this is my cut and I have done this a million times for client x etc. I am not looking for someone that has no experience because then I can basically do it myself. For your information last year we did around 1,4 million euro in sales. We are not large nor really small . (edited) ",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Ben Fisher   3:39 AM #justsaying https://wellfound.com/company/steady-demand/jobs/2617236-seo-specialist Wellfound (formerly AngelList Talent) SEO Specialist at Steady Demand  United States  Remote (Work from Home) Steady Demand is hiring a SEO Specialist in United States - Apply now on Wellfound (formerly AngelList Talent)! Steady Demand is a team of Google Business Profile and social media...",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Yulin   4:19 AM Im hiring a fully remote SEO specialist. Let me know if you are interested! https://klarity-health.breezy.hr/p/cba5cd23c42d-content-seo-specialist klarity-health.breezy.hr Content SEO Specialist at Klarity Health Company & Mission We are on an ambitious mission to solve the healthcare shortage in the US by empowering independent practices to thrive. Our AI-powered software and services supercharge independent practices, helping them to grow their patient base and deliver better patient experiences.We are gr Location Remote Company Klarity Health https://klarity-health.breezy.hr/p/cba5cd23c42d-content-seo-specialist 1 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Tyler Lane   8:07 PM Looking for a freelance web designer/developer to work on our site. Basic template updates, etc. Ping me if you know of anyone! 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Alex Haslam   7:57 AM A colleague is opening two full-time content-focused SEO Manager roles sometime this week  preference at Adobes San Jose headquarters, but it sounds like theres some flexibility for other locations or possibly remote. DM me if youre interested or have any questions! 5 replies Last reply 1 month ago",
            "replies": [
                "Adam Humphreys   1 month ago I always see these American-based roles and wonder how many millions Ive lost over the years just for being located on the other side of the border in Canada. NAFTA has trade agreements regarding this that allow us to work cross-border and tax-free. Most people dont know this.",
                "Ash Nallawalla   1 month ago When I was at Macromedia, they weren't paying millions. I want that job back!",
                "Paul Baterina   1 month ago @Alex Haslam Random - but is that the Inside Out ride at DCA?!",
                "Alex Haslam   1 month ago @Paul Baterina It is! Good eye  I figure my most genuine smile is when Im actively on a ride at The Happiest Place on Earth",
                "Paul Baterina   1 month ago @Alex Haslam Same! It's amazing how all the things we worry/think about goes away once we step into the Happiest Place on Earth! 1"
            ]
        },
        {
            "message_text": "Lisa Michetti   11:22 PM Hi from Canada! We're hiring for a digital marketing strategist! Details on our careers page https://www.adster.ca/careers Adster Creative Inc. Edmonton Digital Marketing Careers & SEO Jobs | Work With An Award-Winning Digital Agency | Adster Creative Looking for an exciting career in digital marketing? Adster is always interested in adding PPC specialists, SEO experts, and digital marketers to our team. View our current job opportunities and apply to join the Adster team! (105 kB) https://www.adster.ca/careers 3 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Joe Pawlikowski   1:33 AM Hi all. I'm hiring an SEO Manager at Yahoo. Fully remote. Definitely prefer someone with publishing experience but it's not a hard requirement. https://ouryahoo.wd5.myworkdayjobs.com/careers/job/United-States-of-America---Remote/SEO-Manager_JR0023059 ouryahoo.wd5.myworkdayjobs.com SEO Manager Yahoo is a global media and tech company that connects people to their passions. We reach nearly 900M people around the world, bringing them closer to what they lovefrom finance and sports, to shopping, gaming and newswith the trusted products, content and tech that fuel their day. For partners, we provide a full-stack platform for businesses to amplify growth and drive more meaningful connections across advertising, search and media. We are looking for an SEO Manager to join our SEO team within Search. The Yahoo SEO team is like its own agency within the company. We collaborate with engineering, design, and editorial teams to create optimized experiences that grow our audiences. Being on Show more https://ouryahoo.wd5.myworkdayjobs.com/careers/job/United-States-of-America---Remote/SEO-Manager_JR0023059 11 5 5 replies Last reply 1 month ago",
            "replies": [
                "Joe Pawlikowski   1 month ago please DM with questions",
                "Nick LeRoy   1 month ago @Joe Pawlikowski would love to have you submit this to SEOJobs.com too!",
                "Paul Baterina   1 month ago Sounds like a dream job!",
                "Joe Pawlikowski   1 month ago @Nick LeRoy poor recruiter is already in over her head 1",
                "Nick LeRoy   1 month ago No worries! @Joe Pawlikowski i'm glad to hear that is do to the amount of applicants your already getting"
            ]
        },
        {
            "message_text": "Jordan Sakala   1:56 AM Hi everyone, Im looking for someone that has link building experience. Lets chat! 2 replies Last reply 1 month ago",
            "replies": [
                "Mika Lepist   1 month ago Hey Jordan, DM me. I have someone you can talk to.",
                "Umair Saleem   1 month ago hello Jordan , I'm here I have link building experience"
            ]
        },
        {
            "message_text": "Houston Jayne   1:07 AM Any freelancers here who are lingual in German? I have a German site that needs a content audit and strategy. (edited)  1 reply 1 month ago",
            "replies": [
                "Adam Humphreys   1 month ago I have audited even South Korean in technical. Its not overly important. Copywriting on the other hand is a different story. What are your goals?"
            ]
        },
        {
            "message_text": "Kavi Kardos   10:40 PM Hi everyone! Super excited to share that we're hiring for two positions at Uproer! We're a boutique agency in Minneapolis, MN with a team that is passionate about succeeding in search. We do SEO and SEM only, and we're performance-focused. We get results and are looking for two folks to join our team. We have an awesome culture that focuses on working to live, not living to work. We have a 32-hour work week, and we're just people looking to help people. These two roles aim to replace two people who are sadly leaving us to pursue opportunities that are outside the realm of search marketing. Fully remote within the US, and did I mention the 32-hour work week?! We're hiring for: A senior SEO analyst - someone who loves search and is ready to dig right into the thick of it - tactical experience and client management experience wanted, but happy to talk to anyone! Looking for 2-5 years experience. A content specialist - an organized individual that is eager to learn about how content impacts search, and how we can improve content strategies across SEO and SEM. This role is mostly focused on getting content through the production process and making sure it works with our clients. All experience welcome! Reach out to me for more deets or apply on LinkedIn. Sr. SEO Analyst: https://www.linkedin.com/jobs/view/3719612379/ Content Specialist: https://www.linkedin.com/jobs/view/3719607813/ (edited)  Uproer Uproer | Search Marketing Agency for SaaS & Ecommerce Where great companies go to get found. Get in touch to learn about our high-growth search marketing solutions for SaaS & ecommerce. Written by Adam Marks Time to read 1 minute Apr 5th http://uproer.com/ 3",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Natan Gesher   9:36 PM I have a friend who's looking to hire a local search specialist with experience in both paid and organic acquisition (ie, Adwords and SEO) with Google business profiles across multiple geos. This would be on a contract/consulting basis. Knowledge of WordPress is a plus, and the business niche is related to accounting, so any experience there would also be a bonus. If you're interested, or know anyone who might be interested, could you send me a message in Slack and I'll forward it along?",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Victor M Pan   9:43 PM Deleted (edited)  1 6 replies Last reply 28 days ago",
            "replies": [
                "Rick   1 month ago https://www.seerinteractive.com/ seerinteractive.com Seer Interactive | Big Data-Powered Digital Marketing Agency Digital marketing agency driving tangible impact for our clients and for our communities. We bring people and data together to make better decisions. 1",
                "Cillian BC   1 month ago What industry are they in?",
                "Adam Humphreys   1 month ago SEER is in many industries.",
                "Cillian BC   1 month ago I meant what industry is the friend/colleague in questions business 3",
                "Tory Gray   28 days ago https://thegray.company/ thegray.company SEO Consulting: Strategy + Tech + Data | Gray Dot Company From high-growth brands to regulated industries, companies trust the Gray Dot Company to develop, accelerate, and scale their digital strategies. (683 kB) https://thegray.company/ 1",
                "Victor M Pan   28 days ago Closing submissions for some boundary setting A sending these over on my lunch break - thanks to all those who reached out! 1"
            ]
        },
        {
            "message_text": "Katie High   7:42 PM I have a client with a very specific need. I am looking for an SEO agency with substantial eCommerce experience- but particularly in high volume products (as in millions of parts) with complex selling/distribution channels. Does such a speciality exist? 7 replies Last reply 1 month ago",
            "replies": [
                "Jonas Sickler   1 month ago Hi Katie. I have a few questions that could help folks make better recommendations for an agency: What industry is the client in (YMYL spaces, for example, would require specific expertise from an agency) Do they sell high consideration products that might benefit from a blog or knowledge base? Are they looking for a short-term contract for technical recs, or a long-term partnership? Are they also looking for UX/CRO work to augment traditional SEO performance? Some agencies are great with just ecom, but arent set up for high volume blog publication. Some might have a ton of experience in SaaS, but not as much in retail. More importantly, large brands often have strict regulatory or legal needs for data security and compliance, so these are also a consideration. (edited) ",
                "Katie High   1 month ago Hi Jonas, all great questions. Thank you. This client is in manufacturing- very parts focused. Some B2B but B2C as well. Mix of custom and stock. Just looking for SEO specifically- paid, UX, CRO handled elsewhere. Oh and likely long term. (edited)  1",
                "Jonas Sickler   1 month ago Thanks Katie. Interesting. I had a feeling thats what it might be when you said the sales process was complex with millions of units moved. Ill check in with some folks I know to see if theres a good fit 1",
                "Michael Ferrari   1 month ago @Katie High Depending on the scope, I might be able to help. If I cant, I may be able to make a recommendation or two. Feel free to DM me if you want to discuss!",
                "Jameson Treseler   1 month ago Hey Katie! Happy to do a quick analysis to see if we can help. Complex sales processes are our jam. Whats the domain?",
                "Katie High   1 month ago They are looking for a larger agency. If that's a potential match please DM me. Thanks!",
                "Rick   1 month ago @Katie High I work at SeerInteractive.com. This job is right up our alley. 1"
            ]
        },
        {
            "message_text": "Noah   9:45 PM renamed the channel from jobs-hiring to jobs",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   9:45 PM Ruth Burr Reedy Hi everyone! I'm looking for my next role leading a team of smart marketers. I have 17+ years of experience in SEO and web analytics along with associated disciplines like SEM and UX. I've run a business development team and am dynamite with a pitch deck. My ideal situation would be to help an organization, whether a marketing agency or in an in-house capacity, build out their SEO/digital marketing team and/or service line (or take over running an existing one). Team leadership and culture building are things I feel even more passionate about than SEO, and to be frank, I'm really good at them. If you know of anyone looking for a senior-level digital marketing leader, I'd appreciate the connect Show more Posted in jobs-looking (archived) | Sep 21st | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Katie High I have a client with a very specific need. I am looking for an SEO agency with substantial eCommerce experience- but particularly in high volume products (as in millions of parts) with complex selling/distribution channels. Does such a speciality exist? Thread in jobs | Sep 22nd | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jess Joyce Saw this one on the web today and sharing it here --> Technical SEO Manager for ClickUp  https://www.linkedin.com/jobs/view/3712729389 Thread in jobs-looking (archived) | Sep 15th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Umair Saleem hello I'm looking for link builder / outreach specialist position. DM me if any opportunity Thanks Posted in jobs-looking (archived) | Sep 14th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Esraa Sheta Hey all, I am looking for SEO positions, I have 6 years experience in On-page SEO and technical SEO. DM me if you would like to chat ^^ Posted in jobs-looking (archived) | Sep 14th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jameson Treseler Anyone looking for a sick dev? Have a connection who's looking. Posted in jobs-looking (archived) | Sep 12th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Adam Humphreys Does anyone know of any designers for that do layouts UI/UX really well? I would be looking for someone that loves consulting in the area and does really good work. High end type work with strong appreciation for branding, font types, accessibility (colour use) etc Thread in jobs-looking (archived) | Sep 12th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Shawn Wondering what style or look some of resumes look like - anyone have something they are willing to share (DM works too) that works for you? Any hiring managers in here - anything that helps a resume stand out? Thread in jobs-looking (archived) | Sep 11th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "George Murphy I have worn multiple hats in SEO over the years. I got  my start in link building in 2005, then transitioned in-house to manage full-scale outsourced SEO at an agency for a bunch of law firms. Then I started my own gig for 10 years (covid hurt), followed by 2 in-house agency gigs and an in-house marketing manager position for a law firm. Im looking for the next step in my career. If anyone is looking for SEO sales help, or help with agency operations, I would love to discuss how I can bring my experience to the table. Im not going to list all of my accomplishments but I know WP really well (speed & caching, UX, back-end dev + SEO) & familiar w/ all SEO tools. My LinkedIn is below, please Show more Posted in jobs-looking (archived) | Sep 5th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Shayan Nabi Looking for SEO or SEM gigs. Have 7 years experience with google/bing search Posted in jobs-looking (archived) | Sep 5th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Chris Johnston Hi all, I'm an SEO with some developer skills. I went to a 9-month coding academy to switch careers but I finished in March of 2020, a bad time to find a job. Decided to freelance for a while and eventually became in-house for a global pool supply distributor. It was a great job but there was a management change and 9 people had their roles eliminated, one of those was me! Show more Posted in jobs-looking (archived) | Sep 1st | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Dan Rice Hey this is slightly unusual but we have 1 maybe 2 really good digital marketing apprentices (2nd interviews this afternoon but looks just as good on paper) who want to start in September, but we need more UK based hiring managers. Is anyone here (that is UK based and preferably in the South) looking to hire an apprentice? Posted in jobs-looking (archived) | Aug 30th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Aleks Merkovich Hey yall, Im looking to take on a couple hours of freelance work per week. My bread and butter is SEO-driven content development and e-commerce SEO. You can check out my LinkedIn here. DM me if youd like to chat! Posted in jobs-looking (archived) | Aug 29th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Simon Hi All, I have availability to take on a few more clients. I'm an eCommerce SEO with more than 10 years of experience. I'm looking to work with agencies who need extra help or looking for a part-time independent contactor. I have worked with various ecommerce clients in various niches including jewelry, fashion, home improvement and more. Please find attached a copy of my resume. Happy to share some case studies via DM if anyone wants to discuss further. PDF  Simon Karanja.docx.pdf PDF Posted in jobs-looking (archived) | Aug 23rd | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Joseph Farruggio Hey, Im the SEO-friendly web dev Im looking to pick up a couple more projects through the end of the year. Id be a great fit for your next WordPress design+build project. I do JavaScript/web app projects too. Show more Thread in jobs-looking (archived) | Aug 18th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Emily Pickelhaupt Hello! I am a SEO Content Strategist - In recent years I've led strategy for REI (Learn and blog) and CNET (where I manage over 120 topics spanning across Home, Tech & Wellness). I also do freelance across a variety of verticals, from healthcare to finance. I also do Local SEO,  setting up GMB listings and optimizing sites for local search - While at REI i managed their 186 locations and helped open 10 during my tenure. Looking to move into Freelance full time starting in September- open to work. Feel free to email at elpick27@gmail.com (edited)  Thread in jobs-looking (archived) | Aug 18th | View message",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Kimberly McSweeney   11:01 PM Hello everyone! My name is Kim and I am the Director of SEO at Seeking Alpha. Our team is on the hunt for an SEO Manager with experience in deploying programmatic SEO content strategies (a must have for this role), knowledge of publisher sites, as well as investing and finance experience. We have a really awesome team and this position is a unique opportunity to take our brand to new Organic heights via programmatic SEO and product-led SEO! Please apply through our LinkedIn listing if you meet this criteria and are interested! https://www.linkedin.com/jobs/view/3697222870 linkedin.com Seeking Alpha hiring SEO Manager in United States | LinkedIn Posted 9:54:23 AM. What we&#39;re looking for?Were looking for a world-class SEO Product Manager to assist in identifyingSee this and similar jobs on LinkedIn. 8",
            "replies": [
                "There is no reply thread in this message"
            ]
        }
    ]
}