{
    "messages": [
        {
            "message_text": "Derek Perkins   3:14 AM @Shawn didn't want to clutter the other thread, but wanted to share a memory. I met you at Searchlove Boston 2016, and we set up a trial Nozzle account for Alaska Airlines. That ended up being our primary demo dataset we used for nearly 4 years Just thought you'd find that interesting - I think about it anytime I see you post 2 replies Last reply 3 months ago",
            "replies": [
                "Shawn   3 months ago Hey @Derek Perkins I do recall that, its been a hot minute. Also crazy that youve been able to get that much traction with the dataset",
                "Derek Perkins   3 months ago it was an interesting case study when Google Flights came out and showed a ton of SERP movement"
            ]
        },
        {
            "message_text": "Kyle   9:05 AM @Derek Perkins you wouldnt happen to have any extra tshirts floating around would you? My techboost shirt has lost its lettering for the most part - not sure I can be a walking billboard without using sharpie to fill it back in 1 reply 3 months ago",
            "replies": [
                "Derek Perkins   3 months ago we sure do send me some sizes and colors, happy to send them to anyone on your team. light blue, charcoal, and black 1"
            ]
        },
        {
            "message_text": "Victor M Pan   4:47 PM Any closet Tesla owners in this thread? Asking for a friend who hates driving as much as Matthew Inman (the oatmeal) but enjoys the comic strips (and the ones on Tesla) and is getting one fixed up in 10 minutes +1 14 replies Last reply 3 months ago",
            "replies": [
                "Micah Fisher-Kirshner   3 months ago Wife owns one if that counts? 1",
                "Ben Fisher   3 months ago Here! 1",
                "Ian Cappelletti   3 months ago i'll just leave this here https://en.wikipedia.org/wiki/Criticism_of_Tesla,_Inc :zips lips: 1",
                "Victor M Pan   3 months ago Lol am I the only person with ownership guilt?",
                "Micah Fisher-Kirshner   3 months ago Wife had some guilt given the issues we've had with it, but not sure she'd really want to change it with an ICE car...",
                "Jason Wilson   3 months ago One of the most unreliable cars on the market! Not a Tesla hater either, but facts are facts. That being said, I rented a Model 3 a while back and it was super fun to drive!  (edited)  IMG_5645  ",
                "Jonas Sickler   3 months ago I got a VW ID.4 two months ago, and I love it. So I'm all in on the EV wave. Tons of options these days, so I recommend testing out a few different vehicles and doing TONS of research. Now that I think about it, there's so much opportunity for creating top of funnel content around EVs 3",
                "Micah Fisher-Kirshner   3 months ago Given the speed at which all new cars are now EVs, it's effectively halfway there before it's all EVs that get sold (note: not linearly) too",
                "Victor M Pan   3 months ago ^IMO not going to happen in a lot of truckin states. The electric grid isnt as robust in a lot of car dealerships. Not a car person but yeah Ive been realizing how much of the US economy is built on cars.",
                "Micah Fisher-Kirshner   3 months ago That's fine, I'm mainly basing it on a high-level average of what usually happens when new tech is adopted; 5% being the threshhold for it usually taking over after that.",
                "Victor M Pan   3 months ago Were staying by the cities but my partner wants a gas car to go on roadtrips. The irony is I did the math and a full tank of gas for the car she had in mind was 360 miles in ideal situations. I do think at some point the math gets inverted.",
                "Micah Fisher-Kirshner   3 months ago We use our Tesla for roadtrips, but we also bought early enough that we get free charging too.",
                "Victor M Pan   3 months ago LK99 btw would totally revolutionize battery tech!!! 1",
                "Micah Fisher-Kirshner   3 months ago It would revolutionize many fields"
            ]
        },
        {
            "message_text": "Noah   7:43 PM My beard is Gonzo. That is all.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Dan Taylor   7:54 PM All I see in my mind is this, with a snapback. image.png  ",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   7:54 PM AS I stand here working away with a snapback on 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Dan Taylor   7:56 PM Yeah, I think at this stage any photo I will ever see of you minus a snapback is AI generated.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   7:57 PM I was going to get a prosthetic 6th finger made just so I could f-with the whole was it an AI photo or not, question. 4",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Dan Taylor   7:57 PM That's a lot of commitment.",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Karen Hopper   9:58 PM effing brilliant image.png  17",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Noah   7:55 PM HAHAHAHA: image.png  3 6 5 replies Last reply 3 months ago",
            "replies": [
                "Karen Hopper   3 months ago the internet is my passion",
                "Noah   3 months ago",
                "Josh Green   3 months ago This is so...I mean. Its to the point. (Not automatically expanded because 4 MB is too large. You can expand it anyway or open it in a new window.) 1",
                "Adam Humphreys   3 months ago Where is the jazz hands gif when you need it?",
                "Jameson Treseler   3 months ago Thats just"
            ]
        },
        {
            "message_text": "Donnie Strompf   8:54 PM I think that belongs in #venting 1 1 reply 3 months ago",
            "replies": [
                "Noah   3 months ago ha.  I wasnt pissed.  I shared because of how bad it was."
            ]
        },
        {
            "message_text": "Riya Jain   4:55 PM Hi everyone, I am working on a content series wherein we ask experts, a few questions related to topics of their expertise and compile them into an actionable piece for readers. Next topic we are planning- Recommended Wordpress SEO plugins I am looking to get in touch with Wordpress SEO experts who can answer a few questions for this content piece. Interested people can DM me or reply here in this thread. Looking forward to insightful conversations! (edited)  1 8 replies Last reply 3 months ago",
            "replies": [
                "Jon Holt-Thomas   3 months ago I'd be happy to answer questions!",
                "Adam Humphreys   3 months ago Wordpress SEO is definitely my wheelhouse.",
                "Benjamn Conde   3 months ago I can help!",
                "Jackie C   3 months ago Hmm I feel like G2Crowd/Kevin Indig is good example of this with their review system and UGC Also Glassdoor is pretty good at this",
                "Adam Humphreys   3 months ago Kevin does a great job.",
                "Benjamn Conde   3 months ago I also work for a SaaS company!",
                "Riya Jain   3 months ago Any SEOs who have created and/or executed a Product-led SEO strategy for SaaS and would like to share their 2 cents and help others?"
            ]
        },
        {
            "message_text": "Chris Johnston   4:45 AM When I worked in local SEO several years ago I started writing reviews and adding photos to increase my Google Guide level (I think I'm a 7 now). I couldn't have imagined I would get so many views on my photos. If you are a local SEO professional I would urge you to contribute reviews, photos, and videos. There are some tangential benefits you can use in getting changes made to your clients GMB listings. Screenshot_20230801-081635.png  7 3 1 2 replies Last reply 3 months ago",
            "replies": [
                "John Ragon   3 months ago Thanks, thats a great tip!",
                "Rob Ainbinder   3 months ago @Chris Johnston I completely agree image.png  "
            ]
        },
        {
            "message_text": "Riya Jain   9:46 AM replied to a thread: Hi everyone, Another topic we have in pipeline- Product-led SEO Strategy for SaaS Would love to hear from people with experience in this space! View newer replies",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Majid Shah   11:47 PM Hi everyone, I was wondering if any one has an updated list of all SEO tools in an excel spreadsheet or G'sheet with their key features and pricing plan. Thanks in anticipation. 9 replies Last reply 3 months ago",
            "replies": [
                "Noah   3 months ago if you build it they will come (912 kB) https://media3.giphy.com/media/gZuxOq7zSL5DO/giphy.gif?cid=6104955e1ajnktrf36lj73dj98385g47dtfuumoz7kda46qt&ep=v1_gifs_translate&rid=giphy.gif&ct=g Posted using /giphy 2",
                "Adam Humphreys   3 months ago There is too many tools these days to count. People repackage ChatGPT and now there are more than I have ever seen.",
                "Micah Fisher-Kirshner   3 months ago Always wanted to riff on Scott Brinker's one for the MarTech landscape for the SEO one but then... https://chiefmartec.com/wp-content/uploads/2023/05/martech-map-marketing-technology-landscape-2023-slide.jpg (2 MB) https://chiefmartec.com/wp-content/uploads/2023/05/martech-map-marketing-technology-landscape-2023-slide.jpg",
                "Jason Wilson   3 months ago Should make an SEO one. This thing has become too bloated and you cant even tell what the software is unless you know the icons. 2",
                "Jason Wilson   3 months ago @Adam Humphreys the SEO one might look equally bloated lol. Now I want to make it 1",
                "Micah Fisher-Kirshner   3 months ago I wanted to make it look like a SERP tbh so it has a bit more flair 1",
                "Adam Humphreys   3 months ago It has enough flair to be a vest on a girl guide lol.",
                "Micah Fisher-Kirshner   3 months ago Pretty sure it would be good linkbait too, especially if you grey out companies that are actually owned by other ones (add some minor controversial things to it)",
                "Adam Humphreys   3 months ago Yoast, Raven lol.. so many more"
            ]
        },
        {
            "message_text": "Colt Sliva   5:47 AM @Noah did you make the logo for this slack 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Donna Donahue   8:47 PM Happy Friday Y'all 1 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Donna Donahue   8:58 PM anyone want to help me come up with a project? I created a survey for an SEO training I need to do for people in my company who don't know SEO, and I thought it was basic basic and I need to make it more basic than I made it, and I'm at a complete loss 34 replies Last reply 3 months ago",
            "replies": [
                "Shawn   3 months ago This would be a perfect use case for GPT I think - but also would be willing to help where I can",
                "Donna Donahue   3 months ago yeah I did that lol and it was still too high level I guess",
                "Shawn   3 months ago drats, lol",
                "Donna Donahue   3 months ago I was like \"really?\" and these are the people making 3x what I make?",
                "Shawn   3 months ago send it to me and Ill see what I can come up with shawn.l.huber@gmail.com",
                "Donna Donahue   3 months ago These are also the people directing down the pipeline what they want to see, yet have no clue what they're asking for",
                "Donna Donahue   3 months ago Thanks Shawn",
                "Donna Donahue   3 months ago Okay sent. Don't laugh, this was as dumbed down as I could come up with lol",
                "Shawn   3 months ago I think weve all been here before, Ive done quite a few lunch and learns in my past so no judgement at all!",
                "Shawn   3 months ago so is the purpose to help you know what to put into the SEO training or is it more how to talk to leadership when it comes to anything SEO?",
                "Donna Donahue   3 months ago We work with an agency also, and they originally wanted to do some ongoing trainings for the team of SEO best practice and I sort of stomped my foot",
                "Donna Donahue   3 months ago Well the target audience are technical writers, product managers etc",
                "Donna Donahue   3 months ago people who don't know what SEO is so they just put words on paper to reach the scientific community",
                "Donna Donahue   3 months ago if they thought my survey was too difficult, can you imagine  training where the agency was going to walk them through canonicals and schema, and so forth? 1",
                "Donna Donahue   3 months ago I was like \"are you asking these people to fall asleep in a training?\" It takes some of us years to figure that stuff out 1",
                "Shawn   3 months ago When I had to talk with engineers about SEO, I thought long and hard about how to get them engaged and excited so I gamified server response codes as an ice breaker - if they knew what a status code was they got a candy bar. In the end they all ended up with a candy bar for being there, but it was actually a lot of fun",
                "Donna Donahue   3 months ago So I'm starting with \"this is the anatomy of a SERP\", and showing them all of the things that can and does at times show up before the first place organic result, and explain why its so important that we have the right magic of meta data for click through rate and on page content for user engagement. I thought I'd start there.",
                "Donna Donahue   3 months ago oh and I'm going to provide a glossary of acronyms that if they hear me use them they can tally them up and I'll offer a prize to the person who catches me using them the most",
                "Shawn   3 months ago that would work too",
                "Shawn   3 months ago I borrowed this from an old Moz post from Rand on the Perfectly Optimized Page for my company now - https://trellislaw.notion.site/How-to-Optimize-8642b29b138d4a9f9fdfc9df66fa9ea1?pvs=4 Trellis on Notion How to Optimize 6 Important Keyword Targeting Elements (and 1 Not Important Element) (64 kB) https://trellislaw.notion.site/How-to-Optimize-8642b29b138d4a9f9fdfc9df66fa9ea1?pvs=4",
                "Shawn   3 months ago Its a tad outdated - but still a decent starting place, especially for folks that dont really know what SEO is or why/who its useful",
                "Shawn   3 months ago I wish my microsite that I created years ago was still live - there was some really good things in there like the glossary that the company did really appreciate - but its been 6 years since Ive left so they shut it down",
                "Donna Donahue   3 months ago actually that's not bad, I think I can do somethign with it",
                "Shawn   3 months ago Another borrowed asset from Moz on URLs https://trellislaw.notion.site/URL-Best-Practices-313cad0f68d344ebb20fb5e12259061e?pvs=4 Trellis on Notion URL Best Practices Keeping URLs as simple, relevant, compelling, and accurate as possible is key to getting both your users and search engines to understand them (a prerequisite to ranking well). Although URLs can include ID numbers and codes, the best practice is to use words that people can comprehend. (65 kB) https://trellislaw.notion.site/URL-Best-Practices-313cad0f68d344ebb20fb5e12259061e?pvs=4",
                "Donna Donahue   3 months ago maybe rather than even doing a survey I just do a short \"here's what's up\" and if someone wants follow up they may have questions that would lead to a second training.",
                "Shawn   3 months ago I put all of this on the company Notion for the engineers and other teams to refer back to when needed",
                "Donna Donahue   3 months ago Like if they don't know what they don't know, let me explain what I do and let them ask for more",
                "Donna Donahue   3 months ago When really what I want to say is \"all you need to know is send it to Donna when you're done writing it and she'll fix it up\""
            ]
        },
        {
            "message_text": "Donna Donahue   8:59 PM I mean, if someone doesn't even know anything at all I don't know what leading questions to ask. I'm trying to taylor a training around what they'd like to know",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Victor M Pan   1:22 AM Its random right? IMG_9835  ",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Micah Fisher-Kirshner   1:45 AM Sometimes not so random: 363384811_276686618309793_7536278758736613945_n.jpg  7 10",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Donna Donahue   2:13 AM I don't care who you are, that's funny 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "John Mueller   6:28 PM It's hard to get the Eddie Izzard Darth Vader voice right with email ... Screenshot 2023-08-07 at 15.24.26.png  28 5 2 +3 8 replies Last reply 2 months ago",
            "replies": [
                "Kyle   3 months ago To their credit, there are a lot of Johns, @John Mueller 1",
                "Jason Packer   3 months ago @John Mueller can you tell me about the history of dance? image.png  1",
                "Donna Donahue   3 months ago on a serious note, if you take OG as an example DM spam can get out of hand very quickly",
                "Jonas Sickler   3 months ago do you know who i am (2 MB) https://media3.giphy.com/media/2tDDjJpJhhaKc/giphy-downsized.gif?cid=6104955etjbvog8sje6ytrasgc9y9spbjz5uvpiot9jja7o5&ep=v1_gifs_translate&rid=giphy-downsized.gif&ct=g Posted using /giphy 2",
                "Donnie Strompf   3 months ago Do you ever ask how much for each link? You can give him your website to link to google.com maybe then you can rank #1 for the keyword Search Engine on google.com Instead of a listicle about 21 search engines you can use instead of Google article 1",
                "Adam Humphreys   2 months ago I have a special set of skills.",
                "Sarah Blocksidge   2 months ago I'm so late to seeing this but its amazing",
                "Jonti Bolles   2 months ago Great reminder! Now I have to go watch Eddie Izzard again. Priceless (both Eddie and your response)."
            ]
        },
        {
            "message_text": "Itamar Blauer   2:36 PM Anyone else getting super duper FOMO these past couple of days? image.png  12 10 5 replies Last reply 27 days ago",
            "replies": [
                "Gerry White   3 months ago Nope",
                "Adam Humphreys   2 months ago I feel like that when Brighton is on and there is no flights from Canada because tourist season just ended. Happened for Barbados Mastermind.",
                "Gerry White   2 months ago Barbados & SEO by the beach are my two ..... Extreme fomo",
                "Adam Humphreys   2 months ago Probably going to skip Barbados this year.",
                "Gerry White   27 days ago noo Adam."
            ]
        },
        {
            "message_text": "Chris Johnson   2:39 PM Always 2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Alex Wilson   5:35 PM You guys got BrightonSEO though right?",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "always good to get to Brighton I say 4 3",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Victor M Pan   6:17 PM For what its worth Ive never attended either! I actually prefer 1:1s via a Zoom or DMs before committing to meeting IRL 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Jason Wilson   10:53 PM @Victor M Pan it's a conference, there is no way you can 1:1 everyone there before meeting IRL. Not sure what you mean? 5 replies Last reply 2 months ago",
            "replies": [
                "Victor M Pan   3 months ago The way I operate is I slide into peoples DMs, do 1:1 in a Zoom, then when there is a conference I make it a point to meeting IRL. This creates deeper, intentional relationships. 2 2 1",
                "Victor M Pan   3 months ago One thing that helps me a lot is asking the person on the other side who else would you recommend I talk to to solve this problem and is there anything in my background they might find interesting or helpful! Im usually not at conferences for the talks because you can reach out to SME (subject matter experts) directly vs getting a generic deck. 1 1",
                "Jameson Treseler   3 months ago I really like this approach",
                "Jess Joyce   3 months ago This is how I met Victor and I love this approach too. Hes a lovely human to chat with and I look forward to our next nerd out convo!! 2",
                "Micah Fisher-Kirshner   2 months ago And I think we all hope that that will be at BrightonSEO this November too 1"
            ]
        },
        {
            "message_text": "Adam Humphreys   4:38 AM *.greet introductions 3 replies Last reply 2 months ago",
            "replies": [
                "Jess Joyce   2 months ago ???",
                "Adam Humphreys   2 months ago Wildcard, an all encompassing greeting for everyone coming in.",
                "Jess Joyce   2 months ago Gotcha Hello. 1"
            ]
        },
        {
            "message_text": "Paul Baterina   10:26 PM So - any gamers? 2 1 2 +7 51 replies Last reply 2 months ago",
            "replies": [
                "Becky Westmoreland   2 months ago Gamer SEO here - working on Fandom, GameSpot and GameFAQs - playing diablo 4 2",
                "Paul Baterina   2 months ago @Becky Westmoreland Diablo 4!! I have yet to beat the campaign . Next game that I have lined up is Baldur's gate 3!! 2",
                "Tyler Brown   2 months ago I'm ever so mildly tempted to take a leave of absence from my job to play that.",
                "Jamar Ramos   2 months ago Not as much as I used to, but Im big on replaying games I lovedand hated. Im trying Final Fantasy 8 for the fourth time. Hoping to finally finish it instead of quitting because I hate every character",
                "Paul Baterina   2 months ago Hahahah. I went back to Xenogears 4 times, to finally beat that game. I'm about to do that with Legend of Legaia, and Zelda Ocarina of time probably...",
                "Paul Baterina   2 months ago Which one @Tyler Brown ? Baldurs gate or D4?",
                "Tyler Brown   2 months ago Baldur's Gate. Middle-school Tyler ate that shit up.",
                "Paul Baterina   2 months ago HAHAHA",
                "Becky Westmoreland   2 months ago I play in 2 D&D games so i can wait on BG3 1",
                "Jamar Ramos   2 months ago @Paul Baterina I went back to Ocarina of Time after it released on the Switch online. It was my favorite Zelda game as a kid, but I didnt realize how empty the world was until I played it as an adult",
                "Victor M Pan   2 months ago ToTK still unopened. No I barely game now (kids) - kid of just Roblox with them as a chaperone",
                "Paul Baterina   2 months ago @Jamar Ramos empty.... go back to everquest if you were into MMORPG's",
                "Victor M Pan   2 months ago *kind",
                "Becky Westmoreland   2 months ago Ultimate Chicken Horse is fun with families and challenging",
                "Rick   2 months ago Yes. Bigtime PC gamer here. (>$4k spent on Steam games over 13 years) I'm a big fan of turn-based strategy (Total War), action & RPG (Spiderman, RDR2, Assassin's Creed, No Man's Sky).",
                "Paul Baterina   2 months ago @Rick Need to beat AC2. Heard that was one of the best ones.",
                "Rick   2 months ago @Paul Baterina Black flag is the top of AC mountain. https://www.ubisoft.com/en-us/game/assassins-creed/iv-black-flag ubisoft.com Assassin's Creed IV Black Flag | Ubisoft (US) Release Date: NOVEMBER 19, 2013 - In Assassins Creed IV Black Flag, play as young captain Edward Kenway, standing among legendary pirates such as Blackbeard, Calico Jack and Benjamin Hornigold, as you establish a lawless republic in the Bahamas and relive the truly explosive events that defined the Golden Age of Pirates.",
                "Becky Westmoreland   2 months ago I had an Assassin's Creed themed wedding",
                "Rick   2 months ago @Becky Westmoreland OMG. Do you have pics you can share?",
                "Paul Baterina   2 months ago Whaaat!!! That's pretty dope @Becky Westmoreland . Yeah you gotta share a pic LOL",
                "Paul Baterina   2 months ago Jk you don't have to .",
                "Dana DiTomaso   2 months ago We have more consoles here than people, but I'm mostly a PC gamer currently in love with my Steam deck.",
                "Paul Baterina   2 months ago @Dana DiTomaso what games do you play on your steam deck?",
                "Dana DiTomaso   2 months ago Right now I'm only playing Gloomhaven and Civ V because I don't have a ton of time to play and so am only playing games that I know and love. 1",
                "Becky Westmoreland   2 months ago i can share the cake easily - since i Have it as my discord server pic",
                "Dana DiTomaso   2 months ago I did play WoW for years and years, leading raids, the whole shebang, and then I had to retire because it was taking over my life.",
                "Rick   2 months ago @Dana DiTomaso Same. IO started playing in 2004 and lost a job and a girlfriend to WOW by 2007. It was not my   most mentally healthy phase.",
                "Paul Baterina   2 months ago @Dana DiTomaso ahh goood ole WoW days. - Silvermoon here. I did AQ40, then I stopped raiding after that and went straight to PVP 3v3 Arenaaaaaaaa"
            ]
        },
        {
            "message_text": "Abby Leigh Curtis   10:30 PM my boss and I want to start a game like Price is Right but for search volume 11 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Abby Leigh Curtis   10:31 PM any guesses? Screenshot 2023-08-10 at 1.30.54 PM.png  +2 11 replies Last reply 2 months ago",
            "replies": [
                "Jamar Ramos   2 months ago 10,000/month",
                "Christian Oliveira   2 months ago 30000/month",
                "Tyler Brown   2 months ago In Price is Right, guesses that are over lose, right? I'll go 1/mo. 2",
                "Jamar Ramos   2 months ago",
                "Victor M Pan   2 months ago Ohhhh hmmm English speaking, non-native speakers + teenage aged kids maybe some intent about chicken breasts mixed in 200,000? Is this global?",
                "Victor M Pan   2 months ago Haha also fun would be which tool - is bucketing used?",
                "Abby Leigh Curtis   2 months ago sure, we can say global. Semrush",
                "Crystal Ortiz   2 months ago 6600",
                "Abby Leigh Curtis   2 months ago 7.9K a month globally!",
                "Crystal Ortiz   2 months ago Wait does this mean I win this round?! 5",
                "Kevin Rowe   2 months ago Chicken"
            ]
        },
        {
            "message_text": "Joe Hall   4:01 AM Hey all, I have two invite codes for bluesky app, if you want one, DM me. +1 17 replies Last reply 2 months ago",
            "replies": [
                "Donna Donahue   2 months ago I just read something online, it's attempting to be a twitter replacement?",
                "Joe Hall   2 months ago yes its basically a twitter clone, founded by Twitter's old CEO.",
                "Mike Blazer   2 months ago I'd take one",
                "Riley Hope   2 months ago If you have any left",
                "Dan Rice   2 months ago How are you finding it @Joe Hall ? I intend to get on to it someday soon but not heard a lot about it to be honest",
                "Joe Hall   2 months ago @Dan Rice as far as functionality/design, its almost completely identical to twitter. There does seem to be less folks there and as a result they end up recommending a lot of accounts often. So I ended up following a lot of new folks that I normally wouldn't have before.",
                "Dan Rice   2 months ago Ok so it's a slow burn but might get there! If you ever get more invites I'd appreciate one :)",
                "Joe Hall   2 months ago yeah I'll come back to this thread if I get more.",
                "Bobby Kircher   2 months ago Ive got 4 invite codes if anyone wants one. 2 3",
                "Mike Blazer   2 months ago @Bobby Kircher I'd like one",
                "Dan Rice   2 months ago @Bobby Kircher I would love one!",
                "Bobby Kircher   2 months ago Ive got 2 more! Send me a DM if you want one.",
                "Donna Donahue   2 months ago Thanks for the offer. I think I need another method of social media like a hole in the head. Plus I'm not a Jack Dorsey fan",
                "Dan Rice   2 months ago Tbh I am not a fan of any of them! Three bad options to replace what twitter was. Just think it'll lead to a bunch of worse networks as it has proven so far",
                "Bobby Kircher   2 months ago Im liking this Slack much more than any social network TBH",
                "Dan Rice   2 months ago Yeah, that's my feeling on the digital marketer side of life. But Twitter used to be there for my education people, my startup people, a few football people and things like journorequests. There is a lot it used to do in one and I see it's splintering (without being able to splinter myself into all the places)",
                "Joe Hall   2 months ago I have another bluesky code. if anyone wants it, let me know."
            ]
        },
        {
            "message_text": "Riley Hope   8:29 PM A long long shot but any SEOs in ? Specifically Tokyo, Kyoto, or Osaka? 1 2 replies Last reply 2 months ago",
            "replies": [
                "Jason Wilson   2 months ago I may know some from my Salesforce days. Let me see if I can find a former colleague in Japan and will ask if they have references. No promises, but remind me if I don't reply here. 1",
                "Riley Hope   2 months ago @Jason Wilson thanks! No rush/not work related, my husband and I are spending two weeks hopping around the 3 cities but is always nice to connect with people! 1"
            ]
        },
        {
            "message_text": "Dan Rice   12:32 PM Is anyone here still majoring on Twitter? It used to be my number one network by miles but barely use it any more. Partially replaced it with Threads, partially with a few slack groups including this one, but nothing is close to Twitter how it was. Is Blue Sky the answer or is there no answers right now? 1 1 4 replies Last reply 2 months ago",
            "replies": [
                "Noah   2 months ago I launched this community to give us a place to gather and so far so good. 3",
                "Cherie Dickey   2 months ago I've never been super active as a commenter or poster on social media, but I do tend to participate in more private channels like this (time permitting). I think more for privacy reasons. Twitter has been a great place to lurk and just make sure I'm not missing any major industry news. It's how I heard about this community But the experience has changed over there. I have a feeling this group is going to be my new primary home for SEO. 1",
                "Tyler Brown   2 months ago Reddit for local stuff, Slack for SEO, and Substack for news/thought leaders.  All of which used to be from Twitter, pre-Musk. (edited)  1",
                "Rick   2 months ago I built my career, and many important social relationships, on Twitter over the past decade and a half. It's a real bummer what's happened. RE: @John Mueller \"What is the value of a well-curated, topical-expert-managed forum nowadays?\" For me, it's the value of making friends with people I had no chance to meet or interact with otherwise. 1"
            ]
        },
        {
            "message_text": "Jono Alderson   3:34 PM Anyone in London tomorrow evening, fancy hanging out? :)",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "This message was deleted. +3 12 replies Last reply 2 months ago",
            "replies": [
                "Anurag Singhal   2 months ago Isnt it more like most SEOs are awesome people these days? (or am I living in a bubble!)",
                "Anurag Singhal   2 months ago Also, the SEO community was biting nails when Google was about to cut workforce and Gary posted the future of his team was uncertain. Can we all send a signed petition to these higher up leads to never cut a single person from this team ever?",
                "Colan Nielsen   2 months ago Hi John, not sure if this is what you are looking for, but I think it's always worth noting that SEOs make up a significant portion of Google Product Experts. At least in the Search, Maps, and Google Business Profile forums. We can't be all that bad while simultaneously volunteering thousands of hours each year helping Google improve their products 5",
                "Mike Blazer   2 months ago Webmasters do exist, but so do webmistresses. And Google, as we know, strives for \"inclusive language\".  (edited) ",
                "Jono Alderson   2 months ago I'm making a presentation for higher-up leads to explain that \"webmasters\" do not exist anymore Wow, that's suuuuuper interesting context. Anecdotally, I've seen a lot of conversations with/by Google folks where they don't seen to understand the realities of how sites are managed/developed/run (badly, on shoestrings, often by agencies or under-resourced small businesses; with some really bad misunderstandings of how small shops and ecommerce sites operate), and how much the SEO industry is 'accidentally' relied on to carry a lot of the burden of education, communication and encouraging active improvement, quality, content creation, etc down on the ground. No 'normal' human or business has ever read (or understood, or actioned) anything that Google's published about algorithm updates, policies or schema We're the intermediaries. Very much appreciate you fighting those perceptions on our behalf  (edited)  3",
                "Dave Smart   2 months ago Kinda expanding on @Jono Alderson point, I think we find ourselves being the human interface, in some cases between very distraught people facing real world consequences because they have made the wrong move in the past, and what they perceive as a dispassionate, uncaring and perhaps even malicious entity in google / other search engines. We find ourselves the bridge to explain it's not personal, Google's looking for a certain thing (or set of things) and it will show things in a best effort ranking based on that. It's not against you. To use Jono's words, sometimes we have to be the not normal humans, part councilor and part staffing the confessional box. I don't think it's that Google don't care, in some ways you would have to be a step removed and a little dispassionate about the plight of an individual site to actually make a good search engine. But it is a high level view more than a 1:1 struggling business view. You, and the search relations team are a very, very helpful, useful bridge that clearly DO care, and do work to help folks, but you are few, the internet is many, so it seems to often fall on SEO's to help point folks back to the right track. The documentation and outreach your team is responsible for is super valuable in this, and I.M.H.O getting better all the time. But there will always have to be some disconnect, just from scale purposes only. That's where (good) seo's hopefully come in, and offer value. There will always be some bad actors, there is in any industry, but hopefully as things progress, the industry matures, the ratios will get better there. (edited)  3",
                "Cherie Dickey   2 months ago \"No 'normal' human or business has ever read (or understood, or actioned) anything that Google's published about algorithm updates, policies or schema We're the intermediaries.\" This... So many times this. This is most of our job I feel. Nobody but my team is reading the guidelines, and we spend a TON of time explaining/teaching. I'm not even sure those folks read the resources we provide to back ourselves up. And thinking that all SEOs are universally bad is like saying that all car salesmen are slimy lemon selling crooks. Or all lawyers are ambulance chasers. I think there are unethical actors in every field. It comes down to what motivates you... is it just money? Or do you actually care about the work and the people you do that work for? I like to think the majority of us want to do things the right way. 1 2 1 1",
                "Jono Alderson   2 months ago Broadly, completely agree. With some exceptions, where Google's model enforces/rewards bad behaviour (eg, recipes). Historically I'd also have considered \"comparison queries\" along with that, but reviews updates have helped.",
                "Jono Alderson   2 months ago That said, you can still make a poor fit brand/site/page rank unfairly well by throwing enough \"digital PR\" money at an agency, to the point that some SERP categories favour not-helpful/generic (but big name / recognizable) brand results over more useful/authentic/etc resources. (edited) ",
                "Dave Smart   2 months ago  Good SEO is invisible to all but trained experts. If the average user sees SEO, it's a sign of bad SEO. I'd say that's pretty true a lot of the time. The perceived (by non-experts) bad SEO is actually just bad content and good SEO. Perhaps, to some extent. But also miss-attributing some things, like rambling recipe opening, that are often more about having enough content to put ads on the page and some issues around copyright law. Same way that X best X of {enter_year} is perhaps partly SEO's issue, partly the fault of affiliate programs and plugins making it easy / low effort to do these, and payouts so low it's not seen economically viable to put the effort in. SEO is a convenient boogey man, sometimes it legitimately is the monster under the bed though. Non-experts complaining about bad SEO suggest that bad content ranked well (the assumption being it's due to SEO), which is actually Google's problem. Yes, in a way. And it's a hard sell to tell folks to do it right  when they can point to poor practices seemingly doing well. Even if longer term the bad content doesn't continue to do well. But also perhaps it's a gap where there might only be bad content to show? Or at least the content they wanted to see wasn't there. Also I think a healthy dose of some of those complaints are actually coming not from non-experts, but from SEO's for whom spam means Sites Positioned Above Mine. (maybe that is non-experts ) Perhaps SEOs who haven't had the results they hoped for so they have had a tantrum and swore only to use DDG to search and add 'Reddit' to every search. 1",
                "Kevin Pauls   2 months ago Speaking from the frustrations of business owners using the GBP. And I Quote: \"How is \"competitor x\" ranking like that when they are clearly going against Google's guidelines. Why is it that when I do it the way Google says I need to do it people can't find my business and these other scammers get all the phone calls because they are ranking\" I think there is this disconnect between what is experienced in the results and what we preach from the guidelines on Google's behalf. There is a trust that is broken because reality is conflicting. I am not sure how to get around that. The GBP is a phenomenal tool and has changed peoples lives for the better, but the experience and frustration from business owners is real."
            ]
        },
        {
            "message_text": "Daniel Zuccon   6:36 AM ICYMI, OpenAI's ChatGPT can be officially recognised as GPTBot now: https://platform.openai.com/docs/gptbot I was intrigued, so I started collating a list of some big, public sites that are blocking ChatGPT from crawling them by default. https://github.com/zuccs/disallow-chatgpt/ if you notice any other cool ones in the wild, feel free to DM me, or submit a PR! platform.openai.com OpenAI Platform Explore developer resources, tutorials, API docs, and dynamic examples to get the most out of OpenAI's platform. GitHub GitHub - zuccs/disallow-chatgpt: A list of public sites that are blocking ChatGPT robots A list of public sites that are blocking ChatGPT robots - GitHub - zuccs/disallow-chatgpt: A list of public sites that are blocking ChatGPT robots (87 kB) https://github.com/zuccs/disallow-chatgpt/ 2 1 1 reply 2 months ago",
            "replies": [
                "Anurag Singhal   2 months ago very cool initiative, thanks for sharing 1"
            ]
        },
        {
            "message_text": "Adam Humphreys   8:29 AM Are we about to lose valuable snippets like this: Garlic, specifically the chemical compound allicin inside garlic, is a powerful antibiotic. Some European beliefs around vampires stated they were created by a disease of the blood, so a powerful antibiotic would kill a vampire. 3 replies Last reply 2 months ago",
            "replies": [
                "Dave Smart   2 months ago Valuable to some @Adam Humphreys tenor_gif6751199011173507163.gif  2",
                "Dana DiTomaso   2 months ago If you're trying to kill a vampire, you don't have time to click on a search result and wait for the page to load, obvs. 2",
                "Dave Smart   2 months ago Van Helsing, CWV optimiser."
            ]
        },
        {
            "message_text": "Richard Gargan   4:21 PM Hey @John Mueller I'm making a presentation to explain that big tech censorship does not exist anymore, and \"search engines\" are not universally bad For example Google sells 6+ links on each of its pages, then advises other websites to refrain from selling links https://developers.google.com/search/blog/2013/02/a-reminder-about-selling-links (Other search engines like https://kagi.com/ dont sell links!) If Google does something obnoxious like get into more trouble with the DoJ before I present, I will be upset. What else should I explain that they might not realize? (Note this is satire to parody your post above (https://theseocommunity.slack.com/archives/C05H6N2833R/p1691964904957739) and Google in general, and is designed to get a LOL, nothing personal) (edited)  2 4 replies Last reply 2 months ago",
            "replies": [
                "Noah   2 months ago Hey Richard!  Welcome to the group.  Were pretty blessed to have John in the group actively helping users with issues theyre facing. Lets avoid @ing him or employees of other Search engines, or SEO tools here. This community is a subtweet free zone and this post is right on the edge (if not over the line) of our guidelines 1A. Im reacting to this post in this way so that we all get on the same page early about how we treat each other here. 3",
                "Richard Gargan   2 months ago Hey Noah, fair enough, I get the spirit of the rules and this community With regards to the letter of the rules, I don't use Twitter, and could use some clarification please Googling \"subtweet\", it says that it's criticizing without @ing the person. But I did @ above Regardless, I get that you don't want things to degenerate into a negative criticizing atmosphere",
                "Noah   2 months ago Thanks for understanding. The goal of the community is to help build each other up and the post didnt come across that way.",
                "Adam Humphreys   2 months ago Google does not say you cant have ads on your website and states you must clarify if its such with markup. Further, if you have contextual links with exact match anchor text broadly across pages designed to manipulate search then it violates their terms. So that said, link away to a million sites with the ads tag but keep in mind even legally if its paid for it must be disclosed."
            ]
        },
        {
            "message_text": "Abby Leigh Curtis   10:15 PM Does anyone here know any lawyers that may be able to help me with identity theft involving Uber and Doordash drivers? 4 4 replies Last reply 2 months ago",
            "replies": [
                "Jameson Treseler   2 months ago What state? If California I can ask around.",
                "Abby Leigh Curtis   2 months ago at the time my identity was stolen, I was an MA resident",
                "Jameson Treseler   2 months ago Ah ok. Well I can ask some attorney friends if they know anybody in MA. If I hear of anyone I can reach back out. Sorry that happened to you.",
                "Abby Leigh Curtis   2 months ago thank you"
            ]
        },
        {
            "message_text": "Paul Baterina   10:46 PM Out of Curiosity What got you all into SEO in the first place? I'll start. I graduated college with a comm degree, didn't know what to do. I just wanted to get a degree to make my dad happy (first one in the family to finish College). Afterwards, I just played videogames (League of Legends), to a point where my girlfriend's (fianc now) mom said I was useless, and rightfully so lmao.  This was the same time I had just buried my best friend rest in peace.  This was all in 2012. And so I got desperate, typed \"how to make money online,\" that lead me to the warriorforum (any warriors in here? Lol), where I was super active...And that's where I learned and debated. And networked. And applied. And debated. And asked. And learned. And applied. And networked. And debated. Which obviously lead me into the SEO realm for over 10 years now.. both in-house/corporate + side hustle. So if I look back into it, the fire sparked from the doubters, and desperation of making some form of income is what got me here. I'm at that point now in my life, where okay - so what's my purpose? Anything I can do with SEO asides from driving traffic and revenue? Time will tell. All self motivation perhaps, and meeting a ton of great people in the past that guided me along the way. And I can't wait to meet (and I'm already meeting a ton of people here) a lot of you in this slack group. I've used slack for years, and I'm in various slack groups. This is the first time where I have over 10 people in DM's and this group isn't even a month old ish? (edited)  5 3 +7 16 replies Last reply 2 months ago",
            "replies": [
                "Shawn   2 months ago It was the Late 90s and built my first hobby site and wanted to see it on Alta Vista, Yahoo, etc. Was fascinated by these directories and the process of building sites. Helped some family friends with local businesses until I got my first office job for a automotive marketing agency in the dot boom/bomb time. Crazy to think that was less than 20 years ago. Crazy how much has changed and how quickly. 2",
                "Jameson Treseler   2 months ago Ooof. Well my mom was (is) a director of marketing since I was 4. She would constantly bring work home and use us as guinea pigs. Basically we learned marketing psychology from a super early age. Fast forward to college, I was super interested in entrepreneurship, and in one class, the Teacher's Assistant said if I wanted to be a successful entrepreneur, I needed to learn how to code. So I tried. Learned CSS and HTML to start. Then my fiancee (now wife) said I needed to find a job. So I looked or an externship and found a real estate externship. Turns out they were an SEO division within a larger real estate app. They showed me how they applied marketing psychology to the code I learned. It just clicked. Been doing SEO ever since, for huge brands, small SMBs, and especially startups. Still love entrepreneurship and startups, so I work almost exclusively with fintech startups and cbd startups. (edited)  1 1",
                "Nathan Driver   2 months ago I had a hip hop website and in the first year was nominated by Vh1 hip hop honors for best urban culture website. We didn't win. Yet, I was intrigued by the growth and then started researching the 'how' site ranked. I would then create hundreds of sites to see if I could get them ranked...and they did. Dipped into affiliate marketing and resulted in working at an Ad Agency, from there went into news, finance, ecommerce and back to the agency world. 2",
                "Matt McGee   2 months ago I was building websites in the mid-'90s. Mostly for myself until 1997 when I started working at a local web host/ISP. Clients loved the sites we built for them, but they'd come back a month or two later with \"no one is visiting\" and \"no one can find our site.\" So I taught myself SEO by reading Danny Sullivan's \"Webmasters Guide to Search Engines,\" which later became Search Engine Watch.",
                "Bobby Kircher   2 months ago ^ Back when ISPs built websites!",
                "Sophie Brannon   2 months ago Wanted to be a journalist, went through all of the training, got my NCTJ Gold Standard, moved out of London with my partner at the time and found it harder to get a role other than in local news which I didnt want and also just didnt enjoy journalism anymore. At 20, I fell into a copywriting position at an agency, and grew into SEO from there. After much convincing after a few years, I moved into an account management position, quickly fell in love with SEO. SEO account manager > senior SEO manager > head of content > client services director all at the same agency. Dabbled in social, ppc (mostly integrated campaigns), email marketing, managed web dev projects/UX campaigns/migrations etc. every industry you can imagine I probably worked on a campaign in it. Took some time out to freelance and travel and now Im back in the UK, at 27, working for an incredible eComm company based in Philadelphia serving the US and loving it as Director of SEO. Wouldnt change it for the world! 2",
                "Mike Blazer   2 months ago I saw that I could make money with my sites if I could figure out how to get some traffic to them. So I started figuring out how to get traffic... Later I've found out that it's is called SEO. 1",
                "Bobby Kircher   2 months ago I got my first taste of building websites during my internship while studying Information Studies at Florida State in 1997. From there, I got a job in Atlanta at MCI Worldcom and programmed websites for their Intranet. Eventually, I started building websites on the side and learning about SEO. My partner then owned an e-commerce website hit by the Florida update in 2003 and joined him at SES in Chicago that Fall. As you can imagine, Florida was all the talk then. I even joined him for a Bruce Clay training to figure out a solution for the fix. In 2004, I was let go from Worldcom after their bankruptcy, my side hustle turned into full-time, and I helped my partner get out of the Florida hole. It was my first SEO win, and I was hooked! 1",
                "Russ Allen   2 months ago Proofreading > Social Media > PPC & SEO > Online Reputation > Digital Marketing Manager > Social Media Strategist > GOT FIRED AND HAD A CRISIS BUT THEN DECIDED TO COMMIT TO SEO FULL TIME > SEO Analyst > Senior SEO Analyst 1",
                "Matt McGee   2 months ago ^ Back when ISPs built websites! @Bobby Kircher right?? There were 2 ISPs in town then, and we were first to start doing business websites. I was the first SEO in town and possibly the first in all of E. Washington. Maybe the whole state, for that matter. Those were the days...... 3",
                "Victor M Pan   2 months ago Saw an infographic, thought it was cool, said I wanted to learn more for whoever created that. Two week unpaid internship turned to a full time job where we did growth tactics at all costs trying something new every week. 1",
                "Mary Albright   2 months ago was a fashion model on set one day and found out nordstrom was gonna start tracking which of us models performed better for sell through rates on web, freaked out about the death of modeling, went to college to study math and philosophy, ended up just doing philosophy, got a job at a think tank doing neural net fun stuff, then marketing agency doing writing, then another agency doing seo content, then just plain old seo. got bored doing the same old thing everyone else was and started building tools to automate things and now im full circle back at a fashion company but as head of seo so i get to build fun stuff and test cool things",
                "Mary Albright   2 months ago @Victor M Pan so infographics DO CONVERT!!! hahah",
                "Victor M Pan   2 months ago Yeah that weird one where mesothelioma had a high CPC did. Its been too long Mary hope all is well. 1",
                "Monty   2 months ago Some really wild stories here. Most of you guys started in SEO when I wasn't even born 1"
            ]
        },
        {
            "message_text": "Donna Donahue   11:00 PM replied to a thread: Out of Curiosity  I went to an SEO conference because I was told I needed to learn what it was because we didn't have a marketing budget just a website. I became very interested in it so learned everything that I could and went to work for U-Haul. I worked directly with their SEO specialist and learned more and after he quit I told our director I wanted to take over for him. I was told that when a new person was hired for SEO they were going to need to know more about SEO than the director at the time. So I said \"teach me then, I'm already here\" Needless to say I wasn't considered and someone younger and didn't even know as much as I did got the job. I vowed then to learn everything about everything I could. I joined communities, asked questions observed etc. In just 5 short years I was a manager. I haven't looked back since. I was bound and determined to never be passed up because of my age or gender again, and I haven't. (edited)  6 View newer replies",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Donna Donahue   11:18 PM Raise your hand if you wish Google would give use a mere 5 characters more for a title and 10 for a description (yes I know Google doesn't care as much about descriptions, but I like them) It's hard keeping things short when your field is scientific and one piece of equipment name could take up the entire title 2 15 replies Last reply 2 months ago",
            "replies": [
                "Dana DiTomaso   2 months ago I honestly don't care about title tag length. Google reads and uses the entire thing. I saw a presentation where someone had around 2000 characters in their title tag and were ranking for unique terms that they only included at the end of the tag. 1",
                "Donna Donahue   2 months ago for real? That truncates the SERP though, and my anal retentive nature (I don't color outside the lines) has an eye twitch",
                "Dana DiTomaso   2 months ago They're going to truncate it anyway, or rewrite it, so I don't worry about it.",
                "Donna Donahue   2 months ago lol fair enough",
                "Dana DiTomaso   2 months ago I'd say give it a shot on a couple of pages, go wild with title tag length and see what happens!",
                "Donna Donahue   2 months ago I will say I will give it my best effort and try not to have a panic attack while doing so 1",
                "Donna Donahue   2 months ago Thanks Dana 1",
                "Boris Kuslitskiy (he/him)   2 months ago I recently read the webmaster guidelines for title tags and surprisingly there wasn't any mention of length there.",
                "Donna Donahue   2 months ago och, I give up",
                "Boris Kuslitskiy (he/him)   2 months ago Yeah! That's how I felt. Was writing regex and wanted to double check the character count. (edited) ",
                "Donna Donahue   2 months ago so what exactly is our job? Read a lot of SEJ?",
                "Boris Kuslitskiy (he/him)   2 months ago My previous job description and yearly performance appraisal both included  staying up to date by reading industry news.",
                "Boris Kuslitskiy (he/him)   2 months ago So, yeah, I guess.",
                "Donna Donahue   2 months ago Cool, 7 years of that and then retire",
                "Donna Donahue   2 months ago Could be 5 years just depends on how sick I am of working then lol"
            ]
        },
        {
            "message_text": "This message was deleted. 1 reply 2 months ago",
            "replies": [
                "Donna Donahue   2 months ago you can control what notifications you want 1"
            ]
        },
        {
            "message_text": "Russ Allen   12:18 AM Thought I was going to be promoted to Associate Director of SEO today, but it didn't happen. Pretty lame feeling. 7 3 2 +3 10 replies Last reply 2 months ago",
            "replies": [
                "Hank Hoffmeier   2 months ago Bummer. Keep your head up. Maybe something great will happen.",
                "Russ Allen   2 months ago Thanks, Hank. The company would lose 15% of its revenue if I left, but I guess it's not good enough.",
                "Noah   2 months ago Its a big world out there. 1",
                "Mark Alves   2 months ago Im sorry, Russ. Ive been there.",
                "Donna Donahue   2 months ago When one door closes a window opens (edited) ",
                "Hank Hoffmeier   2 months ago Make sure that you be transparent about your feelings around what happened. I made the mistake of not doing that in the past and when I went to put in my notice after finding a new role for more money, my manager asked why I did not let her know I was not happy. Long story short. I am still with the same company and I am happy. We worked it out. I also learned to be as transparent as possible. 2",
                "Adam Humphreys   2 months ago I would consider working with whomever the decision maker is and ask about why you were not placed there. It might have nothing to do with skill in search.",
                "Jameson Treseler   2 months ago It sucks, but you're going to get there.",
                "Donna Donahue   2 months ago Did they hire someone else? Or did they decide to not have that position",
                "Cynthia Lopez Olson   2 months ago I'm so sorry! This happened to me a few months ago, I was devastated. But this week I started a new job where I finally got that promotion! Don't let this setback stop you from reaching your goals  (edited)  1"
            ]
        },
        {
            "message_text": "Adam Humphreys   1:49 AM The jokes seen below someones ad is pretty epic. Screenshot 2023-08-14 at 2.48.27 PM.png  2",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Boris Kuslitskiy (he/him)   1:50 AM Does nobody like that structure on account of the way that it is? 1 reply 2 months ago",
            "replies": [
                "Adam Humphreys   2 months ago The word structure or the building? The Saddle Dome is about to be retired for a new NHL building."
            ]
        },
        {
            "message_text": "Donnie Strompf   6:26 AM A few minutes ago, I get a Skype notification that I am unable to login (third time today) when I wasnt trying to login. A login and boom its chatGBT on Bing pulling me into a conversation. I took the conversation and ended up teaching the system about a website I just launched that offer something no one else does. We went back and fourth for about 20 minutes where Bing would agree with part of my answe and give me a however response until I ran it out of options. By the end of the conversation it was agreed that my website was the best website and only website that offers this solution. I asked it to list companies that sell this service and I was the only website mentioned 1",
            "replies": [
                "There is no reply thread in this message"
            ]
        },
        {
            "message_text": "Adam Humphreys   7:58 AM Two Podcasts I recommend, Hubermans Lab (because health is the first wealth), My First Million because its inspiring for people in the web space. 1 reply 2 months ago",
            "replies": [
                "Matthew Bardsley   2 months ago Mind Pump is a good fitness one too. They also cover a lot of fatherhood topics which is cool for any dads 1"
            ]
        },
        {
            "message_text": "Mike Blazer   10:51 AM If you like watching/listening to podcasts, here's my list of 158 SEO related YouTube channels I'm following: https://bit.ly/YT-SEO-Channels Feel free to suggest other YouTube channels for me to add to the list. Screenshot_20230816_084920_X.jpg  10 5 5 replies Last reply 2 months ago",
            "replies": [
                "Dan Rice   2 months ago I will definitely be taking a look at this. Top work! Especially since I need to collate resources on specific learning points for our course 1",
                "Justin Briggs   2 months ago Appended channel metrics to the list to help me sort. CSV attached. (edited)  seo-yt-metrics-appended.csv   # YT Channel Name YT channel URL Sub Count # Videos Joined Age (Days Old) Channel Views Avg Views Per Video 44 Google Chrome Developers https://www.youtube.com/@ChromeDevs 707,000 1,500 4/23/12 4,132 87,767,687 58,512 92 Neil Patel https://www.youtube.com/@neilpatel 1,190,000 1,300 8/18/11 4,381 57,817,526 44,475 45 Google Search Central https://www.youtube.com/@GoogleSearchCentral 575,000 1,800 1/9/09 5,332 57,022,267 31,679 47 Google TechTalks https://www.youtube.com/@GoogleTechTalks 342,000 2,300 8/15/07 5,845 55,618,763 24,182 35 Duda https://www.youtube.com/@dudamobile 10,800 285 8/1/11 4,398 32,007,639 112,308 125 Semrush https://www.youtube.com/@semrush 163,000 530 4/8/14 3,417 28,085,062 52,991 50 HubSpot Marketing https://www.youtube.com/@HubSpotMarketing 336,000 704 4/23/07 5,959 27,245,464 38,701 https://www.youtube.com/@AhrefsCom 429,000 289 8/8/15 2,930 20,224,163 69,980 https://www.youtube.com/@BrianDean 529,000 69 1/14/13 3,866 15,776,047 228,638",
                "Mike Blazer   2 months ago @Justin Briggs Good stuff. Thanks, will update the ahewt with your data pretty soon",
                "Mike Blazer   2 months ago @Justin Briggs I've updated the table with your data. How did you count Avg Views Per Video?",
                "Justin Briggs   2 months ago [Channel views] / [# of videos]. Both were pulled off the /about page for each channel. (edited)  1"
            ]
        }
    ]
}